{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "def": 279, "remove_old_kernels": 280, "filename": 281, "glob": 282, "os": 283, "path": 284, "dirname": 285, "__file__": 286, "kernel_": 287, "cu": 288, "generate_new_kernels": 289, "scalar_type": 290, "dtype": 291, "itertools": 292, "product": 293, "scalar_types": 294, "dtypes": 295, "all_template_str_list": 296, "group_blocks": 297, "m_blocks": 298, "thread_configs": 299, "thread_m_blocks": 300, "order": 301, "case": 302, "only": 303, "support": 304, "gptq": 305, "int4": 306, "int8": 307, "ku4b8": 308, "ku8b128": 309, "continue": 310, "256": 311, "small": 312, "batch": 313, "need": 314, "128": 315, "large": 316, "64": 317, "channelwise": 318, "quantization": 319, "group_size": 320, "fp8": 321, "kfe4m3fn": 322, "nvfp4": 323, "supports": 324, "16": 325, "mxfp4": 326, "32": 327, "kfe2m1f": 328, "methods": 329, "don": 330, "k_blocks": 331, "n_blocks": 332, "threads": 333, "c_dtype": 334, "half": 335, "fp16": 336, "else": 337, "nv_bfloat16": 338, "is_zp_float_list": 339, "false": 340, "ku4": 341, "hqq": 342, "is_zp_float": 343, "true": 344, "4bit": 345, "append": 346, "s_type": 347, "elif": 348, "kfe8m0fnu": 349, "cannot": 350, "safely": 351, "dequantize": 352, "e8m0": 353, "so": 354, "skip": 355, "kfloat16": 356, "bf16": 357, "kbfloat16": 358, "template_str": 359, "jinja2": 360, "template": 361, "render": 362, "scalar_t": 363, "w_type_id": 364, "id": 365, "s_type_id": 366, "max": 367, "thread_n_blocks": 368, "thread_k_blocks": 369, "m_block_size_8": 370, "stages": 371, "pipe_stages": 372, "file_content": 373, "file_head": 374, "join": 375, "lower": 376, "spdx": 377, "license": 378, "identifier": 379, "apache": 380, "filecopyrighttext": 381, "copyright": 382, "project": 383, "import": 384, "subprocess": 385, "auto": 386, "generated": 387, "generate": 388, "py": 389, "clang": 390, "format": 391, "off": 392, "kernel": 393, "marlin_template": 394, "namespace": 395, "marlin_namespace_name": 396, "strip": 397, "__global__": 398, "void": 399, "marlin": 400, "marlin_kernel_params": 401, "zero": 402, "point": 403, "ku8": 404, "supported": 405, "add": 406, "reduce": 407, "wheel": 408, "__name__": 409, "__main__": 410, "cutlass": 411, "epilogues": 412, "introduction": 413, "document": 414, "describes": 415, "various": 416, "implemented": 417, "fusing": 418, "de": 419, "operations": 420, "onto": 421, "gemms": 422, "currently": 423, "symmetric": 424, "weights": 425, "asymmetric": 426, "activations": 427, "both": 428, "can": 429, "quantized": 430, "per": 431, "tensor": 432, "token": 433, "scaledepilogue": 434, "bias": 435, "scaledepiloguebias": 436, "scaledepilogueazp": 437, "scaledepilogueazppertoken": 438, "do": 439, "final": 440, "binary": 441, "instead": 442, "passed": 443, "epilogue": 444, "induces": 445, "redundant": 446, "addition": 447, "operation": 448, "runtime": 449, "check": 450, "performance": 451, "minor": 452, "underlying": 453, "linear": 454, "algebra": 455, "more": 456, "details": 457, "activation": 458, "rfc": 459, "3975": 460, "widehat": 461, "matrices": 462, "become": 463, "following": 464, "math": 465, "s_a": 466, "j_a": 467, "z_a": 468, "s_b": 469, "here": 470, "output": 471, "gemm": 472, "scales": 473, "respectively": 474, "matrix": 475, "ones": 476, "dimensions": 477, "additional": 478, "would": 479, "required": 480, "expanding": 481, "further": 482, "calculate": 483, "follows": 484, "left": 485, "note": 486, "raw": 487, "known": 488, "ahead": 489, "each": 490, "row": 491, "equal": 492, "mathbf": 493, "vector": 494, "column": 495, "sums": 496, "computes": 497, "meaning": 498, "parameters": 499, "scale_a": 500, "scale": 501, "scalar": 502, "scale_b": 503, "always": 504, "because": 505, "term": 506, "has": 507, "every": 508, "precomputed": 509, "stored": 510, "azp_with_adj": 511, "generally": 512, "points": 513, "kernels": 514, "efficiently": 515, "users": 516, "must": 517, "precompute": 518, "pass": 519, "same": 520, "above": 521, "means": 522, "becomes": 523, "outer": 524, "azp_adj": 525, "adjustment": 526, "azp": 527, "performs": 528, "computation": 529, "where": 530, "dq": 531, "out": 532, "class": 533, "scheduleconfig": 534, "tile_shape_mn": 535, "tuple": 536, "int": 537, "cluster_shape_mnk": 538, "kernel_schedule": 539, "mixedinputkernelscheduletype": 540, "epilogue_schedule": 541, "epiloguescheduletype": 542, "typeconfig": 543, "datatype": 544, "union": 545, "vllmdatatype": 546, "b_group_scale": 547, "b_group_zeropoint": 548, "b_channel_scale": 549, "a_token_scale": 550, "prepacktypeconfig": 551, "b_num_bits": 552, "convert": 553, "implconfig": 554, "types": 555, "schedules": 556, "list": 557, "generate_sch_sig": 558, "schedule_config": 559, "str": 560, "tile_shape": 561, "cluster_shape": 562, "vllmkernelscheduletag": 563, "split": 564, "epiloguescheduletag": 565, "tile_scheduler": 566, "tileschedulertag": 567, "return": 568, "generate_terse_sch_sig": 569, "kernel_terse_names_replace": 570, "kerneltmawarpspecializedcooperative": 571, "tmami_": 572, "tmawarpspecializedcooperative_": 573, "tmacoop_": 574, "streamkscheduler": 575, "streamk": 576, "sch_sig": 577, "orig": 578, "terse": 579, "items": 580, "replace": 581, "generate_type_signature": 582, "kernel_types": 583, "vllmdatatypenames": 584, "getattr": 585, "field": 586, "name": 587, "fields": 588, "generate_type_option_name": 589, "b_": 590, "with_": 591, "_type": 592, "is_power_of_two": 593, "to_cute_constant": 594, "value": 595, "_to_cute_constant": 596, "isinstance": 597, "iterable": 598, "unique_schedules": 599, "impl_configs": 600, "set": 601, "sch": 602, "impl_config": 603, "unsigned_type_with_bitwidth": 604, "num_bits": 605, "u4": 606, "u8": 607, "u16": 608, "u32": 609, "u64": 610, "create_template": 611, "globals": 612, "update": 613, "template_globals": 614, "create_sources": 615, "num_impl_files": 616, "sources": 617, "machete_mm_dispatch": 618, "mm_dispatch_template": 619, "prepack_types": 620, "convert_type": 621, "vllmdatatypesize": 622, "accumulator": 623, "prepacked_type_key": 624, "prepack_type": 625, "now": 626, "first": 627, "type": 628, "seen": 629, "since": 630, "core": 631, "shapes": 632, "layouts": 633, "vary": 634, "based": 635, "less": 636, "way": 637, "unique_prepack_types": 638, "prepack_types_seen": 639, "key": 640, "machete_prepack": 641, "prepack_dispatch_template": 642, "up": 643, "impls": 644, "across": 645, "files": 646, "num_impls": 647, "lambda": 648, "len": 649, "num_impls_per_file": 650, "ceil": 651, "files_impls": 652, "curr_num_impls_assigned": 653, "curr_impl_in_file": 654, "curr_impl_configs": 655, "deepcopy": 656, "reversed": 657, "while": 658, "room_left_in_file": 659, "curr_ic": 660, "break": 661, "apart": 662, "current": 663, "impl": 664, "config": 665, "tmp_ic": 666, "pop": 667, "part": 668, "file_impls": 669, "enumerate": 670, "machete_mm_impl_part": 671, "mm_impl_template": 672, "csrc": 673, "machete": 674, "readme": 675, "md": 676, "codegeneration": 677, "info": 678, "how": 679, "works": 680, "script_dir": 681, "sch_common_params": 682, "dict": 683, "tmami": 684, "tmacoop": 685, "tileschedulertype": 686, "condition": 687, "default_tile_heuristic_config": 688, "257": 689, "16384": 690, "4096": 691, "129": 692, "8192": 693, "65": 694, "4069": 695, "12288": 696, "33": 697, "6144": 698, "17": 699, "26624": 700, "none": 701, "heuristic": 702, "tuned": 703, "h100s": 704, "default_heuristic": 705, "cond": 706, "tile_config": 707, "ignore": 708, "get_unique_schedules": 709, "sure": 710, "deterministic": 711, "file": 712, "non": 713, "causes": 714, "ccache": 715, "miss": 716, "gptq_kernel_type_configs": 717, "f32": 718, "u4b8": 719, "u8b128": 720, "f16": 721, "zip": 722, "repeat": 723, "awq_kernel_type_configs": 724, "todo": 725, "lucaswilkinson": 726, "tuning": 727, "qqq_tile_heuristic_config": 728, "broken": 729, "qqq": 730, "investigate": 731, "qqq_heuristic": 732, "qqq_kernel_types": 733, "s8": 734, "s32": 735, "e4m3": 736, "output_dir": 737, "delete": 738, "directory": 739, "exists": 740, "shutil": 741, "rmtree": 742, "create": 743, "makedirs": 744, "group": 745, "configurations": 746, "separate": 747, "filepath": 748, "output_file": 749, "write": 750, "collections": 751, "abc": 752, "copy": 753, "dataclasses": 754, "dataclass": 755, "functools": 756, "typing": 757, "optional": 758, "yapf": 759, "conflicts": 760, "isort": 761, "block": 762, "disable": 763, "vllm_cutlass_library_extension": 764, "vllmdatatypetag": 765, "vllmdatatypetorchdatatypetag": 766, "vllmdatatypevllmscalartypetag": 767, "enable": 768, "generator": 769, "templating": 770, "dispatch_template": 771, "machete_mm_launcher": 772, "cuh": 773, "type_sig": 774, "gen_type_sig": 775, "extern": 776, "torch": 777, "impl_": 778, "_sch_": 779, "gen_sch_sig": 780, "mmargs": 781, "endfor": 782, "mm_dispatch_": 783, "args": 784, "maybe_unused": 785, "maybe_schedule": 786, "endif": 787, "torch_check_not_implemented": 788, "machete_gemm": 789, "schedule": 790, "static": 791, "inline": 792, "std": 793, "scalartype": 794, "maybe_scalartype": 795, "const": 796, "nullopt": 797, "mm_dispatch": 798, "out_type": 799, "maybe_out_type": 800, "value_or": 801, "a_type": 802, "maybe_g_scales_type": 803, "maybe_group_scales": 804, "maybe_g_zeros_type": 805, "maybe_group_zeros": 806, "maybe_ch_scales_type": 807, "maybe_channel_scales": 808, "maybe_tok_scales_type": 809, "maybe_token_scales": 810, "b_type": 811, "vllmscalartypetag": 812, "torchtypetag": 813, "machete_mm": 814, "with_group_scale_type": 815, "tostring": 816, "with_group_zeropoint_type": 817, "with_channel_scale_type": 818, "with_token_scale_type": 819, "gen_type_option_name": 820, "string": 821, "supported_schedules_dispatch": 822, "supportedschedulesargs": 823, "schs": 824, "maybe_group_scales_type": 825, "maybe_group_zeros_type": 826, "loop": 827, "last": 828, "impl_template": 829, "struct": 830, "sch_": 831, "tileshapenm": 832, "shape": 833, "clustershape": 834, "reimplement": 835, "kernelschedule": 836, "kernelscheduletag": 837, "epilogueschedule": 838, "tilescheduler": 839, "epiloguetiletype": 840, "collective": 841, "epiloguetileauto": 842, "typename": 843, "machetekerneltemplate": 844, "datatypetag": 845, "elementa": 846, "elementb": 847, "elementd": 848, "groupscalet": 849, "groupzerot": 850, "channelscalet": 851, "tokenscalet": 852, "run_impl": 853, "prepack_template": 854, "machete_prepack_launcher": 855, "prepack_b_dispatch": 856, "prepackbargs": 857, "size_bits": 858, "prepack_impl": 859, "prepackedlayoutbtemplate": 860, "elementconvert": 861, "layout": 862, "columnmajor": 863, "atype": 864, "with_group_scales_type": 865, "tmawarpspecializedcooperative": 866, "frozen": 867, "mostly": 868, "unique": 869, "shorter": 870, "type_name": 871, "mixed": 872, "precision": 873, "spiritual": 874, "successor": 875, "optimized": 876, "hopper": 877, "architectures": 878, "new": 879, "pairs": 880, "easier": 881, "compared": 882, "overview": 883, "effectively": 884, "python": 885, "scale_type": 886, "w_s": 887, "compute_type": 888, "w_q": 889, "w_z": 890, "weight": 891, "zeropoints": 892, "_note": 893, "added": 894, "after": 895, "fma": 896, "pre": 897, "applied": 898, "supplied": 899, "assume": 900, "subtracted": 901, "before": 902, "api": 903, "main": 904, "optimization": 905, "prepacking": 906, "closely": 907, "match": 908, "allowing": 909, "wider": 910, "shared": 911, "memory": 912, "loads": 913, "loading": 914, "prepacked": 915, "calling": 916, "flow": 917, "looks": 918, "something": 919, "_custom_ops": 920, "ops": 921, "w_q_packed": 922, "machete_prepack_b": 923, "wtype": 924, "b_q": 925, "b_scales": 926, "b_group_size": 927, "generation": 928, "multiple": 929, "different": 930, "tile": 931, "instantiations": 932, "appended": 933, "get": 934, "automatically": 935, "assuming": 936, "you": 937, "provide": 938, "bundles": 939, "specialization": 940, "default": 941, "contain": 942, "scheduler": 943, "etc": 944, "perform": 945, "differently": 946, "problem": 947, "almost": 948, "never": 949, "one": 950, "beneficial": 951, "potential": 952, "comes": 953, "should": 954, "provided": 955, "maps": 956, "used": 957, "user": 958, "does": 959, "parameter": 960, "define": 961, "feature": 962, "combinations": 963, "with_zeropoints": 964, "with_scales": 965, "compile": 966, "times": 967, "limiting": 968, "enum": 969, "enum_auto": 970, "tmawarpspecialized": 971, "tmawarpspecializedpingpong": 972, "cutlass_library": 973, "extend": 974, "library": 975, "custom": 976, "missing": 977, "values": 978, "datatypenames": 979, "vllm_uint4b8_t": 980, "vllm_uint8b128_t": 981, "datatypesize": 982, "s4": 983, "ks4": 984, "ks8": 985, "byte": 986, "char": 987, "float8_e4m3fn": 988, "bfloat16": 989, "float": 990, "kernelscheduletype": 991, "kerneltmawarpspecialized": 992, "kerneltmawarpspecializedpingpong": 993, "is_allowed_file": 994, "current_file": 995, "bool": 996, "is_forbidden_import": 997, "line": 998, "stripped": 999, "parse_diff": 1000, "diff": 1001, "violations": 1002, "current_lineno": 1003, "skip_allowed_file": 1004, "splitlines": 1005, "startswith": 1006, "re": 1007, "search": 1008, "next": 1009, "code_line": 1010, "get_diff": 1011, "diff_type": 1012, "staged": 1013, "check_output": 1014, "git": 1015, "cached": 1016, "unified": 1017, "text": 1018, "unstaged": 1019, "all_violations": 1020, "try": 1021, "diff_output": 1022, "except": 1023, "calledprocesserror": 1024, "print": 1025, "failed": 1026, "sys": 1027, "stderr": 1028, "forbidden": 1029, "direct": 1030, "triton": 1031, "detected": 1032, "triton_utils": 1033, "regex": 1034, "forbidden_import_re": 1035, "allowed_lines": 1036, "tl": 1037, "allowed_files": 1038, "importing": 1039, "exit": 1040, "get_staged_python_files": 1041, "result": 1042, "run": 1043, "filter": 1044, "am": 1045, "capture_output": 1046, "stdout": 1047, "endswith": 1048, "forbidden_patterns": 1049, "check_file": 1050, "encoding": 1051, "utf": 1052, "line_num": 1053, "oserror": 1054, "unicodedecodeerror": 1055, "total_violations": 1056, "setup": 1057, "found": 1058, "please": 1059, "noqa": 1060, "e501": 1061, "imports": 1062, "__future__": 1063, "annotations": 1064, "pathlib": 1065, "allowed_patterns": 1066, "raise": 1067, "systemexit": 1068, "generates": 1069, "specialized": 1070, "requirements": 1071, "nightly": 1072, "pytorch": 1073, "testing": 1074, "script": 1075, "reads": 1076, "test": 1077, "input": 1078, "splits": 1079, "its": 1080, "content": 1081, "two": 1082, "nightly_torch_test": 1083, "txt": 1084, "contains": 1085, "dependencies": 1086, "related": 1087, "torch_nightly_test": 1088, "packages": 1089, "input_file": 1090, "white": 1091, "compatible": 1092, "directly": 1093, "pip": 1094, "install": 1095, "your": 1096, "package": 1097, "dependency": 1098, "fails": 1099, "white_list": 1100, "torchaudio": 1101, "torchvision": 1102, "mamba_ssm": 1103, "lines": 1104, "readlines": 1105, "skip_next": 1106, "get_python_executable": 1107, "executable": 1108, "get_cpu_cores": 1109, "number": 1110, "cpu": 1111, "cores": 1112, "generate_presets": 1113, "output_path": 1114, "cmakeuserpresets": 1115, "json": 1116, "attempting": 1117, "detect": 1118, "system": 1119, "configuration": 1120, "nvcc": 1121, "nvcc_path": 1122, "cuda_home": 1123, "prospective_path": 1124, "bin": 1125, "utils": 1126, "cpp_extension": 1127, "nvcc_path_input": 1128, "find": 1129, "full": 1130, "usr": 1131, "local": 1132, "cuda": 1133, "python_executable": 1134, "python_executable_prompt": 1135, "development": 1136, "typically": 1137, "virtual": 1138, "home": 1139, "venvs": 1140, "valueerror": 1141, "determine": 1142, "manually": 1143, "cpu_cores": 1144, "nvcc_threads": 1145, "min": 1146, "cmake_jobs": 1147, "cmake": 1148, "jobs": 1149, "root": 1150, "tools": 1151, "project_root": 1152, "abspath": 1153, "ensure": 1154, "absolute": 1155, "resolvable": 1156, "isabs": 1157, "might": 1158, "cache_variables": 1159, "cmake_cuda_compiler": 1160, "cmake_build_type": 1161, "release": 1162, "vllm_python_executable": 1163, "cmake_install_prefix": 1164, "sourcedir": 1165, "cmake_cuda_flags": 1166, "compiler": 1167, "cache": 1168, "sccache": 1169, "caching": 1170, "launcher": 1171, "cxx": 1172, "hip": 1173, "cmake_": 1174, "_compiler_launcher": 1175, "configure_preset": 1176, "binarydir": 1177, "build": 1178, "cachevariables": 1179, "ninja": 1180, "cmake_job_pools": 1181, "slower": 1182, "presets": 1183, "keep": 1184, "sync": 1185, "cmakelists": 1186, "cmakeminimumrequired": 1187, "major": 1188, "26": 1189, "patch": 1190, "configurepresets": 1191, "buildpresets": 1192, "configurepreset": 1193, "output_file_path": 1194, "overwrite": 1195, "already": 1196, "cancelled": 1197, "dump": 1198, "indent": 1199, "successfully": 1200, "nto": 1201, "preset": 1202, "cd": 1203, "initialize": 1204, "target": 1205, "multiprocessing": 1206, "installation": 1207, "most": 1208, "reliable": 1209, "source": 1210, "truth": 1211, "importerror": 1212, "falling": 1213, "back": 1214, "variable": 1215, "environ": 1216, "is_python_file": 1217, "scan_file": 1218, "pickle_re": 1219, "load_gitignore": 1220, "repo_root": 1221, "gitignore_path": 1222, "gitignore": 1223, "patterns": 1224, "read": 1225, "spec": 1226, "bad_files": 1227, "dirpath": 1228, "filenames": 1229, "walk": 1230, "abs_path": 1231, "rel_path": 1232, "relpath": 1233, "ignored": 1234, "match_file": 1235, "nerror": 1236, "pickle": 1237, "cloudpickle": 1238, "nif": 1239, "intentional": 1240, "check_pickle_imports": 1241, "test_regex": 1242, "test_cases": 1243, "pkl": 1244, "cpkl": 1245, "dumps": 1246, "timport": 1247, "somethingelse": 1248, "pickleas": 1249, "asdf": 1250, "should_match": 1251, "assert": 1252, "expected": 1253, "got": 1254, "env": 1255, "python3": 1256, "pathspec": 1257, "error": 1258, "relative": 1259, "repo": 1260, "stop": 1261, "anything": 1262, "modules": 1263, "unsafe": 1264, "deserializing": 1265, "data": 1266, "potentially": 1267, "untrusted": 1268, "parties": 1269, "resulted": 1270, "cves": 1271, "numerous": 1272, "vulnerabilities": 1273, "ecosystem": 1274, "broadly": 1275, "adding": 1276, "uses": 1277, "consider": 1278, "safer": 1279, "alternatives": 1280, "msgpack": 1281, "pydantic": 1282, "absolutely": 1283, "necessary": 1284, "careful": 1285, "review": 1286, "v1": 1287, "serial_utils": 1288, "executor": 1289, "multiproc_executor": 1290, "multimodal": 1291, "hasher": 1292, "transformers_utils": 1293, "model_executor": 1294, "models": 1295, "registry": 1296, "tests": 1297, "utils_": 1298, "test_utils": 1299, "tokenization": 1300, "test_cached_tokenizer": 1301, "distributed": 1302, "parallel_state": 1303, "engine": 1304, "client": 1305, "device_communicators": 1306, "custom_all_reduce_utils": 1307, "shm_broadcast": 1308, "benchmarks": 1309, "graph_machete_bench": 1310, "benchmark_lora": 1311, "benchmark_machete": 1312, "fused_kernels": 1313, "layernorm_rms_benchmarks": 1314, "cutlass_benchmarks": 1315, "w8a8_benchmarks": 1316, "sparse_benchmarks": 1317, "worker": 1318, "worker_base": 1319, "mp_distributed_executor": 1320, "ray_distributed_executor": 1321, "entrypoints": 1322, "llm": 1323, "__init__": 1324, "sas": 1325, "argv": 1326, "expert": 1327, "parallel": 1328, "cluster": 1329, "described": 1330, "deepseek": 1331, "v3": 1332, "technical": 1333, "report": 1334, "http": 1335, "arxiv": 1336, "abs": 1337, "2412": 1338, "19437": 1339, "efficient": 1340, "deploy": 1341, "sparse": 1342, "moe": 1343, "many": 1344, "experts": 1345, "however": 1346, "deployment": 1347, "requires": 1348, "components": 1349, "beyond": 1350, "normal": 1351, "driver": 1352, "impossible": 1353, "bundle": 1354, "down": 1355, "steps": 1356, "libraries": 1357, "pplx": 1358, "ppl": 1359, "deepep": 1360, "nvshmem": 1361, "step": 1362, "require": 1363, "privileged": 1364, "access": 1365, "configure": 1366, "nvidia": 1367, "ibgda": 1368, "done": 1369, "host": 1370, "machine": 1371, "multi": 1372, "node": 1373, "scripts": 1374, "accept": 1375, "positional": 1376, "argument": 1377, "workspace": 1378, "staging": 1379, "defaulting": 1380, "pwd": 1381, "ep_kernels_workspace": 1382, "usage": 1383, "bash": 1384, "torch_cuda_arch_list": 1385, "install_python_libraries": 1386, "sh": 1387, "blackwell": 1388, "10": 1389, "sudo": 1390, "configure_system_drivers": 1391, "reboot": 1392, "load": 1393, "visitor": 1394, "ast": 1395, "nodevisitor": 1396, "self": 1397, "super": 1398, "_in_type_checking": 1399, "visit_if": 1400, "guard_is_type_checking": 1401, "attribute": 1402, "attr": 1403, "type_checking": 1404, "prev": 1405, "child": 1406, "visit": 1407, "orelse": 1408, "generic_visit": 1409, "visit_import": 1410, "alias": 1411, "names": 1412, "module_name": 1413, "_is_internal": 1414, "allowed_imports": 1415, "lineno": 1416, "inside": 1417, "visit_importfrom": 1418, "importfrom": 1419, "module_as_written": 1420, "module": 1421, "allowed_from_modules": 1422, "_fail": 1423, "disallowed": 1424, "eager": 1425, "msg": 1426, "init_path": 1427, "read_text": 1428, "tree": 1429, "parse": 1430, "lazy": 1431, "appears": 1432, "guard": 1433, "short": 1434, "whitelist": 1435, "resolve": 1436, "parent": 1437, "frozenset": 1438, "env_override": 1439, "configvalidator": 1440, "visit_classdef": 1441, "validate": 1442, "decorators": 1443, "decorator_list": 1444, "call": 1445, "func": 1446, "validate_class": 1447, "fail": 1448, "decorator": 1449, "get_attr_docs": 1450, "cls_node": 1451, "classdef": 1452, "docstrings": 1453, "placed": 1454, "assignments": 1455, "davidism": 1456, "mit": 1457, "pairwise": 1458, "implement": 1459, "docs": 1460, "removed": 1461, "dropped": 1462, "iterator": 1463, "iter": 1464, "yield": 1465, "pair": 1466, "nodes": 1467, "assignment": 1468, "constant": 1469, "assign": 1470, "annassign": 1471, "expr": 1472, "doc": 1473, "inspect": 1474, "cleandoc": 1475, "targets": 1476, "annotated": 1477, "assigning": 1478, "plain": 1479, "class_node": 1480, "attr_docs": 1481, "stmt": 1482, "defined": 1483, "annotation": 1484, "classvar": 1485, "variables": 1486, "subscript": 1487, "field_name": 1488, "docstring": 1489, "slice": 1490, "elts": 1491, "literal_args": 1492, "arg": 1493, "literal": 1494, "literal1": 1495, "literal2": 1496, "validate_ast": 1497, "validate_file": 1498, "file_path": 1499, "validating": 1500, "end": 1501, "message": 1502, "ensures": 1503, "gputrc2graph": 1504, "processes": 1505, "nsight": 1506, "systems": 1507, "nsys": 1508, "gpu": 1509, "trace": 1510, "rep": 1511, "tracing": 1512, "enabled": 1513, "summaries": 1514, "visualizations": 1515, "useful": 1516, "profiling": 1517, "analyzing": 1518, "profile": 1519, "command": 1520, "arguments": 1521, "in_file": 1522, "metadata": 1523, "entry": 1524, "model": 1525, "elapsed_nonprofiled_sec": 1526, "llama": 1527, "gpt": 1528, "oss": 1529, "ds": 1530, "wall": 1531, "clock": 1532, "seconds": 1533, "specify": 1534, "elapsed": 1535, "inflate": 1536, "actual": 1537, "entries": 1538, "separated": 1539, "out_dir": 1540, "csv": 1541, "results": 1542, "saved": 1543, "title": 1544, "chart": 1545, "visualization": 1546, "nsys_cmd": 1547, "assumes": 1548, "notes": 1549, "pandas": 1550, "installed": 1551, "engines": 1552, "help": 1553, "example": 1554, "analyze": 1555, "cycles": 1556, "say": 1557, "collect": 1558, "serve": 1559, "run1": 1560, "fork": 1561, "exec": 1562, "graph": 1563, "delay": 1564, "duration": 1565, "openai": 1566, "120b": 1567, "collecting": 1568, "profiles": 1569, "needed": 1570, "aren": 1571, "captured": 1572, "till": 1573, "server": 1574, "come": 1575, "starts": 1576, "generating": 1577, "again": 1578, "total": 1579, "analysis": 1580, "306": 1581, "produce": 1582, "categorizes": 1583, "categories": 1584, "stacked": 1585, "bar": 1586, "shows": 1587, "mapped": 1588, "due": 1589, "substages": 1590, "consist": 1591, "moe_gemm": 1592, "mixture": 1593, "biggest": 1594, "category": 1595, "148": 1596, "followed": 1597, "attn": 1598, "lets": 1599, "prioritize": 1600, "focus": 1601, "optimizations": 1602, "images": 1603, "png": 1604, "table": 1605, "underneath": 1606, "copying": 1607, "post": 1608, "processing": 1609, "html_tbl": 1610, "mapping": 1611, "suppose": 1612, "improving": 1613, "consumer": 1614, "74": 1615, "sec": 1616, "perhaps": 1617, "hasn": 1618, "been": 1619, "dive": 1620, "compose": 1621, "image": 1622, "triton_poi_fused__to_copy_add_addmm_cat_": 1623, "csv1": 1624, "wish": 1625, "compare": 1626, "100": 1627, "run2": 1628, "102": 1629, "comparison": 1630, "process": 1631, "similar": 1632, "stack": 1633, "charts": 1634, "remain": 1635, "easy": 1636, "once": 1637, "shown": 1638, "than": 1639, "another": 1640, "taking": 1641, "largest": 1642, "amount": 1643, "cause": 1644, "difference": 1645, "classification": 1646, "classified": 1647, "them": 1648, "engine_model": 1649, "layer_anno": 1650, "stage": 1651, "layer": 1652, "substage": 1653, "mem": 1654, "h_d_memops": 1655, "misc": 1656, "basically": 1657, "dictionary": 1658, "keys": 1659, "bins": 1660, "wishes": 1661, "consisting": 1662, "leftover": 1663, "invoking": 1664, "infile": 1665, "enginemodeldata": 1666, "mappings": 1667, "fused_moe_kernel": 1668, "groupproblemshape": 1669, "group_gemm_starts": 1670, "llama4": 1671, "sigmoid": 1672, "catarraybatched": 1673, "prepare_inputs": 1674, "prepare_next": 1675, "flash": 1676, "nccldevkernel": 1677, "cross_device_reduce": 1678, "nccl_and_custom_ar": 1679, "_norm_": 1680, "norm": 1681, "act_and_mul_": 1682, "silu": 1683, "rotary_embedding_kernel": 1684, "rope": 1685, "softmax": 1686, "elementwise": 1687, "fp8_quant": 1688, "quantize": 1689, "reduce_kernel": 1690, "triton_kernel": 1691, "block_fp8": 1692, "gemm_fp8_blockwise": 1693, "block_fp8_gemm": 1694, "_group_gemm": 1695, "gemmuniversal": 1696, "matmul": 1697, "nvjet": 1698, "_fwd_": 1699, "flashattn": 1700, "_mla_": 1701, "_attn_": 1702, "sbtopk": 1703, "topk": 1704, "compute_position_kernel": 1705, "quant_fp8": 1706, "cvt_fp16_to_fp4": 1707, "bmm_": 1708, "section": 1709, "triton_moe_gemm": 1710, "matmul_ogs_": 1711, "_topk_forward": 1712, "_combined_routing": 1713, "_sum_bitmatrix_rows": 1714, "_compute_writeback_idx": 1715, "splitkreduce": 1716, "_flash_": 1717, "prepare_varlen": 1718, "fmha": 1719, "gputrace2graph": 1720, "parses": 1721, "pd": 1722, "avoid": 1723, "options": 1724, "mode": 1725, "copy_on_write": 1726, "helper": 1727, "functions": 1728, "summary": 1729, "csvs": 1730, "gen_nonoverlapped_sum_from_gputrace": 1731, "out_file": 1732, "logger": 1733, "df": 1734, "read_csv": 1735, "usecols": 1736, "start": 1737, "ns": 1738, "device": 1739, "strm": 1740, "sum_non_overlapping_intervals": 1741, "ready": 1742, "df_sum": 1743, "groupby": 1744, "as_index": 1745, "agg": 1746, "sum": 1747, "1e9": 1748, "sort_values": 1749, "ascending": 1750, "to_csv": 1751, "index": 1752, "returns": 1753, "sorted": 1754, "vectorized": 1755, "sorting": 1756, "records": 1757, "reset": 1758, "reset_index": 1759, "drop": 1760, "numpy": 1761, "arrays": 1762, "faster": 1763, "ends": 1764, "track": 1765, "interval": 1766, "current_end": 1767, "display_units": 1768, "overlapping": 1769, "intervals": 1770, "range": 1771, "partial": 1772, "overlap": 1773, "iloc": 1774, "columns": 1775, "get_loc": 1776, "complete": 1777, "make_html": 1778, "plotly": 1779, "express": 1780, "px": 1781, "empty": 1782, "output_name": 1783, "model_engine": 1784, "underscore": 1785, "categorical": 1786, "histogram": 1787, "round": 1788, "text_auto": 1789, "wrap": 1790, "axis": 1791, "labels": 1792, "update_xaxes": 1793, "automargin": 1794, "write_html": 1795, "pivot_df": 1796, "pivot_table": 1797, "aggfunc": 1798, "observed": 1799, "bottom": 1800, "loc": 1801, "total_elapsed_sec": 1802, "fillna": 1803, "to_html": 1804, "temp": 1805, "outfile": 1806, "finished": 1807, "anno_gpu_kernname": 1808, "anno_gpu_kernname_helper": 1809, "kern_name": 1810, "val": 1811, "apply": 1812, "make_nongpu_row": 1813, "nongpu_sec": 1814, "nongpu_row": 1815, "dataframe": 1816, "is_valid_file": 1817, "base_file": 1818, "asserts": 1819, "existent": 1820, "isfile": 1821, "getsize": 1822, "doesn": 1823, "exist": 1824, "should_gen_file": 1825, "new_file": 1826, "figure": 1827, "getmtime": 1828, "reusing": 1829, "gen_sum_file": 1830, "file_dir": 1831, "file_name": 1832, "basename": 1833, "overlapped": 1834, "nsys_stats_file": 1835, "_cuda_gpu_trace": 1836, "sum_file": 1837, "_cuda_gpu_kernel_tracesum": 1838, "cmd": 1839, "stats": 1840, "cuda_gpu_trace": 1841, "cmd_str": 1842, "exception": 1843, "correct": 1844, "overalapped": 1845, "gen_graph": 1846, "store": 1847, "combined": 1848, "combined_df": 1849, "idx": 1850, "total_sec": 1851, "annotate": 1852, "label": 1853, "gpu_sec": 1854, "2f": 1855, "resetting": 1856, "concat": 1857, "ignore_index": 1858, "exist_ok": 1859, "parse_tuple": 1860, "logging": 1861, "basicconfig": 1862, "asctime": 1863, "levelname": 1864, "parser": 1865, "argparse": 1866, "argumentparser": 1867, "description": 1868, "d1": 1869, "d2": 1870, "formatter_class": 1871, "rawdescriptionhelpformatter": 1872, "showing": 1873, "engine_model_help": 1874, "model_list": 1875, "engine_model_str": 1876, "add_argument": 1877, "nargs": 1878, "space": 1879, "dir": 1880, "parse_args": 1881, "gputrace": 1882, "cuda_gpu_kern_trace": 1883, "getlogger": 1884, "annotating": 1885, "flatten_entries": 1886, "entry_cls": 1887, "profile_dict": 1888, "entries_and_depth": 1889, "get_entries": 1890, "curr_depth": 1891, "children": 1892, "profiler": 1893, "layerwise_profile": 1894, "modelstatsentry": 1895, "summarystatsentry": 1896, "tableprinter": 1897, "indent_string": 1898, "offline_inference": 1899, "phase": 1900, "either": 1901, "prefill": 1902, "decode_n": 1903, "decode": 1904, "choices": 1905, "layerwise": 1906, "json_trace": 1907, "profile_data": 1908, "choose": 1909, "among": 1910, "entries_and_depths": 1911, "summary_stats": 1912, "column_widths": 1913, "80": 1914, "cuda_time_us": 1915, "12": 1916, "pct_cuda_time": 1917, "invocations": 1918, "15": 1919, "model_stats": 1920, "60": 1921, "cpu_time_us": 1922, "depth": 1923, "indent_style": 1924, "print_table": 1925, "largest_dist_from_leaf": 1926, "get_entries_at_depth": 1927, "entries_and_traces": 1928, "query": 1929, "tall": 1930, "enough": 1931, "fold_nodes": 1932, "nodes_to_fold": 1933, "trim_string_back": 1934, "width": 1935, "offset": 1936, "shorten_plot_legend_strings": 1937, "legend": 1938, "max_char_len": 1939, "get_texts": 1940, "set_text": 1941, "abbreviate_known_names": 1942, "get_text": 1943, "abbreviations": 1944, "mergedcolumnparallellinear": 1945, "mcplinear": 1946, "qkvparallellinear": 1947, "qkvplinear": 1948, "rowparallellinear": 1949, "rplinear": 1950, "float16": 1951, "attempt_to_make_names_unique": 1952, "non_unique_names": 1953, "all_the_same": 1954, "entries_and_traces_with_name": 1955, "zipped_traces": 1956, "first_trace_difference": 1957, "trace_eles": 1958, "leave": 1959, "aggregated": 1960, "group_trace_by_operations": 1961, "trace_df": 1962, "is_rms_norm": 1963, "op_name": 1964, "rms_norm_kernel": 1965, "is_attention_block": 1966, "flash_fwd": 1967, "reshape_and_cache_flash_kernel": 1968, "is_quant": 1969, "scaled_fp8_quant": 1970, "scaled_int8_quant": 1971, "lora": 1972, "is_sgmv_shrink": 1973, "sgmv_shrink": 1974, "is_sgmv_expand": 1975, "sgmv_expand": 1976, "is_bgmv_shrink": 1977, "bgmv_shrink": 1978, "is_bgmv_expand": 1979, "bgmv_expand": 1980, "is_cutlass_gemm_op": 1981, "device_kernel": 1982, "is_gemm_op": 1983, "xmma_gemm": 1984, "gemv2t_kernel": 1985, "s16816gemm": 1986, "is_elementwise_op": 1987, "elementwise_kernel": 1988, "is_mem_op": 1989, "memcpy": 1990, "memset": 1991, "is_vocab_embedding_op": 1992, "vocabparallelembed": 1993, "nccl": 1994, "is_nccl_op": 1995, "is_nccl_all_reduce": 1996, "all_reduce": 1997, "allreduce": 1998, "is_nccl_gather": 1999, "gather": 2000, "is_nccl_broadcast": 2001, "broadcast": 2002, "is_cross_device_reduce_1stage": 2003, "cross_device_reduce_1stage": 2004, "is_cross_device_reduce_2stage": 2005, "cross_device_reduce_2stage": 2006, "is_custom_ar_all_reduce": 2007, "_c_custom_ar": 2008, "is_reduce_kernel": 2009, "headers": 2010, "attention_ops": 2011, "quant_ops": 2012, "sgmv_shrink_ops": 2013, "sgmv_expand_ops": 2014, "bgmv_shrink_ops": 2015, "bgmv_expand_ops": 2016, "cutlass_gemm_ops": 2017, "gemm_ops": 2018, "rms_norm_ops": 2019, "vocab_embed_ops": 2020, "mem_ops": 2021, "elementwise_ops": 2022, "nccl_all_reduce_ops": 2023, "nccl_gather_ops": 2024, "nccl_broadcast_ops": 2025, "nccl_other_ops": 2026, "cross_device_reduce_1stage_ops": 2027, "cross_device_reduce_2stage_ops": 2028, "custom_ar_all_reduce_ops": 2029, "reduce_kernel_ops": 2030, "inplace": 2031, "plot_trace_df": 2032, "traces_df": 2033, "plot_metric": 2034, "plot_title": 2035, "get_phase_description": 2036, "phase_df": 2037, "descs": 2038, "phase_desc": 2039, "to_list": 2040, "desc": 2041, "phases": 2042, "phase_descs": 2043, "fig_size_x": 2044, "fig": 2045, "ax": 2046, "plt": 2047, "subplots": 2048, "figsize": 2049, "sharex": 2050, "draw": 2051, "bars": 2052, "op": 2053, "map": 2054, "isnan": 2055, "patches": 2056, "get_height": 2057, "get_x": 2058, "get_width": 2059, "get_y": 2060, "ha": 2061, "center": 2062, "bold": 2063, "handles": 2064, "gca": 2065, "get_legend_handles_labels": 2066, "bbox_to_anchor": 2067, "50": 2068, "setp": 2069, "get_xticklabels": 2070, "rotation": 2071, "90": 2072, "set_ylabel": 2073, "suptitle": 2074, "savefig": 2075, "bbox_inches": 2076, "tight": 2077, "output_directory": 2078, "fetch": 2079, "plot": 2080, "make_names_unique": 2081, "top_k": 2082, "json_nodes_to_fold": 2083, "prepare_data": 2084, "profile_json": 2085, "step_keys": 2086, "get_entries_and_traces": 2087, "fold": 2088, "traces": 2089, "request": 2090, "simply": 2091, "leaf": 2092, "keep_only_top_entries": 2093, "metric": 2094, "nsmallest": 2095, "num_running_seqs": 2096, "seqs": 2097, "attempt": 2098, "some": 2099, "cleanup": 2100, "trace_dfs": 2101, "fill": 2102, "step_key": 2103, "combine": 2104, "frames": 2105, "put": 2106, "derived": 2107, "cuda_time_ms": 2108, "1000": 2109, "make_plot_title_suffix": 2110, "context": 2111, "sparsity": 2112, "run_type": 2113, "num_steps": 2114, "complete_num_requests_per_step": 2115, "completion": 2116, "engine_args": 2117, "batch_size": 2118, "promptlen": 2119, "prompt_len": 2120, "numgpus": 2121, "tensor_parallel_size": 2122, "step_traces": 2123, "decodes": 2124, "prefills": 2125, "all_decodes": 2126, "step_plot_interval": 2127, "prefill_traces": 2128, "decode_traces": 2129, "plot_title_suffix": 2130, "matplotlib": 2131, "pyplot": 2132, "parsing": 2133, "grouping": 2134, "given": 2135, "high": 2136, "rms_norm": 2137, "plotting": 2138, "plots": 2139, "top": 2140, "sampler": 2141, "logitsprocessor": 2142, "let": 2143, "represent": 2144, "aggregate": 2145, "prepare": 2146, "extract": 2147, "relevant": 2148, "unexpected": 2149, "fold_json_node": 2150, "represents": 2151, "ninja_log": 2152, "creates": 2153, "object": 2154, "passing": 2155, "owner": 2156, "weighted_duration": 2157, "task": 2158, "setweightedduration": 2159, "sets": 2160, "weightedduration": 2161, "weighted": 2162, "takes": 2163, "divides": 2164, "tasks": 2165, "running": 2166, "thus": 2167, "approximate": 2168, "serialized": 2169, "serializing": 2170, "ending": 2171, "much": 2172, "longer": 2173, "durations": 2174, "allow": 2175, "modest": 2176, "floating": 2177, "errors": 2178, "epsilon": 2179, "000002": 2180, "describetargets": 2181, "printable": 2182, "summarizes": 2183, "dozens": 2184, "outputs": 2185, "handle": 2186, "sanely": 2187, "max_length": 2188, "chosen": 2189, "fit": 2190, "long": 2191, "minimizing": 2192, "word": 2193, "wrapping": 2194, "readtargets": 2195, "log": 2196, "show_all": 2197, "log_file": 2198, "objects": 2199, "header": 2200, "readline": 2201, "v5": 2202, "unrecognized": 2203, "targets_dict": 2204, "last_end_seen": 2205, "parts": 2206, "exe": 2207, "rudely": 2208, "halted": 2209, "corrupt": 2210, "silently": 2211, "cmdhash": 2212, "restart": 2213, "integral": 2214, "milliseconds": 2215, "earlier": 2216, "stamp": 2217, "possibly": 2218, "incremental": 2219, "throw": 2220, "away": 2221, "previous": 2222, "displayed": 2223, "independently": 2224, "comparing": 2225, "commands": 2226, "guaranteed": 2227, "several": 2228, "builds": 2229, "go": 2230, "backwards": 2231, "cases": 2232, "repeated": 2233, "changed": 2234, "identified": 2235, "hash": 2236, "getextension": 2237, "extra_patterns": 2238, "extension": 2239, "important": 2240, "consistent": 2241, "canonical": 2242, "ultimately": 2243, "goal": 2244, "fn_pattern": 2245, "fnmatch": 2246, "good": 2247, "type_mappings": 2248, "capture": 2249, "extensions": 2250, "present": 2251, "javac": 2252, "jar": 2253, "distinguished": 2254, "interface": 2255, "ext1": 2256, "splitext": 2257, "ext2": 2258, "preserve": 2259, "pdb": 2260, "dll": 2261, "pefile": 2262, "linking": 2263, "grouped": 2264, "together": 2265, "lib": 2266, "listed": 2267, "toc": 2268, "identify": 2269, "identifying": 2270, "obj": 2271, "categorized": 2272, "mojo": 2273, "jars": 2274, "java": 2275, "normalize": 2276, "count": 2277, "mojom": 2278, "summarizeentries": 2279, "extra_step_types": 2280, "beginning": 2281, "starting": 2282, "stopping": 2283, "exactly": 2284, "iterate": 2285, "keeping": 2286, "own": 2287, "easily": 2288, "calculated": 2289, "task_start_stop_times": 2290, "earliest": 2291, "latest": 2292, "total_cpu_time": 2293, "length": 2294, "weighted_total": 2295, "happen": 2296, "stops": 2297, "alphabet": 2298, "making": 2299, "work": 2300, "correctly": 2301, "running_tasks": 2302, "record": 2303, "processed": 2304, "know": 2305, "deltas": 2306, "last_time": 2307, "accumulated": 2308, "last_weighted_time": 2309, "scan": 2310, "events": 2311, "action_name": 2312, "accumulate": 2313, "num_running": 2314, "moment": 2315, "change": 2316, "ran": 2317, "del": 2318, "warn": 2319, "second": 2320, "500": 2321, "possible": 2322, "untrustworthy": 2323, "3f": 2324, "entries_by_ext": 2325, "defaultdict": 2326, "longest": 2327, "long_count": 2328, "1f": 2329, "parallelism": 2330, "completed": 2331, "average": 2332, "dest": 2333, "build_directory": 2334, "semicolon": 2335, "specific": 2336, "_extra_args": 2337, "parse_known_args": 2338, "step_types": 2339, "room": 2340, "extra": 2341, "global": 2342, "long_ext_count": 2343, "created": 2344, "2018": 2345, "chromium": 2346, "authors": 2347, "rights": 2348, "reserved": 2349, "governed": 2350, "bsd": 2351, "style": 2352, "modified": 2353, "googlesource": 2354, "depot_tools": 2355, "refs": 2356, "heads": 2357, "post_build_ninja_summary": 2358, "summarize": 2359, "invoked": 2360, "syntax": 2361, "report_build_time_ninja": 2362, "typical": 2363, "cpp": 2364, "torch_bindings": 2365, "_attn_c": 2366, "23": 2367, "31": 2368, "38": 2369, "_moe_c": 2370, "abi3": 2371, "flash_attn_c": 2372, "_c": 2373, "machete_mm_": 2374, "183": 2375, "185": 2376, "186": 2377, "37": 2378, "scaled_mm_c3x": 2379, "449": 2380, "43": 2381, "scaled_mm_c2x": 2382, "527": 2383, "344": 2384, "attention_": 2385, "1087": 2386, "1110": 2387, "10120": 2388, "1x": 2389, "134": 2390, "errno": 2391, "copied": 2392, "modifications": 2393, "ninjatracing": 2394, "spdxstatus": 2395, "enumeration": 2396, "missing_license": 2397, "missing_copyright": 2398, "check_spdx_header_status": 2399, "shebang": 2400, "start_idx": 2401, "has_license": 2402, "has_copyright": 2403, "license_line": 2404, "copyright_line": 2405, "completely": 2406, "add_header": 2407, "supplement": 2408, "seek": 2409, "truncate": 2410, "missing_both": 2411, "full_spdx_header": 2412, "writelines": 2413, "insert": 2414, "function": 2415, "files_missing_both": 2416, "files_missing_copyright": 2417, "files_missing_license": 2418, "fixing": 2419, "all_files_to_fix": 2420, "cmake_minimum_required": 2421, "building": 2422, "places": 2423, "location": 2424, "mkdir": 2425, "dvllm_python_executable": 2426, "dcmake_install_prefix": 2427, "want": 2428, "component": 2429, "vllm_extensions": 2430, "languages": 2431, "overridden": 2432, "dvllm_target_device": 2433, "vllm_target_device": 2434, "backend": 2435, "cmake_current_list_dir": 2436, "suppress": 2437, "warnings": 2438, "unused": 2439, "ignoreme": 2440, "vllm_python_path": 2441, "prevent": 2442, "cmake_install_local_only": 2443, "all_components": 2444, "versions": 2445, "searched": 2446, "selected": 2447, "kept": 2448, "python_supported_versions": 2449, "11": 2450, "amd": 2451, "hip_supported_archs": 2452, "gfx906": 2453, "gfx908": 2454, "gfx90a": 2455, "gfx942": 2456, "gfx950": 2457, "gfx1030": 2458, "gfx1100": 2459, "gfx1101": 2460, "gfx1200": 2461, "gfx1201": 2462, "rocm": 2463, "having": 2464, "incorrect": 2465, "rather": 2466, "pyproject": 2467, "toml": 2468, "docker": 2469, "dockerfile": 2470, "torch_supported_version_cuda": 2471, "torch_supported_version_rocm": 2472, "matches": 2473, "find_python_from_executable": 2474, "fatal_error": 2475, "desired": 2476, "cmake_prefix_path": 2477, "append_cmake_prefix_path": 2478, "find_program": 2479, "nvcc_executable": 2480, "cuda_found": 2481, "partially": 2482, "customizations": 2483, "explicitly": 2484, "check_language": 2485, "enable_language": 2486, "find_package": 2487, "cmake_cuda_compiler_version": 2488, "gets": 2489, "version_greater_equal": 2490, "cuda_supported_archs": 2491, "forward": 2492, "strequal": 2493, "cpu_extension": 2494, "isn": 2495, "hip_found": 2496, "vllm_gpu_lang": 2497, "torch_version": 2498, "version_equal": 2499, "saw": 2500, "elseif": 2501, "recognizes": 2502, "recognize": 2503, "understand": 2504, "rocm_version_dev_major": 2505, "greater_equal": 2506, "able": 2507, "control": 2508, "basis": 2509, "cut": 2510, "globally": 2511, "clear_cuda_arches": 2512, "cuda_arch_flags": 2513, "extract_unique_cuda_archs_ascending": 2514, "cuda_archs": 2515, "archs": 2516, "cuda_archs_loose_intersection": 2517, "override": 2518, "arches": 2519, "vllm_gpu_arches": 2520, "override_gpu_arches": 2521, "_supported_archs": 2522, "compilation": 2523, "flags": 2524, "vllm_gpu_flags": 2525, "get_torch_gpu_compiler_flags": 2526, "fetchcontent": 2527, "compiled": 2528, "fetchcontent_base_dir": 2529, "play": 2530, "nicely": 2531, "produces": 2532, "artifacts": 2533, "binary_dir": 2534, "between": 2535, "cmake_binary_dir": 2536, "make_directory": 2537, "base": 2538, "overriding": 2539, "ggdb3": 2540, "verbose": 2541, "devug": 2542, "_flags_debug": 2543, "o0": 2544, "cmake_cxx_flags_debug": 2545, "certain": 2546, "marked": 2547, "nodiscard": 2548, "yet": 2549, "ignores": 2550, "lot": 2551, "mask": 2552, "real": 2553, "suppressing": 2554, "until": 2555, "properly": 2556, "addressed": 2557, "_flags": 2558, "wno": 2559, "cmake_cxx_flags": 2560, "cumem_allocator": 2561, "vllm_cumem_ext_src": 2562, "set_gencode_flags_for_srcs": 2563, "srcs": 2564, "enabling": 2565, "cumem": 2566, "allocator": 2567, "link": 2568, "against": 2569, "cumem_libs": 2570, "cuda_driver": 2571, "define_gpu_extension_target": 2572, "destination": 2573, "use_sabi": 2574, "with_soabi": 2575, "vllm_ext_src": 2576, "mamba": 2577, "selective_scan_fwd": 2578, "cache_kernels": 2579, "paged_attention_v1": 2580, "paged_attention_v2": 2581, "merge_attn_states": 2582, "vertical_slash_index": 2583, "pos_encoding_kernels": 2584, "activation_kernels": 2585, "layernorm_kernels": 2586, "layernorm_quant_kernels": 2587, "cuda_view": 2588, "q_gemm": 2589, "compressed_tensors": 2590, "int8_quant_kernels": 2591, "fused_layernorm_dynamic_per_token_quant": 2592, "gguf": 2593, "gguf_kernel": 2594, "cuda_utils_kernels": 2595, "custom_all_reduce": 2596, "cutlass_enable_headers_only": 2597, "cutlass_revision": 2598, "fixes": 2599, "bogus": 2600, "messages": 2601, "v4": 2602, "revision": 2603, "vllm_cutlass_src_dir": 2604, "is_absolute": 2605, "get_filename_component": 2606, "fetchcontent_declare": 2607, "source_dir": 2608, "git_repository": 2609, "git_tag": 2610, "git_progress": 2611, "speed": 2612, "download": 2613, "retrieving": 2614, "history": 2615, "git_shallow": 2616, "branch": 2617, "tags": 2618, "updated": 2619, "commit": 2620, "fetchcontent_makeavailable": 2621, "awq": 2622, "gemm_kernels": 2623, "permute_cols": 2624, "cutlass_w8a8": 2625, "scaled_mm_entry": 2626, "fp4": 2627, "nvfp4_quant_entry": 2628, "nvfp4_scaled_mm_entry": 2629, "nvfp4_blockwise_moe_kernel": 2630, "sparse_scaled_mm_entry": 2631, "cutlass_extensions": 2632, "mla": 2633, "cutlass_mla_entry": 2634, "per_token_group_quant": 2635, "least": 2636, "sizes": 2637, "atomicadd": 2638, "ptx": 2639, "marlin_archs": 2640, "preselected": 2641, "marlin_gen_script": 2642, "cmake_current_source_dir": 2643, "gptq_marlin": 2644, "generate_kernels": 2645, "md5": 2646, "marlin_gen_script_hash": 2647, "execute_process": 2648, "cmake_command": 2649, "pythonpath": 2650, "result_variable": 2651, "marlin_generation_result": 2652, "output_variable": 2653, "cmake_current_binary_dir": 2654, "marlin_generation": 2655, "error_file": 2656, "ncheck": 2657, "force": 2658, "skipping": 2659, "marlin_template_kernel_src": 2660, "set_source_files_properties": 2661, "properties": 2662, "compile_flags": 2663, "stub": 2664, "marlin_srcs": 2665, "dense": 2666, "marlin_cuda_kernel": 2667, "marlin_24_cuda_kernel": 2668, "marlin_qqq_gemm_kernel": 2669, "gptq_marlin_repack": 2670, "awq_marlin_repack": 2671, "allspark": 2672, "allspark_archs": 2673, "allspark_srcs": 2674, "gptq_allspark": 2675, "allspark_repack": 2676, "allspark_qgemm_w8a16": 2677, "scaled_mm_3x_archs": 2678, "cutlass_scaled_mm": 2679, "c3x": 2680, "later": 2681, "scaled_mm_archs": 2682, "0a": 2683, "scaled_mm_c3x_sm90": 2684, "scaled_mm_sm90_fp8": 2685, "scaled_mm_sm90_int8": 2686, "scaled_mm_azp_sm90_int8": 2687, "scaled_mm_blockwise_sm90_fp8": 2688, "denable_scaled_mm_sm90": 2689, "recommend": 