{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "def": 279, "remove_old_kernels": 280, "filename": 281, "glob": 282, "os": 283, "path": 284, "dirname": 285, "__file__": 286, "kernel_": 287, "cu": 288, "subprocess": 289, "call": 290, "rm": 291, "generate_new_kernels": 292, "scalar_type": 293, "dtype": 294, "itertools": 295, "product": 296, "scalar_types": 297, "dtypes": 298, "all_template_str_list": 299, "group_blocks": 300, "m_blocks": 301, "thread_configs": 302, "thread_m_blocks": 303, "order": 304, "case": 305, "only": 306, "support": 307, "gptq": 308, "int4": 309, "int8": 310, "ku4b8": 311, "ku8b128": 312, "continue": 313, "256": 314, "small": 315, "batch": 316, "need": 317, "128": 318, "large": 319, "64": 320, "channelwise": 321, "quantization": 322, "group_size": 323, "fp8": 324, "kfe4m3fn": 325, "nvfp4": 326, "supports": 327, "16": 328, "mxfp4": 329, "32": 330, "kfe2m1f": 331, "methods": 332, "don": 333, "k_blocks": 334, "n_blocks": 335, "threads": 336, "c_dtype": 337, "half": 338, "fp16": 339, "else": 340, "nv_bfloat16": 341, "is_zp_float_list": 342, "false": 343, "ku4": 344, "hqq": 345, "is_zp_float": 346, "true": 347, "4bit": 348, "append": 349, "s_type": 350, "elif": 351, "kfe8m0fnu": 352, "cannot": 353, "safely": 354, "dequantize": 355, "e8m0": 356, "so": 357, "skip": 358, "kfloat16": 359, "bf16": 360, "kbfloat16": 361, "template_str": 362, "jinja2": 363, "template": 364, "render": 365, "scalar_t": 366, "w_type_id": 367, "id": 368, "s_type_id": 369, "max": 370, "thread_n_blocks": 371, "thread_k_blocks": 372, "m_block_size_8": 373, "stages": 374, "pipe_stages": 375, "file_content": 376, "file_head": 377, "join": 378, "lower": 379, "write": 380, "spdx": 381, "license": 382, "identifier": 383, "apache": 384, "filecopyrighttext": 385, "copyright": 386, "projectimport": 387, "globimport": 388, "itertoolsimport": 389, "osimport": 390, "subprocessimport": 391, "jinja2file_head": 392, "auto": 393, "generated": 394, "generate": 395, "py": 396, "clang": 397, "format": 398, "off": 399, "kernel": 400, "marlin_template": 401, "namespace": 402, "marlin_namespace_name": 403, "strip": 404, "__global__": 405, "void": 406, "marlin": 407, "marlin_kernel_params": 408, "zero": 409, "point": 410, "ku8": 411, "supported": 412, "add": 413, "reduce": 414, "wheel": 415, "group_blocksgroup_blocks": 416, "__name__": 417, "__main__": 418, "cutlass": 419, "epilogues": 420, "introduction": 421, "document": 422, "describes": 423, "various": 424, "implemented": 425, "fusing": 426, "de": 427, "operations": 428, "onto": 429, "gemms": 430, "currently": 431, "symmetric": 432, "weights": 433, "asymmetric": 434, "activations": 435, "both": 436, "can": 437, "quantized": 438, "per": 439, "tensor": 440, "token": 441, "scaledepilogue": 442, "bias": 443, "scaledepiloguebias": 444, "scaledepilogueazp": 445, "scaledepilogueazppertoken": 446, "do": 447, "final": 448, "binary": 449, "instead": 450, "passed": 451, "epilogue": 452, "induces": 453, "redundant": 454, "addition": 455, "operation": 456, "runtime": 457, "check": 458, "performance": 459, "minor": 460, "underlying": 461, "linear": 462, "algebra": 463, "more": 464, "details": 465, "activation": 466, "rfc": 467, "project": 468, "3975": 469, "widehat": 470, "matrices": 471, "become": 472, "following": 473, "math": 474, "s_a": 475, "j_a": 476, "z_a": 477, "s_b": 478, "here": 479, "output": 480, "gemm": 481, "scales": 482, "respectively": 483, "matrix": 484, "ones": 485, "dimensions": 486, "additional": 487, "would": 488, "required": 489, "expanding": 490, "further": 491, "calculate": 492, "follows": 493, "left": 494, "note": 495, "raw": 496, "known": 497, "ahead": 498, "each": 499, "row": 500, "equal": 501, "mathbf": 502, "vector": 503, "column": 504, "sums": 505, "computes": 506, "meaning": 507, "parameters": 508, "scale_a": 509, "scale": 510, "scalar": 511, "scale_b": 512, "always": 513, "because": 514, "term": 515, "has": 516, "every": 517, "precomputed": 518, "stored": 519, "azp_with_adj": 520, "generally": 521, "points": 522, "kernels": 523, "efficiently": 524, "users": 525, "must": 526, "precompute": 527, "pass": 528, "same": 529, "above": 530, "means": 531, "becomes": 532, "outer": 533, "azp_adj": 534, "adjustment": 535, "azp": 536, "performs": 537, "computation": 538, "where": 539, "dq": 540, "out": 541, "class": 542, "scheduleconfig": 543, "tile_shape_mn": 544, "tuple": 545, "int": 546, "cluster_shape_mnk": 547, "kernel_schedule": 548, "mixedinputkernelscheduletype": 549, "epilogue_schedule": 550, "epiloguescheduletype": 551, "tile_scheduler": 552, "tileschedulertype": 553, "typeconfig": 554, "datatype": 555, "union": 556, "vllmdatatype": 557, "b_group_scale": 558, "b_group_zeropoint": 559, "b_channel_scale": 560, "a_token_scale": 561, "accumulator": 562, "prepacktypeconfig": 563, "b_num_bits": 564, "convert": 565, "implconfig": 566, "types": 567, "schedules": 568, "list": 569, "heuristic": 570, "optional": 571, "str": 572, "generate_sch_sig": 573, "schedule_config": 574, "tile_shape": 575, "cluster_shape": 576, "vllmkernelscheduletag": 577, "split": 578, "epiloguescheduletag": 579, "tileschedulertag": 580, "return": 581, "generate_terse_sch_sig": 582, "kernel_terse_names_replace": 583, "kerneltmawarpspecializedcooperative": 584, "tmami_": 585, "tmawarpspecializedcooperative_": 586, "tmacoop_": 587, "streamkscheduler": 588, "streamk": 589, "sch_sig": 590, "orig": 591, "terse": 592, "items": 593, "replace": 594, "generate_type_signature": 595, "kernel_types": 596, "vllmdatatypenames": 597, "getattr": 598, "field": 599, "name": 600, "fields": 601, "generate_type_option_name": 602, "b_": 603, "with_": 604, "_type": 605, "is_power_of_two": 606, "to_cute_constant": 607, "value": 608, "_to_cute_constant": 609, "isinstance": 610, "iterable": 611, "unique_schedules": 612, "impl_configs": 613, "set": 614, "sch": 615, "impl_config": 616, "unsigned_type_with_bitwidth": 617, "num_bits": 618, "u4": 619, "u8": 620, "u16": 621, "u32": 622, "u64": 623, "create_template": 624, "globals": 625, "update": 626, "template_globals": 627, "create_sources": 628, "num_impl_files": 629, "sources": 630, "machete_mm_dispatch": 631, "mm_dispatch_template": 632, "prepack_types": 633, "convert_type": 634, "vllmdatatypesize": 635, "prepacked_type_key": 636, "prepack_type": 637, "now": 638, "first": 639, "type": 640, "seen": 641, "since": 642, "core": 643, "shapes": 644, "layouts": 645, "vary": 646, "based": 647, "less": 648, "way": 649, "unique_prepack_types": 650, "prepack_types_seen": 651, "key": 652, "machete_prepack": 653, "prepack_dispatch_template": 654, "up": 655, "impls": 656, "across": 657, "files": 658, "num_impls": 659, "lambda": 660, "len": 661, "num_impls_per_file": 662, "ceil": 663, "files_impls": 664, "curr_num_impls_assigned": 665, "curr_impl_in_file": 666, "curr_impl_configs": 667, "deepcopy": 668, "reversed": 669, "while": 670, "room_left_in_file": 671, "curr_ic": 672, "break": 673, "apart": 674, "current": 675, "impl": 676, "config": 677, "tmp_ic": 678, "pop": 679, "part": 680, "file_impls": 681, "enumerate": 682, "machete_mm_impl_part": 683, "mm_impl_template": 684, "csrc": 685, "machete": 686, "readme": 687, "md": 688, "codegeneration": 689, "info": 690, "how": 691, "works": 692, "script_dir": 693, "sch_common_params": 694, "dict": 695, "tmami": 696, "tmacoop": 697, "condition": 698, "default_tile_heuristic_config": 699, "257": 700, "16384": 701, "4096": 702, "129": 703, "8192": 704, "65": 705, "4069": 706, "12288": 707, "33": 708, "6144": 709, "17": 710, "26624": 711, "none": 712, "tuned": 713, "h100s": 714, "default_heuristic": 715, "cond": 716, "tile_config": 717, "ignore": 718, "get_unique_schedules": 719, "sure": 720, "deterministic": 721, "file": 722, "non": 723, "causes": 724, "ccache": 725, "miss": 726, "gptq_kernel_type_configs": 727, "f32": 728, "u4b8": 729, "u8b128": 730, "f16": 731, "zip": 732, "repeat": 733, "awq_kernel_type_configs": 734, "todo": 735, "lucaswilkinson": 736, "tuning": 737, "qqq_tile_heuristic_config": 738, "broken": 739, "qqq": 740, "investigate": 741, "qqq_heuristic": 742, "qqq_kernel_types": 743, "s8": 744, "s32": 745, "e4m3": 746, "output_dir": 747, "delete": 748, "directory": 749, "exists": 750, "shutil": 751, "rmtree": 752, "create": 753, "makedirs": 754, "group": 755, "configurations": 756, "separate": 757, "filepath": 758, "output_file": 759, "print": 760, "rendered": 761, "mathimport": 762, "shutilfrom": 763, "collections": 764, "abc": 765, "import": 766, "iterablefrom": 767, "copy": 768, "deepcopyfrom": 769, "dataclasses": 770, "dataclass": 771, "fieldsfrom": 772, "functools": 773, "reducefrom": 774, "typing": 775, "unionimport": 776, "yapf": 777, "conflicts": 778, "isort": 779, "block": 780, "disablefrom": 781, "vllm_cutlass_library_extension": 782, "vllmdatatypetag": 783, "vllmdatatypetorchdatatypetag": 784, "vllmdatatypevllmscalartypetag": 785, "enable": 786, "generator": 787, "templating": 788, "dispatch_template": 789, "machete_mm_launcher": 790, "cuh": 791, "type_sig": 792, "gen_type_sig": 793, "extern": 794, "torch": 795, "impl_": 796, "_sch_": 797, "gen_sch_sig": 798, "mmargs": 799, "endfor": 800, "mm_dispatch_": 801, "args": 802, "maybe_unused": 803, "maybe_schedule": 804, "endif": 805, "torch_check_not_implemented": 806, "machete_gemm": 807, "schedule": 808, "static": 809, "inline": 810, "std": 811, "scalartype": 812, "maybe_scalartype": 813, "const": 814, "nullopt": 815, "mm_dispatch": 816, "out_type": 817, "maybe_out_type": 818, "value_or": 819, "a_type": 820, "maybe_g_scales_type": 821, "maybe_group_scales": 822, "maybe_g_zeros_type": 823, "maybe_group_zeros": 824, "maybe_ch_scales_type": 825, "maybe_channel_scales": 826, "maybe_tok_scales_type": 827, "maybe_token_scales": 828, "b_type": 829, "vllmscalartypetag": 830, "torchtypetag": 831, "machete_mm": 832, "with_group_scale_type": 833, "tostring": 834, "with_group_zeropoint_type": 835, "with_channel_scale_type": 836, "with_token_scale_type": 837, "gen_type_option_name": 838, "string": 839, "supported_schedules_dispatch": 840, "supportedschedulesargs": 841, "schs": 842, "maybe_group_scales_type": 843, "maybe_group_zeros_type": 844, "loop": 845, "last": 846, "impl_template": 847, "struct": 848, "sch_": 849, "tileshapenm": 850, "shape": 851, "clustershape": 852, "reimplement": 853, "kernelschedule": 854, "kernelscheduletag": 855, "epilogueschedule": 856, "tilescheduler": 857, "epiloguetiletype": 858, "collective": 859, "epiloguetileauto": 860, "typename": 861, "machetekerneltemplate": 862, "datatypetag": 863, "elementa": 864, "elementb": 865, "elementd": 866, "groupscalet": 867, "groupzerot": 868, "channelscalet": 869, "tokenscalet": 870, "run_impl": 871, "prepack_template": 872, "machete_prepack_launcher": 873, "prepack_b_dispatch": 874, "prepackbargs": 875, "size_bits": 876, "prepack_impl": 877, "prepackedlayoutbtemplate": 878, "elementconvert": 879, "layout": 880, "columnmajor": 881, "atype": 882, "with_group_scales_type": 883, "tmawarpspecializedcooperativetmacoop": 884, "tmawarpspecializedcooperative": 885, "frozen": 886, "mostly": 887, "unique": 888, "shorter": 889, "type_nametemplate_globals": 890, "mixed": 891, "precision": 892, "spiritual": 893, "successor": 894, "optimized": 895, "hopper": 896, "architectures": 897, "new": 898, "pairs": 899, "easier": 900, "compared": 901, "overview": 902, "effectively": 903, "python": 904, "scale_type": 905, "w_s": 906, "compute_type": 907, "w_q": 908, "w_z": 909, "weight": 910, "zeropoints": 911, "_note": 912, "added": 913, "after": 914, "fma": 915, "pre": 916, "applied": 917, "supplied": 918, "assume": 919, "subtracted": 920, "before": 921, "api": 922, "main": 923, "optimization": 924, "prepacking": 925, "closely": 926, "match": 927, "allowing": 928, "wider": 929, "shared": 930, "memory": 931, "loads": 932, "loading": 933, "prepacked": 934, "calling": 935, "flow": 936, "looks": 937, "something": 938, "_custom_ops": 939, "ops": 940, "w_q_packed": 941, "machete_prepack_b": 942, "wtype": 943, "b_q": 944, "b_scales": 945, "b_group_size": 946, "generation": 947, "multiple": 948, "different": 949, "tile": 950, "instantiations": 951, "appended": 952, "get": 953, "automatically": 954, "assuming": 955, "you": 956, "provide": 957, "bundles": 958, "specialization": 959, "default": 960, "contain": 961, "scheduler": 962, "etc": 963, "perform": 964, "differently": 965, "problem": 966, "almost": 967, "never": 968, "one": 969, "beneficial": 970, "potential": 971, "comes": 972, "should": 973, "provided": 974, "maps": 975, "used": 976, "user": 977, "does": 978, "parameter": 979, "define": 980, "feature": 981, "combinations": 982, "with_zeropoints": 983, "with_scales": 984, "compile": 985, "times": 986, "limiting": 987, "enum": 988, "enum_auto": 989, "tmawarpspecialized": 990, "tmawarpspecializedpingpong": 991, "enumfrom": 992, "unionfrom": 993, "cutlass_library": 994, "extend": 995, "library": 996, "custom": 997, "missing": 998, "values": 999, "datatypenames": 1000, "vllm_uint4b8_t": 1001, "vllm_uint8b128_t": 1002, "datatypesize": 1003, "s4": 1004, "ks4": 1005, "ks8": 1006, "byte": 1007, "char": 1008, "float8_e4m3fn": 1009, "bfloat16": 1010, "float": 1011, "kernelscheduletype": 1012, "kerneltmawarpspecialized": 1013, "kerneltmawarpspecializedpingpong": 1014, "is_allowed_file": 1015, "current_file": 1016, "bool": 1017, "allowed_files": 1018, "is_forbidden_import": 1019, "line": 1020, "stripped": 1021, "forbidden_import_re": 1022, "allowed_lines": 1023, "parse_diff": 1024, "diff": 1025, "violations": 1026, "current_lineno": 1027, "skip_allowed_file": 1028, "splitlines": 1029, "startswith": 1030, "re": 1031, "search": 1032, "next": 1033, "code_line": 1034, "get_diff": 1035, "diff_type": 1036, "staged": 1037, "check_output": 1038, "git": 1039, "cached": 1040, "unified": 1041, "text": 1042, "unstaged": 1043, "raise": 1044, "valueerror": 1045, "unknown": 1046, "all_violations": 1047, "try": 1048, "diff_output": 1049, "except": 1050, "calledprocesserror": 1051, "failed": 1052, "sys": 1053, "stderr": 1054, "forbidden": 1055, "direct": 1056, "triton": 1057, "detected": 1058, "triton_utils": 1059, "sysimport": 1060, "regex": 1061, "reforbidden_import_re": 1062, "tritonallowed_lines": 1063, "tl": 1064, "importing": 1065, "exit": 1066, "get_staged_python_files": 1067, "result": 1068, "run": 1069, "filter": 1070, "am": 1071, "capture_output": 1072, "stdout": 1073, "endswith": 1074, "forbidden_patterns": 1075, "allowed_patterns": 1076, "check_file": 1077, "encoding": 1078, "utf": 1079, "line_num": 1080, "oserror": 1081, "unicodedecodeerror": 1082, "total_violations": 1083, "setup": 1084, "found": 1085, "please": 1086, "noqa": 1087, "e501": 1088, "imports": 1089, "projectfrom": 1090, "__future__": 1091, "annotationsimport": 1092, "subprocessfrom": 1093, "pathlib": 1094, "pathimport": 1095, "reforbidden_patterns": 1096, "systemexit": 1097, "generates": 1098, "specialized": 1099, "requirements": 1100, "nightly": 1101, "pytorch": 1102, "testing": 1103, "script": 1104, "reads": 1105, "test": 1106, "input": 1107, "splits": 1108, "its": 1109, "content": 1110, "two": 1111, "nightly_torch_test": 1112, "txt": 1113, "contains": 1114, "dependenciesexcept": 1115, "related": 1116, "torch_nightly_test": 1117, "packages": 1118, "input_file": 1119, "white": 1120, "compatible": 1121, "directly": 1122, "pip": 1123, "install": 1124, "your": 1125, "package": 1126, "dependency": 1127, "fails": 1128, "white_list": 1129, "torchaudio": 1130, "torchvision": 1131, "mamba_ssm": 1132, "lines": 1133, "readlines": 1134, "skip_next": 1135, "falsefor": 1136, "get_python_executable": 1137, "executable": 1138, "get_cpu_cores": 1139, "number": 1140, "cpu": 1141, "cores": 1142, "multiprocessing": 1143, "cpu_count": 1144, "generate_presets": 1145, "output_path": 1146, "cmakeuserpresets": 1147, "json": 1148, "attempting": 1149, "detect": 1150, "system": 1151, "configuration": 1152, "nvcc": 1153, "nvcc_path": 1154, "cuda_home": 1155, "prospective_path": 1156, "bin": 1157, "utils": 1158, "cpp_extension": 1159, "nvcc_path_input": 1160, "find": 1161, "full": 1162, "usr": 1163, "local": 1164, "cuda": 1165, "python_executable": 1166, "python_executable_prompt": 1167, "development": 1168, "typically": 1169, "virtual": 1170, "home": 1171, "venvs": 1172, "determine": 1173, "manually": 1174, "cpu_cores": 1175, "nvcc_threads": 1176, "min": 1177, "cmake_jobs": 1178, "cmake": 1179, "jobs": 1180, "root": 1181, "tools": 1182, "project_root": 1183, "abspath": 1184, "ensure": 1185, "absolute": 1186, "resolvable": 1187, "isabs": 1188, "might": 1189, "cache_variables": 1190, "cmake_cuda_compiler": 1191, "cmake_build_type": 1192, "release": 1193, "vllm_python_executable": 1194, "cmake_install_prefix": 1195, "sourcedir": 1196, "cmake_cuda_flags": 1197, "compiler": 1198, "cache": 1199, "sccache": 1200, "caching": 1201, "launcher": 1202, "cxx": 1203, "hip": 1204, "cmake_": 1205, "_compiler_launcher": 1206, "configure_preset": 1207, "binarydir": 1208, "build": 1209, "cachevariables": 1210, "ninja": 1211, "cmake_job_pools": 1212, "slower": 1213, "presets": 1214, "keep": 1215, "sync": 1216, "cmakelists": 1217, "cmakeminimumrequired": 1218, "major": 1219, "26": 1220, "patch": 1221, "configurepresets": 1222, "buildpresets": 1223, "configurepreset": 1224, "output_file_path": 1225, "overwrite": 1226, "already": 1227, "cancelled": 1228, "dump": 1229, "indent": 1230, "successfully": 1231, "nto": 1232, "preset": 1233, "cd": 1234, "initialize": 1235, "target": 1236, "error": 1237, "writing": 1238, "jsonimport": 1239, "multiprocessingimport": 1240, "sysfrom": 1241, "whichtry": 1242, "installation": 1243, "most": 1244, "reliable": 1245, "source": 1246, "truth": 1247, "cuda_homeexcept": 1248, "importerror": 1249, "falling": 1250, "back": 1251, "variable": 1252, "environ": 1253, "is_python_file": 1254, "scan_file": 1255, "pickle_re": 1256, "load_gitignore": 1257, "repo_root": 1258, "gitignore_path": 1259, "gitignore": 1260, "patterns": 1261, "read": 1262, "pathspec": 1263, "from_lines": 1264, "gitwildmatch": 1265, "spec": 1266, "bad_files": 1267, "dirpath": 1268, "filenames": 1269, "walk": 1270, "abs_path": 1271, "rel_path": 1272, "relpath": 1273, "ignored": 1274, "match_file": 1275, "nerror": 1276, "pickle": 1277, "cloudpickle": 1278, "nif": 1279, "intentional": 1280, "check_pickle_imports": 1281, "test_regex": 1282, "test_cases": 1283, "pkl": 1284, "cpkl": 1285, "dumps": 1286, "timport": 1287, "somethingelse": 1288, "pickleas": 1289, "asdf": 1290, "should_match": 1291, "assert": 1292, "expected": 1293, "got": 1294, "tests": 1295, "env": 1296, "python3": 1297, "retry": 1298, "pathspecexcept": 1299, "relative": 1300, "repo": 1301, "stop": 1302, "anything": 1303, "modules": 1304, "unsafe": 1305, "deserializing": 1306, "data": 1307, "potentially": 1308, "untrusted": 1309, "parties": 1310, "resulted": 1311, "cves": 1312, "numerous": 1313, "vulnerabilities": 1314, "ecosystem": 1315, "broadly": 1316, "adding": 1317, "uses": 1318, "consider": 1319, "safer": 1320, "alternatives": 1321, "msgpack": 1322, "pydantic": 1323, "absolutely": 1324, "necessary": 1325, "careful": 1326, "review": 1327, "v1": 1328, "serial_utils": 1329, "executor": 1330, "multiproc_executor": 1331, "multimodal": 1332, "hasher": 1333, "transformers_utils": 1334, "model_executor": 1335, "models": 1336, "registry": 1337, "utils_": 1338, "test_utils": 1339, "tokenization": 1340, "test_cached_tokenizer": 1341, "distributed": 1342, "parallel_state": 1343, "engine": 1344, "client": 1345, "device_communicators": 1346, "custom_all_reduce_utils": 1347, "shm_broadcast": 1348, "benchmarks": 1349, "graph_machete_bench": 1350, "benchmark_lora": 1351, "benchmark_machete": 1352, "fused_kernels": 1353, "layernorm_rms_benchmarks": 1354, "cutlass_benchmarks": 1355, "w8a8_benchmarks": 1356, "sparse_benchmarks": 1357, "worker": 1358, "worker_base": 1359, "mp_distributed_executor": 1360, "ray_distributed_executor": 1361, "entrypoints": 1362, "llm": 1363, "__init__": 1364, "sas": 1365, "argv": 1366, "expert": 1367, "parallel": 1368, "cluster": 1369, "described": 1370, "deepseek": 1371, "v3": 1372, "technical": 1373, "report": 1374, "http": 1375, "arxiv": 1376, "abs": 1377, "2412": 1378, "19437": 1379, "efficient": 1380, "deploy": 1381, "sparse": 1382, "moe": 1383, "many": 1384, "experts": 1385, "however": 1386, "deployment": 1387, "requires": 1388, "components": 1389, "beyond": 1390, "normal": 1391, "driver": 1392, "impossible": 1393, "bundle": 1394, "down": 1395, "steps": 1396, "libraries": 1397, "pplx": 1398, "ppl": 1399, "deepep": 1400, "dependencies": 1401, "nvshmem": 1402, "step": 1403, "require": 1404, "privileged": 1405, "access": 1406, "configure": 1407, "nvidia": 1408, "ibgda": 1409, "done": 1410, "host": 1411, "machine": 1412, "multi": 1413, "node": 1414, "scripts": 1415, "accept": 1416, "positional": 1417, "argument": 1418, "workspace": 1419, "staging": 1420, "defaulting": 1421, "pwd": 1422, "ep_kernels_workspace": 1423, "usage": 1424, "bash": 1425, "torch_cuda_arch_list": 1426, "install_python_libraries": 1427, "sh": 1428, "blackwell": 1429, "10": 1430, "sudo": 1431, "configure_system_drivers": 1432, "reboot": 1433, "load": 1434, "visitor": 1435, "ast": 1436, "nodevisitor": 1437, "self": 1438, "super": 1439, "_in_type_checking": 1440, "visit_if": 1441, "guard_is_type_checking": 1442, "attribute": 1443, "attr": 1444, "type_checking": 1445, "prev": 1446, "child": 1447, "visit": 1448, "orelse": 1449, "generic_visit": 1450, "visit_import": 1451, "alias": 1452, "names": 1453, "module_name": 1454, "_is_internal": 1455, "allowed_imports": 1456, "lineno": 1457, "inside": 1458, "visit_importfrom": 1459, "importfrom": 1460, "module_as_written": 1461, "module": 1462, "allowed_from_modules": 1463, "_fail": 1464, "disallowed": 1465, "eager": 1466, "msg": 1467, "init_path": 1468, "read_text": 1469, "tree": 1470, "parse": 1471, "lazy": 1472, "appears": 1473, "guard": 1474, "short": 1475, "whitelist": 1476, "astimport": 1477, "pathlibimport": 1478, "finalrepo_root": 1479, "resolve": 1480, "parent": 1481, "parentinit_path": 1482, "frozenset": 1483, "env_override": 1484, "configvalidator": 1485, "visit_classdef": 1486, "validate": 1487, "decorators": 1488, "decorator_list": 1489, "func": 1490, "validate_class": 1491, "fail": 1492, "decorator": 1493, "get_attr_docs": 1494, "cls_node": 1495, "classdef": 1496, "docstrings": 1497, "placed": 1498, "assignments": 1499, "davidism": 1500, "mit": 1501, "pairwise": 1502, "implement": 1503, "docs": 1504, "removed": 1505, "dropped": 1506, "iterator": 1507, "iter": 1508, "yield": 1509, "pair": 1510, "nodes": 1511, "assignment": 1512, "constant": 1513, "assign": 1514, "annassign": 1515, "expr": 1516, "doc": 1517, "inspect": 1518, "cleandoc": 1519, "targets": 1520, "annotated": 1521, "assigning": 1522, "plain": 1523, "class_node": 1524, "attr_docs": 1525, "stmt": 1526, "defined": 1527, "annotation": 1528, "classvar": 1529, "variables": 1530, "subscript": 1531, "field_name": 1532, "docstring": 1533, "slice": 1534, "elts": 1535, "literal_args": 1536, "arg": 1537, "literal": 1538, "literal1": 1539, "literal2": 1540, "validate_ast": 1541, "validate_file": 1542, "file_path": 1543, "validating": 1544, "end": 1545, "message": 1546, "ensures": 1547, "valuesand": 1548, "inspectimport": 1549, "sysif": 1550, "gputrc2graph": 1551, "processes": 1552, "nsight": 1553, "systems": 1554, "nsys": 1555, "gpu": 1556, "trace": 1557, "rep": 1558, "tracing": 1559, "enabled": 1560, "summaries": 1561, "visualizations": 1562, "useful": 1563, "profiling": 1564, "analyzing": 1565, "profile": 1566, "command": 1567, "arguments": 1568, "in_file": 1569, "metadata": 1570, "entry": 1571, "model": 1572, "elapsed_nonprofiled_sec": 1573, "llama": 1574, "gpt": 1575, "oss": 1576, "ds": 1577, "wall": 1578, "clock": 1579, "seconds": 1580, "specify": 1581, "elapsed": 1582, "inflate": 1583, "actual": 1584, "entries": 1585, "separated": 1586, "out_dir": 1587, "csv": 1588, "results": 1589, "saved": 1590, "title": 1591, "chart": 1592, "visualization": 1593, "nsys_cmd": 1594, "assumes": 1595, "notes": 1596, "pandas": 1597, "installed": 1598, "engines": 1599, "help": 1600, "example": 1601, "analyze": 1602, "cycles": 1603, "say": 1604, "collect": 1605, "serve": 1606, "run1": 1607, "fork": 1608, "exec": 1609, "graph": 1610, "delay": 1611, "duration": 1612, "openai": 1613, "120b": 1614, "collecting": 1615, "profiles": 1616, "needed": 1617, "aren": 1618, "captured": 1619, "till": 1620, "server": 1621, "come": 1622, "starts": 1623, "generating": 1624, "again": 1625, "total": 1626, "analysis": 1627, "306": 1628, "produce": 1629, "categorizes": 1630, "categories": 1631, "stacked": 1632, "bar": 1633, "shows": 1634, "mapped": 1635, "due": 1636, "substages": 1637, "consist": 1638, "moe_gemm": 1639, "mixture": 1640, "biggest": 1641, "category": 1642, "148": 1643, "followed": 1644, "attn": 1645, "lets": 1646, "prioritize": 1647, "focus": 1648, "optimizations": 1649, "images": 1650, "png": 1651, "table": 1652, "underneath": 1653, "copying": 1654, "post": 1655, "processing": 1656, "html_tbl": 1657, "mapping": 1658, "suppose": 1659, "improving": 1660, "consumer": 1661, "74": 1662, "sec": 1663, "perhaps": 1664, "hasn": 1665, "been": 1666, "dive": 1667, "compose": 1668, "image": 1669, "triton_poi_fused__to_copy_add_addmm_cat_": 1670, "csv1": 1671, "wish": 1672, "compare": 1673, "100": 1674, "run2": 1675, "102": 1676, "comparison": 1677, "process": 1678, "similar": 1679, "stack": 1680, "charts": 1681, "remain": 1682, "easy": 1683, "once": 1684, "shown": 1685, "than": 1686, "another": 1687, "taking": 1688, "largest": 1689, "amount": 1690, "cause": 1691, "difference": 1692, "classification": 1693, "classified": 1694, "them": 1695, "engine_model": 1696, "layer_anno": 1697, "stage": 1698, "layer": 1699, "substage": 1700, "mem": 1701, "h_d_memops": 1702, "misc": 1703, "basically": 1704, "dictionary": 1705, "keys": 1706, "bins": 1707, "wishes": 1708, "consisting": 1709, "leftover": 1710, "invoking": 1711, "infile": 1712, "enginemodeldata": 1713, "mappings": 1714, "fused_moe_kernel": 1715, "groupproblemshape": 1716, "group_gemm_starts": 1717, "llama4": 1718, "sigmoid": 1719, "catarraybatched": 1720, "prepare_inputs": 1721, "prepare_next": 1722, "flash": 1723, "nccldevkernel": 1724, "cross_device_reduce": 1725, "nccl_and_custom_ar": 1726, "_norm_": 1727, "norm": 1728, "act_and_mul_": 1729, "silu": 1730, "rotary_embedding_kernel": 1731, "rope": 1732, "softmax": 1733, "elementwise": 1734, "fp8_quant": 1735, "quantize": 1736, "reduce_kernel": 1737, "triton_kernel": 1738, "block_fp8": 1739, "gemm_fp8_blockwise": 1740, "block_fp8_gemm": 1741, "_group_gemm": 1742, "gemmuniversal": 1743, "matmul": 1744, "nvjet": 1745, "_fwd_": 1746, "flashattn": 1747, "_mla_": 1748, "_attn_": 1749, "sbtopk": 1750, "topk": 1751, "compute_position_kernel": 1752, "quant_fp8": 1753, "cvt_fp16_to_fp4": 1754, "bmm_": 1755, "section": 1756, "triton_moe_gemm": 1757, "matmul_ogs_": 1758, "_topk_forward": 1759, "_combined_routing": 1760, "_sum_bitmatrix_rows": 1761, "_compute_writeback_idx": 1762, "splitkreduce": 1763, "_flash_": 1764, "prepare_varlen": 1765, "fmha": 1766, "gputrace2graph": 1767, "parses": 1768, "pd": 1769, "avoid": 1770, "options": 1771, "mode": 1772, "copy_on_write": 1773, "helper": 1774, "functions": 1775, "summary": 1776, "csvs": 1777, "gen_nonoverlapped_sum_from_gputrace": 1778, "out_file": 1779, "logger": 1780, "df": 1781, "read_csv": 1782, "usecols": 1783, "start": 1784, "ns": 1785, "device": 1786, "strm": 1787, "sum_non_overlapping_intervals": 1788, "ready": 1789, "df_sum": 1790, "groupby": 1791, "as_index": 1792, "agg": 1793, "sum": 1794, "1e9": 1795, "sort_values": 1796, "ascending": 1797, "to_csv": 1798, "index": 1799, "returns": 1800, "sorted": 1801, "vectorized": 1802, "sorting": 1803, "records": 1804, "reset": 1805, "reset_index": 1806, "drop": 1807, "numpy": 1808, "arrays": 1809, "faster": 1810, "ends": 1811, "track": 1812, "interval": 1813, "current_end": 1814, "display_units": 1815, "overlapping": 1816, "intervals": 1817, "range": 1818, "partial": 1819, "overlap": 1820, "iloc": 1821, "columns": 1822, "get_loc": 1823, "complete": 1824, "make_html": 1825, "plotly": 1826, "express": 1827, "px": 1828, "empty": 1829, "output_name": 1830, "model_engine": 1831, "underscore": 1832, "categorical": 1833, "histogram": 1834, "round": 1835, "text_auto": 1836, "wrap": 1837, "axis": 1838, "labels": 1839, "update_xaxes": 1840, "automargin": 1841, "write_html": 1842, "pivot_df": 1843, "pivot_table": 1844, "aggfunc": 1845, "observed": 1846, "bottom": 1847, "loc": 1848, "total_elapsed_sec": 1849, "fillna": 1850, "to_html": 1851, "temp": 1852, "outfile": 1853, "finished": 1854, "anno_gpu_kernname": 1855, "anno_gpu_kernname_helper": 1856, "kern_name": 1857, "val": 1858, "apply": 1859, "make_nongpu_row": 1860, "nongpu_sec": 1861, "nongpu_row": 1862, "dataframe": 1863, "is_valid_file": 1864, "base_file": 1865, "asserts": 1866, "existent": 1867, "isfile": 1868, "getsize": 1869, "doesn": 1870, "exist": 1871, "should_gen_file": 1872, "new_file": 1873, "figure": 1874, "getmtime": 1875, "reusing": 1876, "gen_sum_file": 1877, "file_dir": 1878, "file_name": 1879, "basename": 1880, "overlapped": 1881, "nsys_stats_file": 1882, "_cuda_gpu_trace": 1883, "sum_file": 1884, "_cuda_gpu_kernel_tracesum": 1885, "cmd": 1886, "stats": 1887, "cuda_gpu_trace": 1888, "cmd_str": 1889, "exception": 1890, "correct": 1891, "overalapped": 1892, "gen_graph": 1893, "store": 1894, "combined": 1895, "combined_df": 1896, "idx": 1897, "total_sec": 1898, "annotate": 1899, "label": 1900, "gpu_sec": 1901, "2f": 1902, "resetting": 1903, "concat": 1904, "ignore_index": 1905, "exist_ok": 1906, "parse_tuple": 1907, "logging": 1908, "basicconfig": 1909, "asctime": 1910, "levelname": 1911, "parser": 1912, "argparse": 1913, "argumentparser": 1914, "description": 1915, "d1": 1916, "d2": 1917, "formatter_class": 1918, "rawdescriptionhelpformatter": 1919, "showing": 1920, "engine_model_help": 1921, "model_list": 1922, "engine_model_str": 1923, "add_argument": 1924, "nargs": 1925, "space": 1926, "dir": 1927, "parse_args": 1928, "gputrace": 1929, "cuda_gpu_kern_trace": 1930, "argparseimport": 1931, "loggingimport": 1932, "relogger": 1933, "getlogger": 1934, "annotating": 1935, "kernelsif": 1936, "flatten_entries": 1937, "entry_cls": 1938, "profile_dict": 1939, "entries_and_depth": 1940, "get_entries": 1941, "curr_depth": 1942, "children": 1943, "jsonfrom": 1944, "profiler": 1945, "layerwise_profile": 1946, "modelstatsentry": 1947, "summarystatsentryfrom": 1948, "tableprinter": 1949, "indent_stringif": 1950, "offline_inference": 1951, "phase": 1952, "either": 1953, "prefill": 1954, "decode_n": 1955, "decode": 1956, "choices": 1957, "layerwise": 1958, "json_trace": 1959, "profile_data": 1960, "choose": 1961, "among": 1962, "entries_and_depths": 1963, "summarystatsentry": 1964, "summary_stats": 1965, "column_widths": 1966, "80": 1967, "cuda_time_us": 1968, "12": 1969, "pct_cuda_time": 1970, "invocations": 1971, "15": 1972, "model_stats": 1973, "60": 1974, "cpu_time_us": 1975, "depth": 1976, "indent_string": 1977, "indent_style": 1978, "print_table": 1979, "largest_dist_from_leaf": 1980, "get_entries_at_depth": 1981, "entries_and_traces": 1982, "query": 1983, "tall": 1984, "enough": 1985, "fold_nodes": 1986, "nodes_to_fold": 1987, "trim_string_back": 1988, "width": 1989, "offset": 1990, "shorten_plot_legend_strings": 1991, "legend": 1992, "max_char_len": 1993, "get_texts": 1994, "set_text": 1995, "abbreviate_known_names": 1996, "get_text": 1997, "abbreviations": 1998, "mergedcolumnparallellinear": 1999, "mcplinear": 2000, "qkvparallellinear": 2001, "qkvplinear": 2002, "rowparallellinear": 2003, "rplinear": 2004, "float16": 2005, "attempt_to_make_names_unique": 2006, "non_unique_names": 2007, "all_the_same": 2008, "entries_and_traces_with_name": 2009, "zipped_traces": 2010, "first_trace_difference": 2011, "trace_eles": 2012, "leave": 2013, "aggregated": 2014, "group_trace_by_operations": 2015, "trace_df": 2016, "is_rms_norm": 2017, "op_name": 2018, "rms_norm_kernel": 2019, "is_attention_block": 2020, "flash_fwd": 2021, "reshape_and_cache_flash_kernel": 2022, "is_quant": 2023, "scaled_fp8_quant": 2024, "scaled_int8_quant": 2025, "lora": 2026, "is_sgmv_shrink": 2027, "sgmv_shrink": 2028, "is_sgmv_expand": 2029, "sgmv_expand": 2030, "is_bgmv_shrink": 2031, "bgmv_shrink": 2032, "is_bgmv_expand": 2033, "bgmv_expand": 2034, "is_cutlass_gemm_op": 2035, "device_kernel": 2036, "is_gemm_op": 2037, "xmma_gemm": 2038, "gemv2t_kernel": 2039, "s16816gemm": 2040, "is_elementwise_op": 2041, "elementwise_kernel": 2042, "is_mem_op": 2043, "memcpy": 2044, "memset": 2045, "is_vocab_embedding_op": 2046, "vocabparallelembed": 2047, "nccl": 2048, "is_nccl_op": 2049, "is_nccl_all_reduce": 2050, "all_reduce": 2051, "allreduce": 2052, "is_nccl_gather": 2053, "gather": 2054, "is_nccl_broadcast": 2055, "broadcast": 2056, "is_cross_device_reduce_1stage": 2057, "cross_device_reduce_1stage": 2058, "is_cross_device_reduce_2stage": 2059, "cross_device_reduce_2stage": 2060, "is_custom_ar_all_reduce": 2061, "_c_custom_ar": 2062, "is_reduce_kernel": 2063, "headers": 2064, "attention_ops": 2065, "quant_ops": 2066, "sgmv_shrink_ops": 2067, "sgmv_expand_ops": 2068, "bgmv_shrink_ops": 2069, "bgmv_expand_ops": 2070, "cutlass_gemm_ops": 2071, "gemm_ops": 2072, "rms_norm_ops": 2073, "vocab_embed_ops": 2074, "mem_ops": 2075, "elementwise_ops": 2076, "nccl_all_reduce_ops": 2077, "nccl_gather_ops": 2078, "nccl_broadcast_ops": 2079, "nccl_other_ops": 2080, "cross_device_reduce_1stage_ops": 2081, "cross_device_reduce_2stage_ops": 2082, "custom_ar_all_reduce_ops": 2083, "reduce_kernel_ops": 2084, "inplace": 2085, "plot_trace_df": 2086, "traces_df": 2087, "plot_metric": 2088, "plot_title": 2089, "get_phase_description": 2090, "phase_df": 2091, "descs": 2092, "phase_desc": 2093, "to_list": 2094, "desc": 2095, "phases": 2096, "phase_descs": 2097, "fig_size_x": 2098, "fig": 2099, "ax": 2100, "plt": 2101, "subplots": 2102, "figsize": 2103, "sharex": 2104, "draw": 2105, "bars": 2106, "op": 2107, "map": 2108, "isnan": 2109, "patches": 2110, "get_height": 2111, "get_x": 2112, "get_width": 2113, "get_y": 2114, "ha": 2115, "center": 2116, "bold": 2117, "handles": 2118, "gca": 2119, "get_legend_handles_labels": 2120, "bbox_to_anchor": 2121, "50": 2122, "setp": 2123, "get_xticklabels": 2124, "rotation": 2125, "90": 2126, "set_ylabel": 2127, "suptitle": 2128, "savefig": 2129, "bbox_inches": 2130, "tight": 2131, "created": 2132, "output_directory": 2133, "fetch": 2134, "plot": 2135, "make_names_unique": 2136, "top_k": 2137, "json_nodes_to_fold": 2138, "prepare_data": 2139, "profile_json": 2140, "step_keys": 2141, "get_entries_and_traces": 2142, "fold": 2143, "traces": 2144, "request": 2145, "simply": 2146, "leaf": 2147, "keep_only_top_entries": 2148, "metric": 2149, "nsmallest": 2150, "num_running_seqs": 2151, "seqs": 2152, "attempt": 2153, "some": 2154, "cleanup": 2155, "trace_dfs": 2156, "fill": 2157, "step_key": 2158, "combine": 2159, "frames": 2160, "put": 2161, "derived": 2162, "cuda_time_ms": 2163, "1000": 2164, "make_plot_title_suffix": 2165, "context": 2166, "sparsity": 2167, "run_type": 2168, "num_steps": 2169, "complete_num_requests_per_step": 2170, "completion": 2171, "engine_args": 2172, "batch_size": 2173, "promptlen": 2174, "prompt_len": 2175, "numgpus": 2176, "tensor_parallel_size": 2177, "step_traces": 2178, "decodes": 2179, "prefills": 2180, "all_decodes": 2181, "step_plot_interval": 2182, "prefill_traces": 2183, "decode_traces": 2184, "plot_title_suffix": 2185, "decode_steps": 2186, "copyimport": 2187, "osfrom": 2188, "pathfrom": 2189, "optionalimport": 2190, "matplotlib": 2191, "pyplot": 2192, "pltimport": 2193, "parsing": 2194, "grouping": 2195, "given": 2196, "high": 2197, "rms_norm": 2198, "plotting": 2199, "plots": 2200, "top": 2201, "sampler": 2202, "logitsprocessor": 2203, "let": 2204, "represent": 2205, "aggregate": 2206, "prepare": 2207, "extract": 2208, "relevant": 2209, "unexpected": 2210, "fold_json_node": 2211, "represents": 2212, "ninja_log": 2213, "creates": 2214, "object": 2215, "passing": 2216, "owner": 2217, "weighted_duration": 2218, "task": 2219, "setweightedduration": 2220, "sets": 2221, "weightedduration": 2222, "weighted": 2223, "takes": 2224, "divides": 2225, "tasks": 2226, "running": 2227, "thus": 2228, "approximate": 2229, "serialized": 2230, "serializing": 2231, "ending": 2232, "much": 2233, "longer": 2234, "durations": 2235, "allow": 2236, "modest": 2237, "floating": 2238, "errors": 2239, "epsilon": 2240, "000002": 2241, "describetargets": 2242, "printable": 2243, "summarizes": 2244, "dozens": 2245, "outputs": 2246, "handle": 2247, "sanely": 2248, "max_length": 2249, "chosen": 2250, "fit": 2251, "long": 2252, "minimizing": 2253, "word": 2254, "wrapping": 2255, "readtargets": 2256, "log": 2257, "show_all": 2258, "log_file": 2259, "objects": 2260, "header": 2261, "readline": 2262, "v5": 2263, "unrecognized": 2264, "targets_dict": 2265, "last_end_seen": 2266, "parts": 2267, "exe": 2268, "rudely": 2269, "halted": 2270, "corrupt": 2271, "silently": 2272, "cmdhash": 2273, "restart": 2274, "integral": 2275, "milliseconds": 2276, "earlier": 2277, "stamp": 2278, "possibly": 2279, "incremental": 2280, "throw": 2281, "away": 2282, "previous": 2283, "displayed": 2284, "independently": 2285, "comparing": 2286, "commands": 2287, "guaranteed": 2288, "several": 2289, "builds": 2290, "go": 2291, "backwards": 2292, "cases": 2293, "repeated": 2294, "changed": 2295, "identified": 2296, "hash": 2297, "getextension": 2298, "extra_patterns": 2299, "extension": 2300, "important": 2301, "consistent": 2302, "canonical": 2303, "ultimately": 2304, "goal": 2305, "fn_pattern": 2306, "fnmatch": 2307, "good": 2308, "type_mappings": 2309, "capture": 2310, "extensions": 2311, "present": 2312, "javac": 2313, "jar": 2314, "distinguished": 2315, "interface": 2316, "ext1": 2317, "splitext": 2318, "ext2": 2319, "preserve": 2320, "pdb": 2321, "dll": 2322, "pefile": 2323, "linking": 2324, "grouped": 2325, "together": 2326, "lib": 2327, "listed": 2328, "toc": 2329, "identify": 2330, "identifying": 2331, "obj": 2332, "categorized": 2333, "mojo": 2334, "jars": 2335, "java": 2336, "normalize": 2337, "count": 2338, "mojom": 2339, "summarizeentries": 2340, "extra_step_types": 2341, "beginning": 2342, "starting": 2343, "stopping": 2344, "exactly": 2345, "iterate": 2346, "keeping": 2347, "own": 2348, "easily": 2349, "calculated": 2350, "task_start_stop_times": 2351, "earliest": 2352, "latest": 2353, "total_cpu_time": 2354, "length": 2355, "weighted_total": 2356, "happen": 2357, "stops": 2358, "alphabet": 2359, "making": 2360, "work": 2361, "correctly": 2362, "running_tasks": 2363, "record": 2364, "processed": 2365, "know": 2366, "deltas": 2367, "last_time": 2368, "accumulated": 2369, "last_weighted_time": 2370, "scan": 2371, "events": 2372, "action_name": 2373, "accumulate": 2374, "num_running": 2375, "moment": 2376, "change": 2377, "ran": 2378, "del": 2379, "warn": 2380, "second": 2381, "500": 2382, "possible": 2383, "untrustworthy": 2384, "3f": 2385, "entries_by_ext": 2386, "defaultdict": 2387, "longest": 2388, "long_count": 2389, "1f": 2390, "parallelism": 2391, "completed": 2392, "average": 2393, "dest": 2394, "build_directory": 2395, "semicolon": 2396, "specific": 2397, "_extra_args": 2398, "parse_known_args": 2399, "step_types": 2400, "room": 2401, "extra": 2402, "global": 2403, "long_ext_count": 2404, "errno": 2405, "enoent": 2406, "2018": 2407, "chromium": 2408, "authors": 2409, "rights": 2410, "reserved": 2411, "governed": 2412, "bsd": 2413, "style": 2414, "modified": 2415, "googlesource": 2416, "depot_tools": 2417, "refs": 2418, "heads": 2419, "post_build_ninja_summary": 2420, "summarize": 2421, "invoked": 2422, "syntax": 2423, "report_build_time_ninja": 2424, "typical": 2425, "cpp": 2426, "torch_bindings": 2427, "_attn_c": 2428, "23": 2429, "31": 2430, "38": 2431, "_moe_c": 2432, "abi3": 2433, "flash_attn_c": 2434, "_c": 2435, "machete_mm_": 2436, "183": 2437, "185": 2438, "186": 2439, "37": 2440, "scaled_mm_c3x": 2441, "449": 2442, "43": 2443, "scaled_mm_c2x": 2444, "527": 2445, "344": 2446, "attention_": 2447, "1087": 2448, "1110": 2449, "10120": 2450, "1x": 2451, "134": 2452, "errnoimport": 2453, "fnmatchimport": 2454, "reportlong_ext_count": 2455, "copied": 2456, "modifications": 2457, "ninjatracingif": 2458, "spdxstatus": 2459, "enumeration": 2460, "missing_license": 2461, "missing_copyright": 2462, "missing_both": 2463, "completely": 2464, "check_spdx_header_status": 2465, "shebang": 2466, "start_idx": 2467, "has_license": 2468, "has_copyright": 2469, "license_line": 2470, "copyright_line": 2471, "add_header": 2472, "supplement": 2473, "seek": 2474, "truncate": 2475, "full_spdx_header": 2476, "writelines": 2477, "insert": 2478, "function": 2479, "files_missing_both": 2480, "files_missing_copyright": 2481, "files_missing_license": 2482, "fixing": 2483, "all_files_to_fix": 2484, "enumfull_spdx_header": 2485, "e501if": 2486, "cmake_minimum_required": 2487, "building": 2488, "places": 2489, "location": 2490, "mkdir": 2491, "dvllm_python_executable": 2492, "dcmake_install_prefix": 2493, "want": 2494, "component": 2495, "vllm_extensions": 2496, "languages": 2497, "overridden": 2498, "dvllm_target_device": 2499, "vllm_target_device": 2500, "backend": 2501, "cmake_current_list_dir": 2502, "suppress": 2503, "warnings": 2504, "unused": 2505, "ignoreme": 2506, "vllm_python_path": 2507, "prevent": 2508, "cmake_install_local_only": 2509, "all_components": 2510, "versions": 2511, "searched": 2512, "selected": 2513, "kept": 2514, "python_supported_versions": 2515, "11": 2516, "amd": 2517, "hip_supported_archs": 2518, "gfx906": 2519, "gfx908": 2520, "gfx90a": 2521, "gfx942": 2522, "gfx950": 2523, "gfx1030": 2524, "gfx1100": 2525, "gfx1101": 2526, "gfx1200": 2527, "gfx1201": 2528, "rocm": 2529, "having": 2530, "incorrect": 2531, "rather": 2532, "pyproject": 2533, "toml": 2534, "docker": 2535, "dockerfile": 2536, "torch_supported_version_cuda": 2537, "torch_supported_version_rocm": 2538, "matches": 2539, "find_python_from_executable": 2540, "fatal_error": 2541, "desired": 2542, "cmake_prefix_path": 2543, "append_cmake_prefix_path": 2544, "find_program": 2545, "nvcc_executable": 2546, "cuda_found": 2547, "partially": 2548, "customizations": 2549, "explicitly": 2550, "check_language": 2551, "enable_language": 2552, "find_package": 2553, "cmake_cuda_compiler_version": 2554, "gets": 2555, "version_greater_equal": 2556, "cuda_supported_archs": 2557, "forward": 2558, "strequal": 2559, "cpu_extension": 2560, "isn": 2561, "hip_found": 2562, "vllm_gpu_lang": 2563, "torch_version": 2564, "version_equal": 2565, "saw": 2566, "elseif": 2567, "recognizes": 2568, "recognize": 2569, "understand": 2570, "rocm_version_dev_major": 2571, "greater_equal": 2572, "able": 2573, "control": 2574, "basis": 2575, "cut": 2576, "globally": 2577, "clear_cuda_arches": 2578, "cuda_arch_flags": 2579, "extract_unique_cuda_archs_ascending": 2580, "cuda_archs": 2581, "archs": 2582, "cuda_archs_loose_intersection": 2583, "override": 2584, "arches": 2585, "vllm_gpu_arches": 2586, "override_gpu_arches": 2587, "_supported_archs": 2588, "compilation": 2589, "flags": 2590, "vllm_gpu_flags": 2591, "get_torch_gpu_compiler_flags": 2592, "fetchcontent": 2593, "compiled": 2594, "fetchcontent_base_dir": 2595, "play": 2596, "nicely": 2597, "produces": 2598, "artifacts": 2599, "binary_dir": 2600, "between": 2601, "cmake_binary_dir": 2602, "make_directory": 2603, "base": 2604, "overriding": 2605, "ggdb3": 2606, "verbose": 2607, "devug": 2608, "_flags_debug": 2609, "o0": 2610, "cmake_cxx_flags_debug": 2611, "certain": 2612, "marked": 2613, "nodiscard": 2614, "yet": 2615, "ignores": 2616, "lot": 2617, "mask": 2618, "real": 2619, "suppressing": 2620, "until": 2621, "properly": 2622, "addressed": 2623, "_flags": 2624, "wno": 2625, "cmake_cxx_flags": 2626, "cumem_allocator": 2627, "vllm_cumem_ext_src": 2628, "set_gencode_flags_for_srcs": 2629, "srcs": 2630, "enabling": 2631, "cumem": 2632, "allocator": 2633, "link": 2634, "against": 2635, "cumem_libs": 2636, "cuda_driver": 2637, "define_gpu_extension_target": 2638, "destination": 2639, "use_sabi": 2640, "with_soabi": 2641, "vllm_ext_src": 2642, "mamba": 2643, "selective_scan_fwd": 2644, "cache_kernels": 2645, "paged_attention_v1": 2646, "paged_attention_v2": 2647, "merge_attn_states": 2648, "vertical_slash_index": 2649, "pos_encoding_kernels": 2650, "activation_kernels": 2651, "layernorm_kernels": 2652, "layernorm_quant_kernels": 2653, "cuda_view": 2654, "q_gemm": 2655, "compressed_tensors": 2656, "int8_quant_kernels": 2657, "fused_layernorm_dynamic_per_token_quant": 2658, "gguf": 2659, "gguf_kernel": 2660, "cuda_utils_kernels": 2661, "custom_all_reduce": 2662, "cutlass_enable_headers_only": 2663, "cutlass_revision": 2664, "fixes": 2665, "bogus": 2666, "messages": 2667, "v4": 2668, "revision": 2669, "vllm_cutlass_src_dir": 2670, "is_absolute": 2671, "get_filename_component": 2672, "fetchcontent_declare": 2673, "source_dir": 2674, "git_repository": 2675, "git_tag": 2676, "git_progress": 2677, "speed": 2678, "download": 2679, "retrieving": 2680, "history": 2681, "git_shallow": 2682, "branch": 2683, "tags": 2684, "updated": 2685, "commit": 2686, "fetchcontent_makeavailable": 2687, "awq": 2688, "gemm_kernels": 2689, "permute_cols": 2690, "cutlass_w8a8": 2691, "scaled_mm_entry": 2692, "fp4": 2693, "nvfp4_quant_entry": 2694, "nvfp4_scaled_mm_entry": 2695, 