{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "def": 279, "remove_old_kernels": 280, "filename": 281, "glob": 282, "os": 283, "path": 284, "dirname": 285, "__file__": 286, "kernel_": 287, "cu": 288, "generate_new_kernels": 289, "scalar_type": 290, "dtype": 291, "itertools": 292, "product": 293, "scalar_types": 294, "dtypes": 295, "all_template_str_list": 296, "group_blocks": 297, "m_blocks": 298, "thread_configs": 299, "thread_m_blocks": 300, "order": 301, "case": 302, "only": 303, "support": 304, "gptq": 305, "int4": 306, "int8": 307, "ku4b8": 308, "ku8b128": 309, "continue": 310, "256": 311, "small": 312, "batch": 313, "need": 314, "128": 315, "large": 316, "64": 317, "channelwise": 318, "quantization": 319, "group_size": 320, "fp8": 321, "kfe4m3fn": 322, "nvfp4": 323, "supports": 324, "16": 325, "mxfp4": 326, "32": 327, "kfe2m1f": 328, "methods": 329, "don": 330, "k_blocks": 331, "n_blocks": 332, "threads": 333, "c_dtype": 334, "half": 335, "fp16": 336, "else": 337, "nv_bfloat16": 338, "is_zp_float_list": 339, "false": 340, "ku4": 341, "hqq": 342, "is_zp_float": 343, "true": 344, "4bit": 345, "append": 346, "s_type": 347, "elif": 348, "kfe8m0fnu": 349, "cannot": 350, "safely": 351, "dequantize": 352, "e8m0": 353, "so": 354, "skip": 355, "kfloat16": 356, "bf16": 357, "kbfloat16": 358, "template_str": 359, "jinja2": 360, "template": 361, "render": 362, "scalar_t": 363, "w_type_id": 364, "id": 365, "s_type_id": 366, "max": 367, "thread_n_blocks": 368, "thread_k_blocks": 369, "m_block_size_8": 370, "stages": 371, "pipe_stages": 372, "file_content": 373, "file_head": 374, "join": 375, "lower": 376, "spdx": 377, "license": 378, "identifier": 379, "apache": 380, "filecopyrighttext": 381, "copyright": 382, "project": 383, "import": 384, "subprocess": 385, "auto": 386, "generated": 387, "generate": 388, "py": 389, "clang": 390, "format": 391, "off": 392, "kernel": 393, "marlin_template": 394, "namespace": 395, "marlin_namespace_name": 396, "strip": 397, "__global__": 398, "void": 399, "marlin": 400, "marlin_kernel_params": 401, "zero": 402, "point": 403, "ku8": 404, "supported": 405, "add": 406, "reduce": 407, "wheel": 408, "call": 409, "rm": 410, "write": 411, "__name__": 412, "__main__": 413, "cutlass": 414, "epilogues": 415, "introduction": 416, "document": 417, "describes": 418, "various": 419, "implemented": 420, "fusing": 421, "de": 422, "operations": 423, "onto": 424, "gemms": 425, "currently": 426, "symmetric": 427, "weights": 428, "asymmetric": 429, "activations": 430, "both": 431, "can": 432, "quantized": 433, "per": 434, "tensor": 435, "token": 436, "scaledepilogue": 437, "bias": 438, "scaledepiloguebias": 439, "scaledepilogueazp": 440, "scaledepilogueazppertoken": 441, "do": 442, "final": 443, "binary": 444, "instead": 445, "passed": 446, "epilogue": 447, "induces": 448, "redundant": 449, "addition": 450, "operation": 451, "runtime": 452, "check": 453, "performance": 454, "minor": 455, "underlying": 456, "linear": 457, "algebra": 458, "more": 459, "details": 460, "activation": 461, "rfc": 462, "3975": 463, "widehat": 464, "matrices": 465, "become": 466, "following": 467, "math": 468, "s_a": 469, "j_a": 470, "z_a": 471, "s_b": 472, "here": 473, "output": 474, "gemm": 475, "scales": 476, "respectively": 477, "matrix": 478, "ones": 479, "dimensions": 480, "additional": 481, "would": 482, "required": 483, "expanding": 484, "further": 485, "calculate": 486, "follows": 487, "left": 488, "note": 489, "raw": 490, "known": 491, "ahead": 492, "each": 493, "row": 494, "equal": 495, "mathbf": 496, "vector": 497, "column": 498, "sums": 499, "computes": 500, "meaning": 501, "parameters": 502, "scale_a": 503, "scale": 504, "scalar": 505, "scale_b": 506, "always": 507, "because": 508, "term": 509, "has": 510, "every": 511, "precomputed": 512, "stored": 513, "azp_with_adj": 514, "generally": 515, "points": 516, "kernels": 517, "efficiently": 518, "users": 519, "must": 520, "precompute": 521, "pass": 522, "same": 523, "above": 524, "means": 525, "becomes": 526, "outer": 527, "azp_adj": 528, "adjustment": 529, "azp": 530, "performs": 531, "computation": 532, "where": 533, "dq": 534, "out": 535, "class": 536, "scheduleconfig": 537, "tile_shape_mn": 538, "tuple": 539, "int": 540, "cluster_shape_mnk": 541, "kernel_schedule": 542, "mixedinputkernelscheduletype": 543, "epilogue_schedule": 544, "epiloguescheduletype": 545, "typeconfig": 546, "datatype": 547, "union": 548, "vllmdatatype": 549, "b_group_scale": 550, "b_group_zeropoint": 551, "b_channel_scale": 552, "a_token_scale": 553, "prepacktypeconfig": 554, "b_num_bits": 555, "convert": 556, "implconfig": 557, "types": 558, "schedules": 559, "list": 560, "generate_sch_sig": 561, "schedule_config": 562, "str": 563, "tile_shape": 564, "cluster_shape": 565, "vllmkernelscheduletag": 566, "split": 567, "epiloguescheduletag": 568, "tile_scheduler": 569, "tileschedulertag": 570, "return": 571, "generate_terse_sch_sig": 572, "kernel_terse_names_replace": 573, "kerneltmawarpspecializedcooperative": 574, "tmami_": 575, "tmawarpspecializedcooperative_": 576, "tmacoop_": 577, "streamkscheduler": 578, "streamk": 579, "sch_sig": 580, "orig": 581, "terse": 582, "items": 583, "replace": 584, "generate_type_signature": 585, "kernel_types": 586, "vllmdatatypenames": 587, "getattr": 588, "field": 589, "name": 590, "fields": 591, "generate_type_option_name": 592, "b_": 593, "with_": 594, "_type": 595, "is_power_of_two": 596, "to_cute_constant": 597, "value": 598, "_to_cute_constant": 599, "isinstance": 600, "iterable": 601, "unique_schedules": 602, "impl_configs": 603, "set": 604, "sch": 605, "impl_config": 606, "unsigned_type_with_bitwidth": 607, "num_bits": 608, "u4": 609, "u8": 610, "u16": 611, "u32": 612, "u64": 613, "create_template": 614, "globals": 615, "update": 616, "template_globals": 617, "create_sources": 618, "num_impl_files": 619, "sources": 620, "machete_mm_dispatch": 621, "mm_dispatch_template": 622, "prepack_types": 623, "convert_type": 624, "vllmdatatypesize": 625, "accumulator": 626, "prepacked_type_key": 627, "prepack_type": 628, "now": 629, "first": 630, "type": 631, "seen": 632, "since": 633, "core": 634, "shapes": 635, "layouts": 636, "vary": 637, "based": 638, "less": 639, "way": 640, "unique_prepack_types": 641, "prepack_types_seen": 642, "key": 643, "machete_prepack": 644, "prepack_dispatch_template": 645, "up": 646, "impls": 647, "across": 648, "files": 649, "num_impls": 650, "lambda": 651, "len": 652, "num_impls_per_file": 653, "ceil": 654, "files_impls": 655, "curr_num_impls_assigned": 656, "curr_impl_in_file": 657, "curr_impl_configs": 658, "deepcopy": 659, "reversed": 660, "while": 661, "room_left_in_file": 662, "curr_ic": 663, "break": 664, "apart": 665, "current": 666, "impl": 667, "config": 668, "tmp_ic": 669, "pop": 670, "part": 671, "file_impls": 672, "enumerate": 673, "machete_mm_impl_part": 674, "mm_impl_template": 675, "csrc": 676, "machete": 677, "readme": 678, "md": 679, "codegeneration": 680, "info": 681, "how": 682, "works": 683, "script_dir": 684, "sch_common_params": 685, "dict": 686, "tmami": 687, "tmacoop": 688, "tileschedulertype": 689, "condition": 690, "default_tile_heuristic_config": 691, "257": 692, "16384": 693, "4096": 694, "129": 695, "8192": 696, "65": 697, "4069": 698, "12288": 699, "33": 700, "6144": 701, "17": 702, "26624": 703, "none": 704, "heuristic": 705, "tuned": 706, "h100s": 707, "default_heuristic": 708, "cond": 709, "tile_config": 710, "ignore": 711, "get_unique_schedules": 712, "sure": 713, "deterministic": 714, "file": 715, "non": 716, "causes": 717, "ccache": 718, "miss": 719, "gptq_kernel_type_configs": 720, "f32": 721, "u4b8": 722, "u8b128": 723, "f16": 724, "zip": 725, "repeat": 726, "awq_kernel_type_configs": 727, "todo": 728, "lucaswilkinson": 729, "tuning": 730, "qqq_tile_heuristic_config": 731, "broken": 732, "qqq": 733, "investigate": 734, "qqq_heuristic": 735, "qqq_kernel_types": 736, "s8": 737, "s32": 738, "e4m3": 739, "output_dir": 740, "delete": 741, "directory": 742, "exists": 743, "shutil": 744, "rmtree": 745, "create": 746, "makedirs": 747, "group": 748, "configurations": 749, "separate": 750, "filepath": 751, "output_file": 752, "collections": 753, "abc": 754, "copy": 755, "dataclasses": 756, "dataclass": 757, "functools": 758, "typing": 759, "optional": 760, "yapf": 761, "conflicts": 762, "isort": 763, "block": 764, "disable": 765, "vllm_cutlass_library_extension": 766, "vllmdatatypetag": 767, "vllmdatatypetorchdatatypetag": 768, "vllmdatatypevllmscalartypetag": 769, "enable": 770, "generator": 771, "templating": 772, "dispatch_template": 773, "machete_mm_launcher": 774, "cuh": 775, "type_sig": 776, "gen_type_sig": 777, "extern": 778, "torch": 779, "impl_": 780, "_sch_": 781, "gen_sch_sig": 782, "mmargs": 783, "endfor": 784, "mm_dispatch_": 785, "args": 786, "maybe_unused": 787, "maybe_schedule": 788, "endif": 789, "torch_check_not_implemented": 790, "machete_gemm": 791, "schedule": 792, "static": 793, "inline": 794, "std": 795, "scalartype": 796, "maybe_scalartype": 797, "const": 798, "nullopt": 799, "mm_dispatch": 800, "out_type": 801, "maybe_out_type": 802, "value_or": 803, "a_type": 804, "maybe_g_scales_type": 805, "maybe_group_scales": 806, "maybe_g_zeros_type": 807, "maybe_group_zeros": 808, "maybe_ch_scales_type": 809, "maybe_channel_scales": 810, "maybe_tok_scales_type": 811, "maybe_token_scales": 812, "b_type": 813, "vllmscalartypetag": 814, "torchtypetag": 815, "machete_mm": 816, "with_group_scale_type": 817, "tostring": 818, "with_group_zeropoint_type": 819, "with_channel_scale_type": 820, "with_token_scale_type": 821, "gen_type_option_name": 822, "string": 823, "supported_schedules_dispatch": 824, "supportedschedulesargs": 825, "schs": 826, "maybe_group_scales_type": 827, "maybe_group_zeros_type": 828, "loop": 829, "last": 830, "impl_template": 831, "struct": 832, "sch_": 833, "tileshapenm": 834, "shape": 835, "clustershape": 836, "reimplement": 837, "kernelschedule": 838, "kernelscheduletag": 839, "epilogueschedule": 840, "tilescheduler": 841, "epiloguetiletype": 842, "collective": 843, "epiloguetileauto": 844, "typename": 845, "machetekerneltemplate": 846, "datatypetag": 847, "elementa": 848, "elementb": 849, "elementd": 850, "groupscalet": 851, "groupzerot": 852, "channelscalet": 853, "tokenscalet": 854, "run_impl": 855, "prepack_template": 856, "machete_prepack_launcher": 857, "prepack_b_dispatch": 858, "prepackbargs": 859, "size_bits": 860, "prepack_impl": 861, "prepackedlayoutbtemplate": 862, "elementconvert": 863, "layout": 864, "columnmajor": 865, "atype": 866, "with_group_scales_type": 867, "tmawarpspecializedcooperative": 868, "frozen": 869, "mostly": 870, "unique": 871, "shorter": 872, "type_name": 873, "print": 874, "rendered": 875, "mixed": 876, "precision": 877, "spiritual": 878, "successor": 879, "optimized": 880, "hopper": 881, "architectures": 882, "new": 883, "pairs": 884, "easier": 885, "compared": 886, "overview": 887, "effectively": 888, "python": 889, "scale_type": 890, "w_s": 891, "compute_type": 892, "w_q": 893, "w_z": 894, "weight": 895, "zeropoints": 896, "_note": 897, "added": 898, "after": 899, "fma": 900, "pre": 901, "applied": 902, "supplied": 903, "assume": 904, "subtracted": 905, "before": 906, "api": 907, "main": 908, "optimization": 909, "prepacking": 910, "closely": 911, "match": 912, "allowing": 913, "wider": 914, "shared": 915, "memory": 916, "loads": 917, "loading": 918, "prepacked": 919, "calling": 920, "flow": 921, "looks": 922, "something": 923, "_custom_ops": 924, "ops": 925, "w_q_packed": 926, "machete_prepack_b": 927, "wtype": 928, "b_q": 929, "b_scales": 930, "b_group_size": 931, "generation": 932, "multiple": 933, "different": 934, "tile": 935, "instantiations": 936, "appended": 937, "get": 938, "automatically": 939, "assuming": 940, "you": 941, "provide": 942, "bundles": 943, "specialization": 944, "default": 945, "contain": 946, "scheduler": 947, "etc": 948, "perform": 949, "differently": 950, "problem": 951, "almost": 952, "never": 953, "one": 954, "beneficial": 955, "potential": 956, "comes": 957, "should": 958, "provided": 959, "maps": 960, "used": 961, "user": 962, "does": 963, "parameter": 964, "define": 965, "feature": 966, "combinations": 967, "with_zeropoints": 968, "with_scales": 969, "compile": 970, "times": 971, "limiting": 972, "enum": 973, "enum_auto": 974, "tmawarpspecialized": 975, "tmawarpspecializedpingpong": 976, "cutlass_library": 977, "extend": 978, "library": 979, "custom": 980, "missing": 981, "values": 982, "datatypenames": 983, "vllm_uint4b8_t": 984, "vllm_uint8b128_t": 985, "datatypesize": 986, "s4": 987, "ks4": 988, "ks8": 989, "byte": 990, "char": 991, "float8_e4m3fn": 992, "bfloat16": 993, "float": 994, "kernelscheduletype": 995, "kerneltmawarpspecialized": 996, "kerneltmawarpspecializedpingpong": 997, "is_allowed_file": 998, "current_file": 999, "bool": 1000, "is_forbidden_import": 1001, "line": 1002, "stripped": 1003, "parse_diff": 1004, "diff": 1005, "violations": 1006, "current_lineno": 1007, "skip_allowed_file": 1008, "splitlines": 1009, "startswith": 1010, "re": 1011, "search": 1012, "next": 1013, "code_line": 1014, "get_diff": 1015, "diff_type": 1016, "staged": 1017, "check_output": 1018, "git": 1019, "cached": 1020, "unified": 1021, "text": 1022, "unstaged": 1023, "all_violations": 1024, "try": 1025, "diff_output": 1026, "except": 1027, "calledprocesserror": 1028, "failed": 1029, "sys": 1030, "stderr": 1031, "forbidden": 1032, "direct": 1033, "triton": 1034, "detected": 1035, "triton_utils": 1036, "regex": 1037, "forbidden_import_re": 1038, "allowed_lines": 1039, "tl": 1040, "allowed_files": 1041, "importing": 1042, "raise": 1043, "valueerror": 1044, "unknown": 1045, "exit": 1046, "get_staged_python_files": 1047, "result": 1048, "run": 1049, "filter": 1050, "am": 1051, "capture_output": 1052, "stdout": 1053, "endswith": 1054, "forbidden_patterns": 1055, "check_file": 1056, "encoding": 1057, "utf": 1058, "line_num": 1059, "oserror": 1060, "unicodedecodeerror": 1061, "total_violations": 1062, "setup": 1063, "found": 1064, "please": 1065, "noqa": 1066, "e501": 1067, "imports": 1068, "__future__": 1069, "annotations": 1070, "pathlib": 1071, "allowed_patterns": 1072, "systemexit": 1073, "generates": 1074, "specialized": 1075, "requirements": 1076, "nightly": 1077, "pytorch": 1078, "testing": 1079, "script": 1080, "reads": 1081, "test": 1082, "input": 1083, "splits": 1084, "its": 1085, "content": 1086, "two": 1087, "nightly_torch_test": 1088, "txt": 1089, "contains": 1090, "dependencies": 1091, "related": 1092, "torch_nightly_test": 1093, "packages": 1094, "input_file": 1095, "white": 1096, "compatible": 1097, "directly": 1098, "pip": 1099, "install": 1100, "your": 1101, "package": 1102, "dependency": 1103, "fails": 1104, "white_list": 1105, "torchaudio": 1106, "torchvision": 1107, "mamba_ssm": 1108, "lines": 1109, "readlines": 1110, "skip_next": 1111, "get_python_executable": 1112, "executable": 1113, "get_cpu_cores": 1114, "number": 1115, "cpu": 1116, "cores": 1117, "generate_presets": 1118, "output_path": 1119, "cmakeuserpresets": 1120, "json": 1121, "attempting": 1122, "detect": 1123, "system": 1124, "configuration": 1125, "nvcc": 1126, "nvcc_path": 1127, "cuda_home": 1128, "prospective_path": 1129, "bin": 1130, "utils": 1131, "cpp_extension": 1132, "nvcc_path_input": 1133, "find": 1134, "full": 1135, "usr": 1136, "local": 1137, "cuda": 1138, "python_executable": 1139, "python_executable_prompt": 1140, "development": 1141, "typically": 1142, "virtual": 1143, "home": 1144, "venvs": 1145, "determine": 1146, "manually": 1147, "cpu_cores": 1148, "nvcc_threads": 1149, "min": 1150, "cmake_jobs": 1151, "cmake": 1152, "jobs": 1153, "root": 1154, "tools": 1155, "project_root": 1156, "abspath": 1157, "ensure": 1158, "absolute": 1159, "resolvable": 1160, "isabs": 1161, "might": 1162, "cache_variables": 1163, "cmake_cuda_compiler": 1164, "cmake_build_type": 1165, "release": 1166, "vllm_python_executable": 1167, "cmake_install_prefix": 1168, "sourcedir": 1169, "cmake_cuda_flags": 1170, "compiler": 1171, "cache": 1172, "sccache": 1173, "caching": 1174, "launcher": 1175, "cxx": 1176, "hip": 1177, "cmake_": 1178, "_compiler_launcher": 1179, "configure_preset": 1180, "binarydir": 1181, "build": 1182, "cachevariables": 1183, "ninja": 1184, "cmake_job_pools": 1185, "slower": 1186, "presets": 1187, "keep": 1188, "sync": 1189, "cmakelists": 1190, "cmakeminimumrequired": 1191, "major": 1192, "26": 1193, "patch": 1194, "configurepresets": 1195, "buildpresets": 1196, "configurepreset": 1197, "output_file_path": 1198, "overwrite": 1199, "already": 1200, "cancelled": 1201, "dump": 1202, "indent": 1203, "successfully": 1204, "nto": 1205, "preset": 1206, "cd": 1207, "initialize": 1208, "target": 1209, "multiprocessing": 1210, "installation": 1211, "most": 1212, "reliable": 1213, "source": 1214, "truth": 1215, "importerror": 1216, "falling": 1217, "back": 1218, "variable": 1219, "environ": 1220, "cpu_count": 1221, "error": 1222, "writing": 1223, "is_python_file": 1224, "scan_file": 1225, "pickle_re": 1226, "load_gitignore": 1227, "repo_root": 1228, "gitignore_path": 1229, "gitignore": 1230, "patterns": 1231, "read": 1232, "spec": 1233, "bad_files": 1234, "dirpath": 1235, "filenames": 1236, "walk": 1237, "abs_path": 1238, "rel_path": 1239, "relpath": 1240, "ignored": 1241, "match_file": 1242, "nerror": 1243, "pickle": 1244, "cloudpickle": 1245, "nif": 1246, "intentional": 1247, "check_pickle_imports": 1248, "test_regex": 1249, "test_cases": 1250, "pkl": 1251, "cpkl": 1252, "dumps": 1253, "timport": 1254, "somethingelse": 1255, "pickleas": 1256, "asdf": 1257, "should_match": 1258, "assert": 1259, "expected": 1260, "got": 1261, "env": 1262, "python3": 1263, "pathspec": 1264, "relative": 1265, "repo": 1266, "stop": 1267, "anything": 1268, "modules": 1269, "unsafe": 1270, "deserializing": 1271, "data": 1272, "potentially": 1273, "untrusted": 1274, "parties": 1275, "resulted": 1276, "cves": 1277, "numerous": 1278, "vulnerabilities": 1279, "ecosystem": 1280, "broadly": 1281, "adding": 1282, "uses": 1283, "consider": 1284, "safer": 1285, "alternatives": 1286, "msgpack": 1287, "pydantic": 1288, "absolutely": 1289, "necessary": 1290, "careful": 1291, "review": 1292, "v1": 1293, "serial_utils": 1294, "executor": 1295, "multiproc_executor": 1296, "multimodal": 1297, "hasher": 1298, "transformers_utils": 1299, "model_executor": 1300, "models": 1301, "registry": 1302, "tests": 1303, "utils_": 1304, "test_utils": 1305, "tokenization": 1306, "test_cached_tokenizer": 1307, "distributed": 1308, "parallel_state": 1309, "engine": 1310, "client": 1311, "device_communicators": 1312, "custom_all_reduce_utils": 1313, "shm_broadcast": 1314, "benchmarks": 1315, "graph_machete_bench": 1316, "benchmark_lora": 1317, "benchmark_machete": 1318, "fused_kernels": 1319, "layernorm_rms_benchmarks": 1320, "cutlass_benchmarks": 1321, "w8a8_benchmarks": 1322, "sparse_benchmarks": 1323, "worker": 1324, "worker_base": 1325, "mp_distributed_executor": 1326, "ray_distributed_executor": 1327, "entrypoints": 1328, "llm": 1329, "__init__": 1330, "sas": 1331, "from_lines": 1332, "gitwildmatch": 1333, "argv": 1334, "expert": 1335, "parallel": 1336, "cluster": 1337, "described": 1338, "deepseek": 1339, "v3": 1340, "technical": 1341, "report": 1342, "http": 1343, "arxiv": 1344, "abs": 1345, "2412": 1346, "19437": 1347, "efficient": 1348, "deploy": 1349, "sparse": 1350, "moe": 1351, "many": 1352, "experts": 1353, "however": 1354, "deployment": 1355, "requires": 1356, "components": 1357, "beyond": 1358, "normal": 1359, "driver": 1360, "impossible": 1361, "bundle": 1362, "down": 1363, "steps": 1364, "libraries": 1365, "pplx": 1366, "ppl": 1367, "deepep": 1368, "nvshmem": 1369, "step": 1370, "require": 1371, "privileged": 1372, "access": 1373, "configure": 1374, "nvidia": 1375, "ibgda": 1376, "done": 1377, "host": 1378, "machine": 1379, "multi": 1380, "node": 1381, "scripts": 1382, "accept": 1383, "positional": 1384, "argument": 1385, "workspace": 1386, "staging": 1387, "defaulting": 1388, "pwd": 1389, "ep_kernels_workspace": 1390, "usage": 1391, "bash": 1392, "torch_cuda_arch_list": 1393, "install_python_libraries": 1394, "sh": 1395, "blackwell": 1396, "10": 1397, "sudo": 1398, "configure_system_drivers": 1399, "reboot": 1400, "load": 1401, "visitor": 1402, "ast": 1403, "nodevisitor": 1404, "self": 1405, "super": 1406, "_in_type_checking": 1407, "visit_if": 1408, "guard_is_type_checking": 1409, "attribute": 1410, "attr": 1411, "type_checking": 1412, "prev": 1413, "child": 1414, "visit": 1415, "orelse": 1416, "generic_visit": 1417, "visit_import": 1418, "alias": 1419, "names": 1420, "module_name": 1421, "_is_internal": 1422, "allowed_imports": 1423, "lineno": 1424, "inside": 1425, "visit_importfrom": 1426, "importfrom": 1427, "module_as_written": 1428, "module": 1429, "allowed_from_modules": 1430, "_fail": 1431, "disallowed": 1432, "eager": 1433, "msg": 1434, "init_path": 1435, "read_text": 1436, "tree": 1437, "parse": 1438, "lazy": 1439, "appears": 1440, "guard": 1441, "short": 1442, "whitelist": 1443, "resolve": 1444, "parent": 1445, "frozenset": 1446, "env_override": 1447, "configvalidator": 1448, "visit_classdef": 1449, "validate": 1450, "decorators": 1451, "decorator_list": 1452, "func": 1453, "validate_class": 1454, "fail": 1455, "decorator": 1456, "get_attr_docs": 1457, "cls_node": 1458, "classdef": 1459, "docstrings": 1460, "placed": 1461, "assignments": 1462, "davidism": 1463, "mit": 1464, "pairwise": 1465, "implement": 1466, "docs": 1467, "removed": 1468, "dropped": 1469, "iterator": 1470, "iter": 1471, "yield": 1472, "pair": 1473, "nodes": 1474, "assignment": 1475, "constant": 1476, "assign": 1477, "annassign": 1478, "expr": 1479, "doc": 1480, "inspect": 1481, "cleandoc": 1482, "targets": 1483, "annotated": 1484, "assigning": 1485, "plain": 1486, "class_node": 1487, "attr_docs": 1488, "stmt": 1489, "defined": 1490, "annotation": 1491, "classvar": 1492, "variables": 1493, "subscript": 1494, "field_name": 1495, "docstring": 1496, "slice": 1497, "elts": 1498, "literal_args": 1499, "arg": 1500, "literal": 1501, "literal1": 1502, "literal2": 1503, "validate_ast": 1504, "validate_file": 1505, "file_path": 1506, "validating": 1507, "end": 1508, "message": 1509, "ensures": 1510, "gputrc2graph": 1511, "processes": 1512, "nsight": 1513, "systems": 1514, "nsys": 1515, "gpu": 1516, "trace": 1517, "rep": 1518, "tracing": 1519, "enabled": 1520, "summaries": 1521, "visualizations": 1522, "useful": 1523, "profiling": 1524, "analyzing": 1525, "profile": 1526, "command": 1527, "arguments": 1528, "in_file": 1529, "metadata": 1530, "entry": 1531, "model": 1532, "elapsed_nonprofiled_sec": 1533, "llama": 1534, "gpt": 1535, "oss": 1536, "ds": 1537, "wall": 1538, "clock": 1539, "seconds": 1540, "specify": 1541, "elapsed": 1542, "inflate": 1543, "actual": 1544, "entries": 1545, "separated": 1546, "out_dir": 1547, "csv": 1548, "results": 1549, "saved": 1550, "title": 1551, "chart": 1552, "visualization": 1553, "nsys_cmd": 1554, "assumes": 1555, "notes": 1556, "pandas": 1557, "installed": 1558, "engines": 1559, "help": 1560, "example": 1561, "analyze": 1562, "cycles": 1563, "say": 1564, "collect": 1565, "serve": 1566, "run1": 1567, "fork": 1568, "exec": 1569, "graph": 1570, "delay": 1571, "duration": 1572, "openai": 1573, "120b": 1574, "collecting": 1575, "profiles": 1576, "needed": 1577, "aren": 1578, "captured": 1579, "till": 1580, "server": 1581, "come": 1582, "starts": 1583, "generating": 1584, "again": 1585, "total": 1586, "analysis": 1587, "306": 1588, "produce": 1589, "categorizes": 1590, "categories": 1591, "stacked": 1592, "bar": 1593, "shows": 1594, "mapped": 1595, "due": 1596, "substages": 1597, "consist": 1598, "moe_gemm": 1599, "mixture": 1600, "biggest": 1601, "category": 1602, "148": 1603, "followed": 1604, "attn": 1605, "lets": 1606, "prioritize": 1607, "focus": 1608, "optimizations": 1609, "images": 1610, "png": 1611, "table": 1612, "underneath": 1613, "copying": 1614, "post": 1615, "processing": 1616, "html_tbl": 1617, "mapping": 1618, "suppose": 1619, "improving": 1620, "consumer": 1621, "74": 1622, "sec": 1623, "perhaps": 1624, "hasn": 1625, "been": 1626, "dive": 1627, "compose": 1628, "image": 1629, "triton_poi_fused__to_copy_add_addmm_cat_": 1630, "csv1": 1631, "wish": 1632, "compare": 1633, "100": 1634, "run2": 1635, "102": 1636, "comparison": 1637, "process": 1638, "similar": 1639, "stack": 1640, "charts": 1641, "remain": 1642, "easy": 1643, "once": 1644, "shown": 1645, "than": 1646, "another": 1647, "taking": 1648, "largest": 1649, "amount": 1650, "cause": 1651, "difference": 1652, "classification": 1653, "classified": 1654, "them": 1655, "engine_model": 1656, "layer_anno": 1657, "stage": 1658, "layer": 1659, "substage": 1660, "mem": 1661, "h_d_memops": 1662, "misc": 1663, "basically": 1664, "dictionary": 1665, "keys": 1666, "bins": 1667, "wishes": 1668, "consisting": 1669, "leftover": 1670, "invoking": 1671, "infile": 1672, "enginemodeldata": 1673, "mappings": 1674, "fused_moe_kernel": 1675, "groupproblemshape": 1676, "group_gemm_starts": 1677, "llama4": 1678, "sigmoid": 1679, "catarraybatched": 1680, "prepare_inputs": 1681, "prepare_next": 1682, "flash": 1683, "nccldevkernel": 1684, "cross_device_reduce": 1685, "nccl_and_custom_ar": 1686, "_norm_": 1687, "norm": 1688, "act_and_mul_": 1689, "silu": 1690, "rotary_embedding_kernel": 1691, "rope": 1692, "softmax": 1693, "elementwise": 1694, "fp8_quant": 1695, "quantize": 1696, "reduce_kernel": 1697, "triton_kernel": 1698, "block_fp8": 1699, "gemm_fp8_blockwise": 1700, "block_fp8_gemm": 1701, "_group_gemm": 1702, "gemmuniversal": 1703, "matmul": 1704, "nvjet": 1705, "_fwd_": 1706, "flashattn": 1707, "_mla_": 1708, "_attn_": 1709, "sbtopk": 1710, "topk": 1711, "compute_position_kernel": 1712, "quant_fp8": 1713, "cvt_fp16_to_fp4": 1714, "bmm_": 1715, "section": 1716, "triton_moe_gemm": 1717, "matmul_ogs_": 1718, "_topk_forward": 1719, "_combined_routing": 1720, "_sum_bitmatrix_rows": 1721, "_compute_writeback_idx": 1722, "splitkreduce": 1723, "_flash_": 1724, "prepare_varlen": 1725, "fmha": 1726, "gputrace2graph": 1727, "parses": 1728, "pd": 1729, "avoid": 1730, "options": 1731, "mode": 1732, "copy_on_write": 1733, "helper": 1734, "functions": 1735, "summary": 1736, "csvs": 1737, "gen_nonoverlapped_sum_from_gputrace": 1738, "out_file": 1739, "logger": 1740, "df": 1741, "read_csv": 1742, "usecols": 1743, "start": 1744, "ns": 1745, "device": 1746, "strm": 1747, "sum_non_overlapping_intervals": 1748, "ready": 1749, "df_sum": 1750, "groupby": 1751, "as_index": 1752, "agg": 1753, "sum": 1754, "1e9": 1755, "sort_values": 1756, "ascending": 1757, "to_csv": 1758, "index": 1759, "returns": 1760, "sorted": 1761, "vectorized": 1762, "sorting": 1763, "records": 1764, "reset": 1765, "reset_index": 1766, "drop": 1767, "numpy": 1768, "arrays": 1769, "faster": 1770, "ends": 1771, "track": 1772, "interval": 1773, "current_end": 1774, "display_units": 1775, "overlapping": 1776, "intervals": 1777, "range": 1778, "partial": 1779, "overlap": 1780, "iloc": 1781, "columns": 1782, "get_loc": 1783, "complete": 1784, "make_html": 1785, "plotly": 1786, "express": 1787, "px": 1788, "empty": 1789, "output_name": 1790, "model_engine": 1791, "underscore": 1792, "categorical": 1793, "histogram": 1794, "round": 1795, "text_auto": 1796, "wrap": 1797, "axis": 1798, "labels": 1799, "update_xaxes": 1800, "automargin": 1801, "write_html": 1802, "pivot_df": 1803, "pivot_table": 1804, "aggfunc": 1805, "observed": 1806, "bottom": 1807, "loc": 1808, "total_elapsed_sec": 1809, "fillna": 1810, "to_html": 1811, "temp": 1812, "outfile": 1813, "finished": 1814, "anno_gpu_kernname": 1815, "anno_gpu_kernname_helper": 1816, "kern_name": 1817, "val": 1818, "apply": 1819, "make_nongpu_row": 1820, "nongpu_sec": 1821, "nongpu_row": 1822, "dataframe": 1823, "is_valid_file": 1824, "base_file": 1825, "asserts": 1826, "existent": 1827, "isfile": 1828, "getsize": 1829, "doesn": 1830, "exist": 1831, "should_gen_file": 1832, "new_file": 1833, "figure": 1834, "getmtime": 1835, "reusing": 1836, "gen_sum_file": 1837, "file_dir": 1838, "file_name": 1839, "basename": 1840, "overlapped": 1841, "nsys_stats_file": 1842, "_cuda_gpu_trace": 1843, "sum_file": 1844, "_cuda_gpu_kernel_tracesum": 1845, "cmd": 1846, "stats": 1847, "cuda_gpu_trace": 1848, "cmd_str": 1849, "exception": 1850, "correct": 1851, "overalapped": 1852, "gen_graph": 1853, "store": 1854, "combined": 1855, "combined_df": 1856, "idx": 1857, "total_sec": 1858, "annotate": 1859, "label": 1860, "gpu_sec": 1861, "2f": 1862, "resetting": 1863, "concat": 1864, "ignore_index": 1865, "exist_ok": 1866, "parse_tuple": 1867, "logging": 1868, "basicconfig": 1869, "asctime": 1870, "levelname": 1871, "parser": 1872, "argparse": 1873, "argumentparser": 1874, "description": 1875, "d1": 1876, "d2": 1877, "formatter_class": 1878, "rawdescriptionhelpformatter": 1879, "showing": 1880, "engine_model_help": 1881, "model_list": 1882, "engine_model_str": 1883, "add_argument": 1884, "nargs": 1885, "space": 1886, "dir": 1887, "parse_args": 1888, "gputrace": 1889, "cuda_gpu_kern_trace": 1890, "getlogger": 1891, "annotating": 1892, "flatten_entries": 1893, "entry_cls": 1894, "profile_dict": 1895, "entries_and_depth": 1896, "get_entries": 1897, "curr_depth": 1898, "children": 1899, "profiler": 1900, "layerwise_profile": 1901, "modelstatsentry": 1902, "summarystatsentry": 1903, "tableprinter": 1904, "indent_string": 1905, "offline_inference": 1906, "phase": 1907, "either": 1908, "prefill": 1909, "decode_n": 1910, "decode": 1911, "choices": 1912, "layerwise": 1913, "json_trace": 1914, "profile_data": 1915, "choose": 1916, "among": 1917, "entries_and_depths": 1918, "summary_stats": 1919, "column_widths": 1920, "80": 1921, "cuda_time_us": 1922, "12": 1923, "pct_cuda_time": 1924, "invocations": 1925, "15": 1926, "model_stats": 1927, "60": 1928, "cpu_time_us": 1929, "depth": 1930, "indent_style": 1931, "print_table": 1932, "largest_dist_from_leaf": 1933, "get_entries_at_depth": 1934, "entries_and_traces": 1935, "query": 1936, "tall": 1937, "enough": 1938, "fold_nodes": 1939, "nodes_to_fold": 1940, "trim_string_back": 1941, "width": 1942, "offset": 1943, "shorten_plot_legend_strings": 1944, "legend": 1945, "max_char_len": 1946, "get_texts": 1947, "set_text": 1948, "abbreviate_known_names": 1949, "get_text": 1950, "abbreviations": 1951, "mergedcolumnparallellinear": 1952, "mcplinear": 1953, "qkvparallellinear": 1954, "qkvplinear": 1955, "rowparallellinear": 1956, "rplinear": 1957, "float16": 1958, "attempt_to_make_names_unique": 1959, "non_unique_names": 1960, "all_the_same": 1961, "entries_and_traces_with_name": 1962, "zipped_traces": 1963, "first_trace_difference": 1964, "trace_eles": 1965, "leave": 1966, "aggregated": 1967, "group_trace_by_operations": 1968, "trace_df": 1969, "is_rms_norm": 1970, "op_name": 1971, "rms_norm_kernel": 1972, "is_attention_block": 1973, "flash_fwd": 1974, "reshape_and_cache_flash_kernel": 1975, "is_quant": 1976, "scaled_fp8_quant": 1977, "scaled_int8_quant": 1978, "lora": 1979, "is_sgmv_shrink": 1980, "sgmv_shrink": 1981, "is_sgmv_expand": 1982, "sgmv_expand": 1983, "is_bgmv_shrink": 1984, "bgmv_shrink": 1985, "is_bgmv_expand": 1986, "bgmv_expand": 1987, "is_cutlass_gemm_op": 1988, "device_kernel": 1989, "is_gemm_op": 1990, "xmma_gemm": 1991, "gemv2t_kernel": 1992, "s16816gemm": 1993, "is_elementwise_op": 1994, "elementwise_kernel": 1995, "is_mem_op": 1996, "memcpy": 1997, "memset": 1998, "is_vocab_embedding_op": 1999, "vocabparallelembed": 2000, "nccl": 2001, "is_nccl_op": 2002, "is_nccl_all_reduce": 2003, "all_reduce": 2004, "allreduce": 2005, "is_nccl_gather": 2006, "gather": 2007, "is_nccl_broadcast": 2008, "broadcast": 2009, "is_cross_device_reduce_1stage": 2010, "cross_device_reduce_1stage": 2011, "is_cross_device_reduce_2stage": 2012, "cross_device_reduce_2stage": 2013, "is_custom_ar_all_reduce": 2014, "_c_custom_ar": 2015, "is_reduce_kernel": 2016, "headers": 2017, "attention_ops": 2018, "quant_ops": 2019, "sgmv_shrink_ops": 2020, "sgmv_expand_ops": 2021, "bgmv_shrink_ops": 2022, "bgmv_expand_ops": 2023, "cutlass_gemm_ops": 2024, "gemm_ops": 2025, "rms_norm_ops": 2026, "vocab_embed_ops": 2027, "mem_ops": 2028, "elementwise_ops": 2029, "nccl_all_reduce_ops": 2030, "nccl_gather_ops": 2031, "nccl_broadcast_ops": 2032, "nccl_other_ops": 2033, "cross_device_reduce_1stage_ops": 2034, "cross_device_reduce_2stage_ops": 2035, "custom_ar_all_reduce_ops": 2036, "reduce_kernel_ops": 2037, "inplace": 2038, "plot_trace_df": 2039, "traces_df": 2040, "plot_metric": 2041, "plot_title": 2042, "get_phase_description": 2043, "phase_df": 2044, "descs": 2045, "phase_desc": 2046, "to_list": 2047, "desc": 2048, "phases": 2049, "phase_descs": 2050, "fig_size_x": 2051, "fig": 2052, "ax": 2053, "plt": 2054, "subplots": 2055, "figsize": 2056, "sharex": 2057, "draw": 2058, "bars": 2059, "op": 2060, "map": 2061, "isnan": 2062, "patches": 2063, "get_height": 2064, "get_x": 2065, "get_width": 2066, "get_y": 2067, "ha": 2068, "center": 2069, "bold": 2070, "handles": 2071, "gca": 2072, "get_legend_handles_labels": 2073, "bbox_to_anchor": 2074, "50": 2075, "setp": 2076, "get_xticklabels": 2077, "rotation": 2078, "90": 2079, "set_ylabel": 2080, "suptitle": 2081, "savefig": 2082, "bbox_inches": 2083, "tight": 2084, "output_directory": 2085, "fetch": 2086, "plot": 2087, "make_names_unique": 2088, "top_k": 2089, "json_nodes_to_fold": 2090, "prepare_data": 2091, "profile_json": 2092, "step_keys": 2093, "get_entries_and_traces": 2094, "fold": 2095, "traces": 2096, "request": 2097, "simply": 2098, "leaf": 2099, "keep_only_top_entries": 2100, "metric": 2101, "nsmallest": 2102, "num_running_seqs": 2103, "seqs": 2104, "attempt": 2105, "some": 2106, "cleanup": 2107, "trace_dfs": 2108, "fill": 2109, "step_key": 2110, "combine": 2111, "frames": 2112, "put": 2113, "derived": 2114, "cuda_time_ms": 2115, "1000": 2116, "make_plot_title_suffix": 2117, "context": 2118, "sparsity": 2119, "run_type": 2120, "num_steps": 2121, "complete_num_requests_per_step": 2122, "completion": 2123, "engine_args": 2124, "batch_size": 2125, "promptlen": 2126, "prompt_len": 2127, "numgpus": 2128, "tensor_parallel_size": 2129, "step_traces": 2130, "decodes": 2131, "prefills": 2132, "all_decodes": 2133, "step_plot_interval": 2134, "prefill_traces": 2135, "decode_traces": 2136, "plot_title_suffix": 2137, "matplotlib": 2138, "pyplot": 2139, "parsing": 2140, "grouping": 2141, "given": 2142, "high": 2143, "rms_norm": 2144, "plotting": 2145, "created": 2146, "decode_steps": 2147, "plots": 2148, "top": 2149, "sampler": 2150, "logitsprocessor": 2151, "let": 2152, "represent": 2153, "aggregate": 2154, "prepare": 2155, "extract": 2156, "relevant": 2157, "unexpected": 2158, "fold_json_node": 2159, "represents": 2160, "ninja_log": 2161, "creates": 2162, "object": 2163, "passing": 2164, "owner": 2165, "weighted_duration": 2166, "task": 2167, "setweightedduration": 2168, "sets": 2169, "weightedduration": 2170, "weighted": 2171, "takes": 2172, "divides": 2173, "tasks": 2174, "running": 2175, "thus": 2176, "approximate": 2177, "serialized": 2178, "serializing": 2179, "ending": 2180, "much": 2181, "longer": 2182, "durations": 2183, "allow": 2184, "modest": 2185, "floating": 2186, "errors": 2187, "epsilon": 2188, "000002": 2189, "describetargets": 2190, "printable": 2191, "summarizes": 2192, "dozens": 2193, "outputs": 2194, "handle": 2195, "sanely": 2196, "max_length": 2197, "chosen": 2198, "fit": 2199, "long": 2200, "minimizing": 2201, "word": 2202, "wrapping": 2203, "readtargets": 2204, "log": 2205, "show_all": 2206, "log_file": 2207, "objects": 2208, "header": 2209, "readline": 2210, "v5": 2211, "unrecognized": 2212, "targets_dict": 2213, "last_end_seen": 2214, "parts": 2215, "exe": 2216, "rudely": 2217, "halted": 2218, "corrupt": 2219, "silently": 2220, "cmdhash": 2221, "restart": 2222, "integral": 2223, "milliseconds": 2224, "earlier": 2225, "stamp": 2226, "possibly": 2227, "incremental": 2228, "throw": 2229, "away": 2230, "previous": 2231, "displayed": 2232, "independently": 2233, "comparing": 2234, "commands": 2235, "guaranteed": 2236, "several": 2237, "builds": 2238, "go": 2239, "backwards": 2240, "cases": 2241, "repeated": 2242, "changed": 2243, "identified": 2244, "hash": 2245, "getextension": 2246, "extra_patterns": 2247, "extension": 2248, "important": 2249, "consistent": 2250, "canonical": 2251, "ultimately": 2252, "goal": 2253, "fn_pattern": 2254, "fnmatch": 2255, "good": 2256, "type_mappings": 2257, "capture": 2258, "extensions": 2259, "present": 2260, "javac": 2261, "jar": 2262, "distinguished": 2263, "interface": 2264, "ext1": 2265, "splitext": 2266, "ext2": 2267, "preserve": 2268, "pdb": 2269, "dll": 2270, "pefile": 2271, "linking": 2272, "grouped": 2273, "together": 2274, "lib": 2275, "listed": 2276, "toc": 2277, "identify": 2278, "identifying": 2279, "obj": 2280, "categorized": 2281, "mojo": 2282, "jars": 2283, "java": 2284, "normalize": 2285, "count": 2286, "mojom": 2287, "summarizeentries": 2288, "extra_step_types": 2289, "beginning": 2290, "starting": 2291, "stopping": 2292, "exactly": 2293, "iterate": 2294, "keeping": 2295, "own": 2296, "easily": 2297, "calculated": 2298, "task_start_stop_times": 2299, "earliest": 2300, "latest": 2301, "total_cpu_time": 2302, "length": 2303, "weighted_total": 2304, "happen": 2305, "stops": 2306, "alphabet": 2307, "making": 2308, "work": 2309, "correctly": 2310, "running_tasks": 2311, "record": 2312, "processed": 2313, "know": 2314, "deltas": 2315, "last_time": 2316, "accumulated": 2317, "last_weighted_time": 2318, "scan": 2319, "events": 2320, "action_name": 2321, "accumulate": 2322, "num_running": 2323, "moment": 2324, "change": 2325, "ran": 2326, "del": 2327, "warn": 2328, "second": 2329, "500": 2330, "possible": 2331, "untrustworthy": 2332, "3f": 2333, "entries_by_ext": 2334, "defaultdict": 2335, "longest": 2336, "long_count": 2337, "1f": 2338, "parallelism": 2339, "completed": 2340, "average": 2341, "dest": 2342, "build_directory": 2343, "semicolon": 2344, "specific": 2345, "_extra_args": 2346, "parse_known_args": 2347, "step_types": 2348, "room": 2349, "extra": 2350, "global": 2351, "long_ext_count": 2352, "2018": 2353, "chromium": 2354, "authors": 2355, "rights": 2356, "reserved": 2357, "governed": 2358, "bsd": 2359, "style": 2360, "modified": 2361, "googlesource": 2362, "depot_tools": 2363, "refs": 2364, "heads": 2365, "post_build_ninja_summary": 2366, "summarize": 2367, "invoked": 2368, "syntax": 2369, "report_build_time_ninja": 2370, "typical": 2371, "cpp": 2372, "torch_bindings": 2373, "_attn_c": 2374, "23": 2375, "31": 2376, "38": 2377, "_moe_c": 2378, "abi3": 2379, "flash_attn_c": 2380, "_c": 2381, "machete_mm_": 2382, "183": 2383, "185": 2384, "186": 2385, "37": 2386, "scaled_mm_c3x": 2387, "449": 2388, "43": 2389, "scaled_mm_c2x": 2390, "527": 2391, "344": 2392, "attention_": 2393, "1087": 2394, "1110": 2395, "10120": 2396, "1x": 2397, "134": 2398, "errno": 2399, "copied": 2400, "modifications": 2401, "ninjatracing": 2402, "enoent": 2403, "spdxstatus": 2404, "enumeration": 2405, "missing_license": 2406, "missing_copyright": 2407, "check_spdx_header_status": 2408, "shebang": 2409, "start_idx": 2410, "has_license": 2411, "has_copyright": 2412, "license_line": 2413, "copyright_line": 2414, "completely": 2415, "add_header": 2416, "supplement": 2417, "seek": 2418, "truncate": 2419, "missing_both": 2420, "full_spdx_header": 2421, "writelines": 2422, "insert": 2423, "function": 2424, "files_missing_both": 2425, "files_missing_copyright": 2426, "files_missing_license": 2427, "fixing": 2428, "all_files_to_fix": 2429, "cmake_minimum_required": 2430, "building": 2431, "places": 2432, "location": 2433, "mkdir": 2434, "dvllm_python_executable": 2435, "dcmake_install_prefix": 2436, "want": 2437, "component": 2438, "vllm_extensions": 2439, "languages": 2440, "overridden": 2441, "dvllm_target_device": 2442, "vllm_target_device": 2443, "backend": 2444, "cmake_current_list_dir": 2445, "suppress": 2446, "warnings": 2447, "unused": 2448, "ignoreme": 2449, "vllm_python_path": 2450, "prevent": 2451, "cmake_install_local_only": 2452, "all_components": 2453, "versions": 2454, "searched": 2455, "selected": 2456, "kept": 2457, "python_supported_versions": 2458, "11": 2459, "amd": 2460, "hip_supported_archs": 2461, "gfx906": 2462, "gfx908": 2463, "gfx90a": 2464, "gfx942": 2465, "gfx950": 2466, "gfx1030": 2467, "gfx1100": 2468, "gfx1101": 2469, "gfx1200": 2470, "gfx1201": 2471, "rocm": 2472, "having": 2473, "incorrect": 2474, "rather": 2475, "pyproject": 2476, "toml": 2477, "docker": 2478, "dockerfile": 2479, "torch_supported_version_cuda": 2480, "torch_supported_version_rocm": 2481, "matches": 2482, "find_python_from_executable": 2483, "fatal_error": 2484, "desired": 2485, "cmake_prefix_path": 2486, "append_cmake_prefix_path": 2487, "find_program": 2488, "nvcc_executable": 2489, "cuda_found": 2490, "partially": 2491, "customizations": 2492, "explicitly": 2493, "check_language": 2494, "enable_language": 2495, "find_package": 2496, "cmake_cuda_compiler_version": 2497, "gets": 2498, "version_greater_equal": 2499, "cuda_supported_archs": 2500, "forward": 2501, "strequal": 2502, "cpu_extension": 2503, "isn": 2504, "hip_found": 2505, "vllm_gpu_lang": 2506, "torch_version": 2507, "version_equal": 2508, "saw": 2509, "elseif": 2510, "recognizes": 2511, "recognize": 2512, "understand": 2513, "rocm_version_dev_major": 2514, "greater_equal": 2515, "able": 2516, "control": 2517, "basis": 2518, "cut": 2519, "globally": 2520, "clear_cuda_arches": 2521, "cuda_arch_flags": 2522, "extract_unique_cuda_archs_ascending": 2523, "cuda_archs": 2524, "archs": 2525, "cuda_archs_loose_intersection": 2526, "override": 2527, "arches": 2528, "vllm_gpu_arches": 2529, "override_gpu_arches": 2530, "_supported_archs": 2531, "compilation": 2532, "flags": 2533, "vllm_gpu_flags": 2534, "get_torch_gpu_compiler_flags": 2535, "fetchcontent": 2536, "compiled": 2537, "fetchcontent_base_dir": 2538, "play": 2539, "nicely": 2540, "produces": 2541, "artifacts": 2542, "binary_dir": 2543, "between": 2544, "cmake_binary_dir": 2545, "make_directory": 2546, "base": 2547, "overriding": 2548, "ggdb3": 2549, "verbose": 2550, "devug": 2551, "_flags_debug": 2552, "o0": 2553, "cmake_cxx_flags_debug": 2554, "certain": 2555, "marked": 2556, "nodiscard": 2557, "yet": 2558, "ignores": 2559, "lot": 2560, "mask": 2561, "real": 2562, "suppressing": 2563, "until": 2564, "properly": 2565, "addressed": 2566, "_flags": 2567, "wno": 2568, "cmake_cxx_flags": 2569, "cumem_allocator": 2570, "vllm_cumem_ext_src": 2571, "set_gencode_flags_for_srcs": 2572, "srcs": 2573, "enabling": 2574, "cumem": 2575, "allocator": 2576, "link": 2577, "against": 2578, "cumem_libs": 2579, "cuda_driver": 2580, "define_gpu_extension_target": 2581, "destination": 2582, "use_sabi": 2583, "with_soabi": 2584, "vllm_ext_src": 2585, "mamba": 2586, "selective_scan_fwd": 2587, "cache_kernels": 2588, "paged_attention_v1": 2589, "paged_attention_v2": 2590, "merge_attn_states": 2591, "vertical_slash_index": 2592, "pos_encoding_kernels": 2593, "activation_kernels": 2594, "layernorm_kernels": 2595, "layernorm_quant_kernels": 2596, "cuda_view": 2597, "q_gemm": 2598, "compressed_tensors": 2599, "int8_quant_kernels": 2600, "fused_layernorm_dynamic_per_token_quant": 2601, "gguf": 2602, "gguf_kernel": 2603, "cuda_utils_kernels": 2604, "custom_all_reduce": 2605, "cutlass_enable_headers_only": 2606, "cutlass_revision": 2607, "fixes": 2608, "bogus": 2609, "messages": 2610, "v4": 2611, "revision": 2612, "vllm_cutlass_src_dir": 2613, "is_absolute": 2614, "get_filename_component": 2615, "fetchcontent_declare": 2616, "source_dir": 2617, "git_repository": 2618, "git_tag": 2619, "git_progress": 2620, "speed": 2621, "download": 2622, "retrieving": 2623, "history": 2624, "git_shallow": 2625, "branch": 2626, "tags": 2627, "updated": 2628, "commit": 2629, "fetchcontent_makeavailable": 2630, "awq": 2631, "gemm_kernels": 2632, "permute_cols": 2633, "cutlass_w8a8": 2634, "scaled_mm_entry": 2635, "fp4": 2636, "nvfp4_quant_entry": 2637, "nvfp4_scaled_mm_entry": 2638, "nvfp4_blockwise_moe_kernel": 2639, "sparse_scaled_mm_entry": 2640, "cutlass_extensions": 2641, "mla": 2642, "cutlass_mla_entry": 2643, "per_token_group_quant": 2644, "least": 2645, "sizes": 2646, "atomicadd": 2647, "ptx": 2648, "marlin_archs": 2649, "preselected": 2650, "marlin_gen_script": 2651, "cmake_current_source_dir": 2652, "gptq_marlin": 2653, "generate_kernels": 2654, "md5": 2655, "marlin_gen_script_hash": 2656, "execute_process": 2657, "cmake_command": 2658, "pythonpath": 2659, "result_variable": 2660, "marlin_generation_result": 2661, "output_variable": 2662, "cmake_current_binary_dir": 2663, "marlin_generation": 2664, "error_file": 2665, "ncheck": 2666, "force": 2667, "skipping": 2668, "marlin_template_kernel_src": 2669, "set_source_files_properties": 2670, "properties": 2671, "compile_flags": 2672, "stub": 2673, "marlin_srcs": 2674, "dense": 2675, "marlin_cuda_kernel": 2676, "marlin_24_cuda_kernel": 2677, "marlin_qqq_gemm_kernel": 2678, "gptq_marlin_repack": 2679, "awq_marlin_repack": 2680, "allspark": 2681, "allspark_archs": 2682, "allspark_srcs": 2683, "gptq_allspark": 2684, "allspark_repack": 2685, "allspark_qgemm_w8a16": 2686, "scaled_mm_3x_archs": 2687, "cutlass_scaled_mm": 2688, "c3x": 2689, "later": 2690, "scaled_mm_archs": 2691, "0a": 2692, "scaled_mm_c3x_sm90": 2693, 