{"class": 0, "workerbase": 1, "worker": 2, "interface": 3, "allows": 4, "vllm": 5, "cleanly": 6, "separate": 7, "implementations": 8, "different": 9, "hardware": 10, "also": 11, "abstracts": 12, "control": 13, "plane": 14, "communication": 15, "communicate": 16, "request": 17, "metadata": 18, "other": 19, "workers": 20, "def": 21, "__init__": 22, "self": 23, "vllm_config": 24, "vllmconfig": 25, "none": 26, "model_config": 27, "cache_config": 28, "lora_config": 29, "load_config": 30, "parallel_config": 31, "scheduler_config": 32, "device_config": 33, "speculative_config": 34, "observability_config": 35, "kv_transfer_config": 36, "compilation_config": 37, "from": 38, "platforms": 39, "import": 40, "current_platform": 41, "init_device": 42, "initialize": 43, "device": 44, "state": 45, "loading": 46, "model": 47, "memory": 48, "allocations": 49, "raise": 50, "notimplementederror": 51, "initialize_cache": 52, "num_gpu_blocks": 53, "int": 54, "num_cpu_blocks": 55, "kv": 56, "cache": 57, "given": 58, "size": 59, "blocks": 60, "get_model": 61, "nn": 62, "module": 63, "load_model": 64, "load": 65, "onto": 66, "target": 67, "execute_model": 68, "execute_model_req": 69, "optional": 70, "executemodelrequest": 71, "list": 72, "sampleroutput": 73, "start_worker_execution_loop": 74, "execute": 75, "loop": 76, "parallel": 77, "you": 78, "can": 79, "stop": 80, "executing": 81, "driver": 82, "empty": 83, "output": 84, "see": 85, "stop_remote_worker_execution_loop": 86, "more": 87, "details": 88, "inference_mode": 89, "while": 90, "true": 91, "return": 92, "determine_num_available_blocks": 93, "tuple": 94, "determine": 95, "number": 96, "available": 97, "gpu": 98, "swappable": 99, "cpu": 100, "implementation": 101, "may": 102, "run": 103, "profiling": 104, "heuristics": 105, "caches": 106, "returns": 107, "where": 108, "active": 109, "appended": 110, "refers": 111, "swapped": 112, "cannot": 113, "get_cache_block_size_bytes": 114, "single": 115, "block": 116, "bytes": 117, "used": 118, "speculative": 119, "decoding": 120, "add_lora": 121, "lora_request": 122, "lorarequest": 123, "bool": 124, "remove_lora": 125, "lora_id": 126, "pin_lora": 127, "list_loras": 128, "set": 129, "property": 130, "vocab_size": 131, "get": 132, "vocabulary": 133, "configuration": 134, "delegateworkerbase": 135, "delegates": 136, "all": 137, "methods": 138, "another": 139, "instance": 140, "useful": 141, "creating": 142, "wraps": 143, "args": 144, "kwargs": 145, "cls": 146, "resolve_obj_by_qualname": 147, "worker_cls": 148, "__getattr__": 149, "attr": 150, "loranotsupportedworkerbase": 151, "partial": 152, "raises": 153, "exceptions": 154, "when": 155, "lora": 156, "invoked": 157, "valueerror": 158, "type": 159, "does": 160, "support": 161, "workerinput": 162, "local": 163, "inputs": 164, "each": 165, "contain": 166, "specific": 167, "data": 168, "fields": 169, "should": 170, "broadcastable": 171, "num_seq_groups": 172, "blocks_to_swap_in": 173, "torch": 174, "tensor": 175, "blocks_to_swap_out": 176, "blocks_to_copy": 177, "virtual_engine": 178, "num_steps": 179, "classmethod": 180, "from_broadcasted_tensor_dict": 181, "tensor_dict": 182, "dict": 183, "str": 184, "any": 185, "pop": 186, "populate": 187, "new": 188, "as_broadcastable_tensor_dict": 189, "union": 190, "extract": 191, "localordistributedworkerbase": 192, "has": 193, "default": 194, "definition": 195, "perform": 196, "transfer": 197, "between": 198, "distributed": 199, "mode": 200, "subclasses": 201, "use": 202, "runners": 203, "inherit": 204, "modelrunnerbase": 205, "only": 206, "need": 207, "implement": 208, "logic": 209, "custom": 210, "needed": 211, "runner": 212, "instead": 213, "is_driver_worker": 214, "model_runner": 215, "observabilityconfig": 216, "abstractmethod": 217, "do_metadata_broadcast": 218, "check": 219, "whether": 220, "broadcast": 221, "tp": 222, "group": 223, "subclass": 224, "supports": 225, "execution": 226, "method": 227, "false": 228, "kv_cache": 229, "gets": 230, "pass": 231, "element": 232, "corresponding": 233, "particular": 234, "virtual": 235, "engine": 236, "pp": 237, "stream": 238, "follow": 239, "prepare_worker_input": 240, "prepare": 241, "execute_worker": 242, "move": 243, "allowed": 244, "devices": 245, "worker_input": 246, "process": 247, "_get_worker_input_from_broadcast": 248, "broadcastablemodelinput": 249, "input": 250, "broadcasted": 251, "assert": 252, "broadcast_data": 253, "broadcast_tensor_dict": 254, "src": 255, "model_input": 256, "make_model_input_from_broadcasted_tensor_dict": 257, "extract_previous_hidden_states": 258, "_get_driver_input_and_broadcast": 259, "modelrunnerinputbase": 260, "prepare_model_input": 261, "seq_group_metadata_list": 262, "finished_requests_ids": 263, "update": 264, "async_callback": 265, "dataclasses": 266, "replace": 267, "ignore": 268, "prepare_input": 269, "modelrunner": 270, "signals": 271, "requests": 272, "now": 273, "running": 274, "infinite": 275, "stops": 276, "broadcasts": 277, "send": 278, "notify": 279, "else": 280, "executes": 281, "least": 282, "one": 283, "step": 284, "sequences": 285, "unless": 286, "provided": 287, "start_time": 288, "time": 289, "perf_counter": 290, "we": 291, "don": 292, "intermediate_tensors": 293, "orig_model_execute_time": 294, "get_pp_group": 295, "is_first_rank": 296, "intermediatetensors": 297, "recv_tensor_dict": 298, "all_gather_group": 299, "get_tp_group": 300, "collect_model_execute_time": 301, "tensors": 302, "model_execute_time": 303, "item": 304, "kv_caches": 305, "is_last_rank": 306, "isinstance": 307, "send_tensor_dict": 308, "_execute_model_spmd": 309, "program": 310, "multiple": 311, "spmd": 312, "fashion": 313, "take": 314, "same": 315, "requires": 316, "workerwrapperbase": 317, "represents": 318, "executor": 319, "responsible": 320, "lazily": 321, "initializing": 322, "handling": 323, "lifecycle": 324, "first": 325, "instantiate": 326, "workerwrapper": 327, "which": 328, "remembers": 329, "name": 330, "call": 331, "update_environment_variables": 332, "real": 333, "initialization": 334, "happens": 335, "init_worker": 336, "rpc_rank": 337, "wrapper": 338, "note": 339, "rank": 340, "most": 341, "cases": 342, "however": 343, "executors": 344, "work": 345, "together": 346, "case": 347, "style": 348, "offline": 349, "inference": 350, "users": 351, "launch": 352, "engines": 353, "have": 354, "ranks": 355, "do": 356, "store": 357, "final": 358, "todo": 359, "investigate": 360, "remove": 361, "field": 362, "init_cached_hf_modules": 363, "unnecessary": 364, "tests": 365, "trust_remote_code": 366, "lazy": 367, "avoid": 368, "importing": 369, "before": 370, "utils": 371, "adjust_rank": 372, "rank_mapping": 373, "adjust": 374, "based": 375, "mapping": 376, "during": 377, "after": 378, "create": 379, "envs_list": 380, "envs": 381, "key": 382, "cuda_visible_devices": 383, "os": 384, "environ": 385, "overwriting": 386, "desired": 387, "behavior": 388, "suppress": 389, "warning": 390, "del": 391, "all_kwargs": 392, "here": 393, "inject": 394, "some": 395, "common": 396, "arguments": 397, "passed": 398, "constructor": 399, "required": 400, "enable_trace_function_call_for_thread": 401, "plugins": 402, "load_general_plugins": 403, "worker_class": 404, "logger": 405, "passing": 406, "object": 407, "strongly": 408, "deprecated": 409, "serialization": 410, "objects": 411, "tricky": 412, "error": 413, "prone": 414, "safe": 415, "please": 416, "keep": 417, "qualified": 418, "string": 419, "cloudpickle": 420, "loads": 421, "worker_extension_cls": 422, "extended_calls": 423, "__bases__": 424, "conflicts": 425, "dir": 426, "startswith": 427, "__": 428, "continue": 429, "hasattr": 430, "already": 431, "attribute": 432, "extension": 433, "callable": 434, "getattr": 435, "append": 436, "dynamically": 437, "info": 438, "injected": 439, "extended": 440, "collective_rpc": 441, "calls": 442, "set_current_vllm_config": 443, "make": 444, "config": 445, "initialize_from_config": 446, "kv_cache_configs": 447, "kv_cache_config": 448, "execute_method": 449, "try": 450, "resolution": 451, "order": 452, "defined": 453, "called": 454, "directly": 455, "otherwise": 456, "since": 457, "define": 458, "redirect": 459, "query": 460, "run_method": 461, "except": 462, "exception": 463, "rest": 464, "cause": 465, "deadlock": 466, "rpc": 467, "like": 468, "ray": 469, "https": 470, "github": 471, "com": 472, "project": 473, "issues": 474, "3455": 475, "print": 476, "inform": 477, "user": 478, "solve": 479, "msg": 480, "might": 481, "contains": 482, "previous_hidden_states": 483, "additional": 484, "following": 485, "draft": 486, "models": 487, "eagle": 488, "non": 489, "elif": 490, "hidden_states": 491, "spdx": 492, "license": 493, "identifier": 494, "apache": 495, "filecopyrighttext": 496, "copyright": 497, "contributors": 498, "abc": 499, "typing": 500, "init_logger": 501, "model_executor": 502, "layers": 503, "sampler": 504, "sequence": 505, "warn_for_unimplemented_methods": 506, "model_runner_base": 507, "__name__": 508, "get_vocab_size": 509, "dataclass": 510, "frozen": 511, "modelinputforneuron": 512, "neuronmodelrunner": 513, "input_tokens": 514, "input_positions": 515, "input_block_ids": 516, "sampling_metadata": 517, "samplingmetadata": 518, "multi_modal_kwargs": 519, "batchedtensorinputs": 520, "adapter_ids": 521, "attn_backend": 522, "attentionbackend": 523, "aws": 524, "neuron": 525, "upper": 526, "limit": 527, "top_k": 528, "_max_neuron_sampling_top_k": 529, "256": 530, "get_sliding_window": 531, "sliding": 532, "window": 533, "supported": 534, "without": 535, "deviceconfig": 536, "pin_memory": 537, "is_pin_memory_available": 538, "once": 539, "neuron_on_device_sampling_disabled": 540, "zero": 541, "value": 542, "turn": 543, "off": 544, "sampling": 545, "_on_device_sampling_disabled": 546, "getenv": 547, "needs": 548, "parameters": 549, "ids": 550, "change": 551, "across": 552, "batches": 553, "variable": 554, "stores": 555, "previous": 556, "batch": 557, "_previous_batch_request_ids": 558, "_init_neuron_sampling": 559, "use_transformers_neuronx": 560, "transformers_neuronx": 561, "generationconfig": 562, "transformers": 563, "turned": 564, "top_p": 565, "temperature": 566, "current": 567, "environment": 568, "neuron_sampling_params": 569, "max_length": 570, "max_model_len": 571, "do_sample": 572, "per_batch_line": 573, "max_num_seqs": 574, "dynamic": 575, "global_top_k": 576, "get_neuron_model": 577, "_prepare_prompt": 578, "sequencegroupmetadata": 579, "len": 580, "seq_lens": 581, "multi_modal_kwargs_list": 582, "multimodalkwargs": 583, "seq_group_metadata": 584, "is_prompt": 585, "seq_ids": 586, "seq_data": 587, "keys": 588, "seq_id": 589, "prompt_tokens": 590, "get_token_ids": 591, "seq_len": 592, "range": 593, "block_tables": 594, "block_table": 595, "mm_kwargs": 596, "multi_modal_data": 597, "process_multi_modal_data_neuron": 598, "max_seq_len": 599, "max": 600, "make_tensor_with_pad": 601, "pad": 602, "max_len": 603, "dtype": 604, "long": 605, "_prepare_decode": 606, "context_lens": 607, "generation_token": 608, "get_last_token_id": 609, "get_len": 610, "position": 611, "assume": 612, "prompts": 613, "decodes": 614, "sampling_params": 615, "_convert_to_neuron_sampling_params": 616, "later": 617, "tokens": 618, "well": 619, "mm_data": 620, "query_lens": 621, "chunked": 622, "prefill": 623, "doesn": 624, "just": 625, "generators": 626, "get_generators": 627, "changed": 628, "iteration": 629, "current_batch_request_ids": 630, "seq_group_meta_data": 631, "request_id": 632, "_update_neuron_sampling_params": 633, "current_sampling_params": 634, "failed": 635, "params": 636, "is_update_needed": 637, "index": 638, "equal": 639, "its": 640, "seq_group_top_k": 641, "seq_group_top_p": 642, "seq_group_temperature": 643, "update_generation_config": 644, "neuronx": 645, "samplingparams": 646, "float": 647, "enable": 648, "greedy": 649, "multi": 650, "forward": 651, "seq_group": 652, "seq_groups": 653, "use_neuronx_distributed": 654, "input_ids": 655, "positions": 656, "as_kwargs": 657, "validate": 658, "signature": 659, "compute": 660, "logits": 661, "outputs": 662, "token": 663, "compute_logits": 664, "sample": 665, "next": 666, "op": 667, "remove_all_loras": 668, "loras": 669, "framework": 670, "set_active_loras": 671, "lora_requests": 672, "lora_mapping": 673, "loramapping": 674, "type_checking": 675, "model_loader": 676, "multimodal": 677, "attention": 678, "backends": 679, "abstract": 680, "modelinputforgpuwithpoolingmetadata": 681, "modelinputforgpu": 682, "poolingmodelrunner": 683, "gpumodelrunnerbase": 684, "_model_input_cls": 685, "_builder_cls": 686, "modelinputforgpubuilder": 687, "kv_cache_dtype": 688, "auto": 689, "super": 690, "pooleroutput": 691, "currently": 692, "cuda": 693, "graph": 694, "decode": 695, "phase": 696, "attn_metadata": 697, "prefill_meta": 698, "prefill_metadata": 699, "decode_meta": 700, "decode_metadata": 701, "pooling": 702, "ab": 703, "integrate": 704, "text": 705, "autoregressive": 706, "prithvigeosaptialmae": 707, "really": 708, "processed": 709, "shot": 710, "both": 711, "would": 712, "placeholderattentionmetadata": 713, "figure": 714, "out": 715, "cuda_graph": 716, "explore": 717, "how": 718, "leverage": 719, "use_cuda_graph": 720, "inputs_embeds": 721, "graph_batch_size": 722, "shape": 723, "model_executable": 724, "graph_runners": 725, "seqlen_agnostic_kwargs": 726, "request_ids_to_seq_ids": 727, "has_inner_state": 728, "collect_model_forward_time": 729, "model_forward_start": 730, "event": 731, "enable_timing": 732, "model_forward_end": 733, "record": 734, "cross_enc_kwargs": 735, "token_types": 736, "token_type_ids": 737, "set_forward_context": 738, "hidden_or_intermediate_states": 739, "last": 740, "pipeline": 741, "stage": 742, "synchronize": 743, "model_forward_time": 744, "elapsed_time": 745, "orig_model_forward_time": 746, "pooler": 747, "pooling_metadata": 748, "_prepare_model_input_tensors": 749, "poolingmetadata": 750, "_prepare_pooling": 751, "prompt_lens": 752, "poolingparams": 753, "enumerate": 754, "pooling_params": 755, "task": 756, "did": 757, "api": 758, "cast": 759, "vllmmodelforpooling": 760, "to_update": 761, "get_pooling_updates": 762, "apply": 763, "sequencedata": 764, "forward_context": 765, "interfaces_base": 766, "override": 767, "require": 768, "deserialization": 769, "converting": 770, "global": 771, "produced": 772, "llm": 773, "add": 774, "specify": 775, "serialize": 776, "deserialize": 777, "modelinput": 778, "modelrunnerinputbuilderbase": 779, "generic": 780, "builder": 781, "add_seq_group": 782, "tba": 783, "build": 784, "processes": 785, "include": 786, "map": 787, "generator": 788, "seeded": 789, "random": 790, "get_supported_generation_tasks": 791, "generationtask": 792, "supported_tasks": 793, "is_text_generation_model": 794, "generate": 795, "supports_transcription": 796, "supports_transcription_only": 797, "transcription": 798, "get_supported_pooling_tasks": 799, "poolingtask": 800, "is_pooling_model": 801, "get_supported_tasks": 802, "supportedtask": 803, "tasks": 804, "runner_type": 805, "extend": 806, "finished_request_ids": 807, "per": 808, "clean": 809, "up": 810, "completed": 811, "modelrunnerwrapperbase": 812, "whole": 813, "point": 814, "inputprocessingerror": 815, "raised": 816, "occurs": 817, "preparing": 818, "gracefully": 819, "handle": 820, "errors": 821, "having": 822, "fail": 823, "entire": 824, "message": 825, "id": 826, "offending": 827, "__str__": 828, "_add_attn_metadata_broadcastable_dict": 829, "attentionmetadata": 830, "helper": 831, "_init_attn_metadata_from_tensor_dict": 832, "valid_attn_kwargs": 833, "get_metadata_cls": 834, "make_metadata": 835, "_init_sampling_metadata_from_tensor_dict": 836, "selected_token_indices": 837, "signal": 838, "skip": 839, "categorized_sample_indices": 840, "num_prompts": 841, "_add_sampling_metadata_broadcastable_dict": 842, "_init_frozen_model_input_from_tensor_dict": 843, "frozen_model_input_cls": 844, "valid_tensor_kwargs": 845, "val": 846, "frozen_model_input": 847, "typevar": 848, "interfaces": 849, "bound": 850, "asdict_zerocopy": 851, "cacheengine": 852, "manages": 853, "managing": 854, "provides": 855, "performing": 856, "operations": 857, "swapping": 858, "copying": 859, "cacheconfig": 860, "modelconfig": 861, "parallelconfig": 862, "head_size": 863, "get_head_size": 864, "jamba": 865, "mixed": 866, "typed": 867, "mamba": 868, "num_attention_layers": 869, "get_num_layers_by_block_type": 870, "layerblocktype": 871, "num_kv_heads": 872, "get_num_kv_heads": 873, "block_size": 874, "pipeline_parallel_size": 875, "cache_dtype": 876, "str_dtype_to_torch_dtype": 877, "backend": 878, "get_attn_backend": 879, "is_attention_free": 880, "use_mla": 881, "gpu_cache": 882, "_allocate_kv_cache": 883, "device_type": 884, "cpu_cache": 885, "num_blocks": 886, "allocates": 887, "specified": 888, "kv_cache_generic_shape": 889, "get_kv_cache_shape": 890, "kv_cache_stride_order": 891, "get_kv_cache_stride_order": 892, "attributeerror": 893, "allocation": 894, "respects": 895, "stride": 896, "ensure": 897, "semantic": 898, "remains": 899, "consistent": 900, "obtain": 901, "permute": 902, "according": 903, "could": 904, "result": 905, "contiguous": 906, "kv_cache_allocation_shape": 907, "null": 908, "cpugpublockallocator": 909, "zeroed": 910, "everything": 911, "simplicity": 912, "layer_kv_cache": 913, "zeros": 914, "view": 915, "back": 916, "total_pages": 917, "page_size": 918, "entry_shape": 919, "higher": 920, "than": 921, "1d": 922, "swap_in": 923, "src_to_dst": 924, "swap_blocks": 925, "swap_out": 926, "copy": 927, "src_to_dsts": 928, "copy_blocks": 929, "staticmethod": 930, "get_cache_block_size": 931, "num_heads": 932, "key_cache_entry": 933, "mla": 934, "latent": 935, "vector": 936, "joint": 937, "values": 938, "value_cache_entry": 939, "total": 940, "dtype_size": 941, "get_dtype_size": 942, "assert_enc_dec_mr_supported_scenario": 943, "enc_dec_mr": 944, "asserted": 945, "encoder": 946, "decoder": 947, "reflects": 948, "scenario": 949, "reminder": 950, "docs": 951, "features": 952, "compatibility_matrix": 953, "md": 954, "feature": 955, "combo": 956, "become": 957, "valid": 958, "enable_prefix_caching": 959, "str_not_impl_enc_dec_err_strs": 960, "str_not_impl_enc_dec_prefix_cache": 961, "sliding_window": 962, "str_not_impl_enc_dec_swa": 963, "chunked_prefill_enabled": 964, "str_not_impl_enc_dec_chunked_prefill": 965, "hf_config": 966, "attn_logit_softcapping": 967, "str_not_impl_enc_dec_logit_softcap": 968, "str_not_impl_enc_dec_lora": 969, "str_not_impl_enc_dec_pp": 970, "num_lookahead_slots": 971, "related": 972, "functions": 973, "str_not_impl_enc_dec_spec_dec": 974, "neuronworker": 975, "cores": 976, "local_rank": 977, "distributed_init_method": 978, "neuron_framework": 979, "get_neuron_framework_to_use": 980, "neuronframework": 981, "get_tnx_model_runner": 982, "neuronx_distributed_inference": 983, "get_neuronx_distributed_model_runner": 984, "vllm_neuron_framework": 985, "either": 986, "installed": 987, "frameworks": 988, "transformersneuronx": 989, "neuronx_distributed_model_runner": 990, "neuronxdistributedmodelrunner": 991, "neuronxdistributed": 992, "init_distributed_environment": 993, "seed": 994, "set_random_seed": 995, "yet": 996, "so": 997, "always": 998, "configure": 999, "maximum": 1000, "equivalent": 1001, "schedule": 1002, "pagedattention": 1003, "swap": 1004, "tested": 1005, "implemented": 1006, "uses": 1007, "parallelism": 1008, "still": 1009, "initialized": 1010, "world_size": 1011, "dist_backend": 1012, "ensure_model_parallel_initialized": 1013, "neuron_model_runner": 1014, "worker_base": 1015, "base": 1016, "possible": 1017, "steps": 1018, "scheduler_outputs": 1019, "scheduleroutputs": 1020, "tmodelinputforgpu": 1021, "exclude": 1022, "able": 1023, "pickle": 1024, "__getstate__": 1025, "__dict__": 1026, "what": 1027, "depickle": 1028, "callback": 1029, "properly": 1030, "__setstate__": 1031, "modelinputforgpuwithsamplingmetadata": 1032, "because": 1033, "ideally": 1034, "using": 1035, "kw_only": 1036, "subclassed": 1037, "easily": 1038, "python": 1039, "10": 1040, "interdataforseqgroup": 1041, "intermediate": 1042, "simple_reinit": 1043, "clear": 1044, "mrope_input_positions": 1045, "orig_seq_lens": 1046, "curr_sliding_window_blocks": 1047, "lora_index_mapping": 1048, "lora_prompt_mapping": 1049, "computed_block_nums": 1050, "n_seqs": 1051, "length": 1052, "capped": 1053, "original": 1054, "applying": 1055, "slot": 1056, "dual": 1057, "chunk": 1058, "flash": 1059, "computed": 1060, "modal": 1061, "multi_modal_placeholder_maps": 1062, "multimodalplaceholdermap": 1063, "prefix": 1064, "hit": 1065, "prefix_cache_hit": 1066, "reinit": 1067, "reinit_use_defaults": 1068, "encoder_seq_len": 1069, "__post_init__": 1070, "__repr__": 1071, "gen_inter_data_builder": 1072, "num_seqs": 1073, "lambda": 1074, "init_cached_inter_data": 1075, "inter": 1076, "inter_data_cache": 1077, "pyobjectcache": 1078, "obj": 1079, "get_object": 1080, "reset_cached_inter_data": 1081, "reset": 1082, "matters": 1083, "per_seq_compute_fns": 1084, "_compute_lens": 1085, "_compute_for_prefix_cache_hit": 1086, "_compute_for_sliding_window": 1087, "_compute_lora_input": 1088, "per_seq_group_compute_fns": 1089, "_compute_multi_modal_input": 1090, "model_input_cls": 1091, "enable_lora": 1092, "spec": 1093, "medusa": 1094, "atten": 1095, "attn_metadata_builder": 1096, "get_builder_cls": 1097, "weakref": 1098, "proxy": 1099, "configurations": 1100, "sliding_window_blocks": 1101, "block_aligned_sliding_window": 1102, "decode_only": 1103, "going": 1104, "inter_data_list": 1105, "inter_data": 1106, "seq_idx": 1107, "context": 1108, "token_chunk_size": 1109, "context_len": 1110, "get_num_computed_tokens": 1111, "min": 1112, "is_encoder_decoder": 1113, "prompt_embeds": 1114, "get_token_embeddings": 1115, "get_prompt_len": 1116, "mrope_position_delta": 1117, "mrotaryembedding": 1118, "get_next_input_positions": 1119, "remaining": 1120, "caching": 1121, "prompt": 1122, "larger": 1123, "enabled": 1124, "prefix_cache_len": 1125, "update_num_cached_tokens": 1126, "far": 1127, "chunks": 1128, "region": 1129, "normal": 1130, "computation": 1131, "missing": 1132, "part": 1133, "uncomputed_start": 1134, "full": 1135, "erroneous": 1136, "fixme": 1137, "mark": 1138, "scheduler": 1139, "happen": 1140, "curr_sliding_window_block": 1141, "sliding_seq_len": 1142, "sang": 1143, "hack": 1144, "paged": 1145, "attn": 1146, "kernel": 1147, "slinding": 1148, "elements": 1149, "suff_len": 1150, "lora_int_id": 1151, "query_len": 1152, "prompt_logprobs": 1153, "includes": 1154, "subset": 1155, "items": 1156, "intersect": 1157, "placeholder_maps": 1158, "from_seq_group": 1159, "rope": 1160, "mrope_positions": 1161, "even": 1162, "plain": 1163, "early": 1164, "special": 1165, "processing": 1166, "mrope": 1167, "deltas": 1168, "uses_mrope": 1169, "image_grid_thw": 1170, "video_grid_thw": 1171, "audio_feature_lengths": 1172, "second_per_grid_ts": 1173, "use_audio_in_video": 1174, "token_ids": 1175, "get_input_positions": 1176, "encoder_seq_data": 1177, "per_seq_fn": 1178, "per_seq_group_fn": 1179, "_use_captured_graph": 1180, "batch_size": 1181, "max_decode_seq_len": 1182, "max_encoder_seq_len": 1183, "enforce_eager": 1184, "max_seq_len_to_capture": 1185, "max_batchsize_to_capture": 1186, "_get_cuda_graph_pad_size": 1187, "padding": 1188, "graphs": 1189, "prefills": 1190, "guaranteed": 1191, "scheduled": 1192, "greatest": 1193, "lengths": 1194, "checking": 1195, "viablility": 1196, "encode": 1197, "defaults": 1198, "viability": 1199, "determined": 1200, "viable": 1201, "exit": 1202, "treat": 1203, "below": 1204, "function": 1205, "being": 1206, "conflation": 1207, "pad_for_cudagraph": 1208, "finalize": 1209, "combine": 1210, "flatten": 1211, "inputs_embeds_list": 1212, "cur_input_tokens": 1213, "cur_token_types": 1214, "cat": 1215, "dim": 1216, "idx": 1217, "msections": 1218, "_seq_input_positions": 1219, "_seq_mrope_input_positions": 1220, "cur_input_positions": 1221, "itself": 1222, "cuda_graph_pad_size": 1223, "accordingly": 1224, "capture_model": 1225, "itertools": 1226, "repeat": 1227, "input_tokens_tensor": 1228, "async_tensor_h2d": 1229, "token_types_tensor": 1230, "input_positions_tensor": 1231, "flatten_2d_lists": 1232, "index_mapping": 1233, "prompt_mapping": 1234, "is_prefill": 1235, "shared": 1236, "return_hidden_states": 1237, "input_registry": 1238, "inputregistry": 1239, "mm_registry": 1240, "multimodalregistry": 1241, "multimodal_registry": 1242, "max_capture_size": 1243, "cudagraphrunner": 1244, "graph_memory_pool": 1245, "capture": 1246, "in_profile_run": 1247, "tables": 1248, "must": 1249, "padded": 1250, "table": 1251, "expensive": 1252, "optimize": 1253, "numpy": 1254, "actual": 1255, "content": 1256, "every": 1257, "cached": 1258, "seq": 1259, "graph_block_tables": 1260, "np": 1261, "get_max_block_per_batch": 1262, "int32": 1263, "cross_layer_shared_graph_block_tables": 1264, "free": 1265, "stateful": 1266, "placeholder": 1267, "manage": 1268, "internal": 1269, "bypass": 1270, "selection": 1271, "altogether": 1272, "divide": 1273, "num_attn_heads": 1274, "get_num_attention_heads": 1275, "needs_attn_backend": 1276, "attn_state": 1277, "get_state_cls": 1278, "commonattentionstate": 1279, "lora_manager": 1280, "lrucacheworkerloramanager": 1281, "get_sampler": 1282, "set_cpu_offload_max_bytes": 1283, "cpu_offload_gb": 1284, "1024": 1285, "pythonizationcache": 1286, "clobbers": 1287, "sequencegrouptosample": 1288, "resulting": 1289, "potential": 1290, "prepare_model_inputs": 1291, "sampling_metadata_cache": 1292, "samplingmetadatacache": 1293, "starting": 1294, "devicememoryprofiler": 1295, "time_before_load": 1296, "supports_lora": 1297, "__class__": 1298, "supports_multimodal": 1299, "regarding": 1300, "adding": 1301, "language": 1302, "get_text_config": 1303, "text_config": 1304, "max_num_batched_tokens": 1305, "embedding_modules": 1306, "embedding_padding_modules": 1307, "max_position_embeddings": 1308, "create_lora_manager": 1309, "time_after_load": 1310, "model_memory_usage": 1311, "consumed_memory": 1312, "took": 1313, "4f": 1314, "gib": 1315, "6f": 1316, "seconds": 1317, "gib_bytes": 1318, "level": 1319, "compilationlevel": 1320, "dynamo_as_is": 1321, "supports_dynamo": 1322, "init_backend": 1323, "compilation_counter": 1324, "dynamo_as_is_count": 1325, "compile": 1326, "fullgraph": 1327, "vllm_test_dynamo_fullgraph_capture": 1328, "save_sharded_state": 1329, "path": 1330, "pattern": 1331, "max_size": 1332, "shardedstateloader": 1333, "save_model": 1334, "save_tensorized_model": 1335, "tensorizer_config": 1336, "tensorizerconfig": 1337, "tensorizerloader": 1338, "prepares": 1339, "assumes": 1340, "sorted": 1341, "structure": 1342, "example": 1343, "num_prefill_tokens": 1344, "automatically": 1345, "pads": 1346, "tracks": 1347, "bad": 1348, "contextmanager": 1349, "set_in_profile_run": 1350, "yield": 1351, "finally": 1352, "profile_run": 1353, "_dummy_run": 1354, "_add_dummy_loras": 1355, "num_loras": 1356, "dummy_lora_requests": 1357, "dummy_lora_cache": 1358, "dummy_lora_request": 1359, "lora_name": 1360, "warmup_": 1361, "lora_path": 1362, "add_dummy_lora": 1363, "lora_warmup_rank": 1364, "_remove_dummy_loras": 1365, "dummy": 1366, "top": 1367, "reflect": 1368, "accurate": 1369, "usage": 1370, "99": 1371, "unique": 1372, "therefore": 1373, "amount": 1374, "consumption": 1375, "copies": 1376, "warmup": 1377, "dummy_lora_requests_per_seq": 1378, "max_loras": 1379, "profile": 1380, "max_num_sequences": 1381, "seqs": 1382, "encoding": 1383, "accounted": 1384, "calculating": 1385, "blocker": 1386, "manager": 1387, "exercise": 1388, "worst": 1389, "chosen": 1390, "maximize": 1391, "images": 1392, "max_mm_tokens": 1393, "get_max_multimodal_tokens": 1394, "max_num_seqs_orig": 1395, "expr": 1396, "less": 1397, "setting": 1398, "minimum": 1399, "group_id": 1400, "dummy_data": 1401, "dummy_data_for_profiling": 1402, "multi_modal_placeholders": 1403, "num_layers": 1404, "get_num_layers": 1405, "force": 1406, "dynamo": 1407, "reference": 1408, "rather": 1409, "specializing": 1410, "argument": 1411, "matter": 1412, "float32": 1413, "wide": 1414, "important": 1415, "inside": 1416, "multiplying": 1417, "treating": 1418, "them": 1419, "aliasing": 1420, "make_empty_intermediate_tensors": 1421, "disable": 1422, "scale": 1423, "calculation": 1424, "enable_kv_scales_calculation": 1425, "runtimeerror": 1426, "remove_all_adapters": 1427, "set_active_adapters": 1428, "add_adapter": 1429, "remove_adapter": 1430, "pin_adapter": 1431, "list_adapters": 1432, "performance": 1433, "gain": 1434, "negligible": 1435, "batched": 1436, "200": 1437, "fixed": 1438, "sized": 1439, "supporting": 1440, "large": 1441, "high": 1442, "overhead": 1443, "thus": 1444, "captures": 1445, "captured": 1446, "capturing": 1447, "cudagraphs": 1448, "lead": 1449, "unexpected": 1450, "consequences": 1451, "static": 1452, "eager": 1453, "enforce": 1454, "cli": 1455, "cudagraph": 1456, "consider": 1457, "decreasing": 1458, "gpu_memory_utilization": 1459, "switching": 1460, "reduce": 1461, "decrease": 1462, "start_free_gpu_memory": 1463, "mem_get_info": 1464, "reused": 1465, "sizes": 1466, "max_batch_size": 1467, "get_hidden_size": 1468, "tile": 1469, "inspect": 1470, "intermediate_inputs": 1471, "dummy_lora_id": 1472, "goal": 1473, "kernels": 1474, "purpose": 1475, "sufficient": 1476, "graph_capture": 1477, "graph_capture_context": 1478, "largest": 1479, "help": 1480, "iterate": 1481, "over": 1482, "hence": 1483, "cartesian": 1484, "product": 1485, "cudagraph_capture_sizes": 1486, "cudagraph_inputs_embeds": 1487, "enable_prompt_embeds": 1488, "compilation_cases": 1489, "progress": 1490, "bar": 1491, "get_tensor_model_parallel_rank": 1492, "tqdm": 1493, "use_tqdm_on_load": 1494, "desc": 1495, "shapes": 1496, "use_inputs_embeds": 1497, "graph_capture_get_metadata_for_batch": 1498, "is_encoder_decoder_model": 1499, "graph_runner": 1500, "get_name": 1501, "graph_clone": 1502, "capture_inputs": 1503, "memory_pool": 1504, "atm": 1505, "seqlen_agnostic_capture_inputs": 1506, "get_seqlen_agnostic_capture_inputs": 1507, "_update_inputs_to_capture_for_enc_dec_model": 1508, "pool": 1509, "end_time": 1510, "end_free_gpu_memory": 1511, "cuda_graph_size": 1512, "usually": 1513, "takes": 1514, "finished": 1515, "0f": 1516, "secs": 1517, "2f": 1518, "updates": 1519, "modifies": 1520, "dictionary": 1521, "replay": 1522, "encoder_input_ids": 1523, "encoder_positions": 1524, "unset": 1525, "thing": 1526, "including": 1527, "begin_forward": 1528, "andoorve": 1529, "share": 1530, "receive": 1531, "disagg": 1532, "recv": 1533, "hidden": 1534, "states": 1535, "forwarding": 1536, "database": 1537, "prefilling": 1538, "successfully": 1539, "received": 1540, "operation": 1541, "blocking": 1542, "bypass_model_exec": 1543, "need_recv_kv": 1544, "get_kv_transfer_group": 1545, "recv_kv_caches_and_hidden_states": 1546, "know": 1547, "layer": 1548, "working": 1549, "those": 1550, "model_kwargs": 1551, "sending": 1552, "need_send_kv": 1553, "send_kv_caches_and_hidden_states": 1554, "orig_include_gpu_probs": 1555, "include_gpu_probs_tensor": 1556, "tracking": 1557, "latency": 1558, "start": 1559, "end": 1560, "covering": 1561, "sampled_token_ids": 1562, "valid_outputs": 1563, "sequence_group_output": 1564, "samples": 1565, "output_token": 1566, "sampled_token_embeds": 1567, "get_input_embeddings": 1568, "output_embed": 1569, "recent": 1570, "indices": 1571, "index_select": 1572, "prefill_hidden_states": 1573, "consumer": 1574, "executable": 1575, "is_profile_run": 1576, "numel": 1577, "is_prefill_run": 1578, "is_kv_consumer": 1579, "producer": 1580, "is_kv_producer": 1581, "backend_name": 1582, "attentionstate": 1583, "input_buffers": 1584, "output_buffers": 1585, "_graph": 1586, "_is_encoder_decoder_model": 1587, "few": 1588, "times": 1589, "sure": 1590, "launches": 1591, "initial": 1592, "benchmarking": 1593, "triton": 1594, "autotune": 1595, "enough": 1596, "_num_warmup_iters": 1597, "wait": 1598, "warm": 1599, "finish": 1600, "proceeding": 1601, "output_hidden_or_intermediate_states": 1602, "weak_ref_tensor": 1603, "deleted": 1604, "gc": 1605, "collect": 1606, "save": 1607, "buffers": 1608, "get_graph_input_buffers": 1609, "get_forward_context": 1610, "copy_": 1611, "non_blocking": 1612, "reuse": 1613, "truncate": 1614, "no_attention": 1615, "slot_mapping": 1616, "prepare_graph_input_buffers": 1617, "copy_inputs_before_cuda_graphs": 1618, "contextlib": 1619, "compilation": 1620, "counter": 1621, "core": 1622, "kv_transfer": 1623, "parallel_state": 1624, "worker_manager": 1625, "rotary_embedding": 1626, "tensorizer": 1627, "bump": 1628, "limits": 1629, "recompilations": 1630, "warmups": 1631, "_dynamo": 1632, "cache_size_limit": 1633, "128": 1634, "accumulated_cache_size_limit": 1635, "profiler": 1636, "made": 1637, "within": 1638, "partition": 1639, "associated": 1640, "maintaining": 1641, "assigned": 1642, "model_runner_cls": 1643, "mlp_speculator": 1644, "speculative_args": 1645, "draft_model_config": 1646, "model_type": 1647, "deepseek_mtp": 1648, "glm4_moe_mtp": 1649, "mimo_mtp": 1650, "modelrunnerclass": 1651, "encoderdecodermodelrunner": 1652, "uninitialized": 1653, "cache_engine": 1654, "_seq_group_metadata_cache": 1655, "saved": 1656, "sleep": 1657, "_sleep_saved_buffers": 1658, "configured": 1659, "through": 1660, "env": 1661, "vars": 1662, "vllm_torch_profiler_dir": 1663, "trace": 1664, "torch_profiler_trace_dir": 1665, "traces": 1666, "activities": 1667, "profileractivity": 1668, "with_stack": 1669, "on_trace_ready": 1670, "tensorboard_trace_handler": 1671, "use_gzip": 1672, "start_profile": 1673, "stop_profile": 1674, "key_averages": 1675, "sort_by": 1676, "self_cuda_time_total": 1677, "free_bytes_before_sleep": 1678, "buffer": 1679, "clone": 1680, "named_buffers": 1681, "allocator": 1682, "cumemallocator": 1683, "get_instance": 1684, "offload_tags": 1685, "weights": 1686, "free_bytes_after_sleep": 1687, "freed_bytes": 1688, "used_bytes": 1689, "increased": 1690, "sleeping": 1691, "freed": 1692, "wake_up": 1693, "tags": 1694, "restore": 1695, "all_reduce": 1696, "until": 1697, "synchronization": 1698, "causes": 1699, "grow": 1700, "increases": 1701, "var": 1702, "disables": 1703, "issue": 1704, "discuss": 1705, "pytorch": 1706, "org": 1707, "lifetime": 1708, "191573": 1709, "torch_nccl_avoid_record_streams": 1710, "building": 1711, "nccl_async_error_handling": 1712, "set_device": 1713, "_check_if_gpu_supports_dtype": 1714, "empty_cache": 1715, "reset_peak_memory_stats": 1716, "baseline_snapshot": 1717, "memorysnapshot": 1718, "init_worker_distributed_environment": 1719, "enable_sleep_mode": 1720, "get_current_usage": 1721, "use_memory_pool": 1722, "tag": 1723, "nullcontext": 1724, "profiles": 1725, "peak": 1726, "many": 1727, "allocated": 1728, "ooms": 1729, "conduct": 1730, "existing": 1731, "calculate": 1732, "tip": 1733, "adjusting": 1734, "parameter": 1735, "free_memory_pre_profile": 1736, "total_gpu_memory": 1737, "memory_profiling": 1738, "weights_memory": 1739, "_assert_memory_footprint_increased_during_profiling": 1740, "memory_for_current_instance": 1741, "available_kv_cache_memory": 1742, "non_kv_cache_memory": 1743, "profiled": 1744, "cache_block_size": 1745, "swap_space_bytes": 1746, "profile_time": 1747, "non_torch_memory": 1748, "non_torch_increase": 1749, "activation": 1750, "torch_peak_increase": 1751, "reserved": 1752, "cleanup": 1753, "woosuk": 1754, "free_gpu_memory": 1755, "cuda_memory": 1756, "cleaned": 1757, "allocate": 1758, "warms": 1759, "raise_if_cache_size_invalid": 1760, "_init_cache_engine": 1761, "_warm_up_model": 1762, "ve": 1763, "pairings": 1764, "cross": 1765, "sharing": 1766, "layer_name": 1767, "means": 1768, "shared_kv_cache_layers": 1769, "attn_layers": 1770, "get_layers_from_vllm_config": 1771, "attn_module": 1772, "kv_tgt_layer": 1773, "kv_sharing_target_layer_name": 1774, "own": 1775, "kvcachespec": 1776, "management": 1777, "act": 1778, "exist": 1779, "enables": 1780, "saving": 1781, "allowing": 1782, "accommodate": 1783, "longer": 1784, "simultaneously": 1785, "bind_kv_cache": 1786, "static_forward_context": 1787, "want": 1788, "better": 1789, "num": 1790, "warmup_sizes": 1791, "compile_sizes": 1792, "reverse": 1793, "warming": 1794, "affected": 1795, "tensor_parallel_size": 1796, "cudamemcpyasync": 1797, "int64": 1798, "tgt": 1799, "_get_cached_seq_group_metadata": 1800, "sequencegroupmetadatadelta": 1801, "updating": 1802, "sends": 1803, "delta": 1804, "payload": 1805, "cleans": 1806, "new_seq_group_metadata_list": 1807, "metadata_or_delta": 1808, "apply_delta": 1809, "snapshot": 1810, "sent": 1811, "again": 1812, "preempted": 1813, "scratch": 1814, "finished_id": 1815, "set_custom_all_reduce": 1816, "disable_custom_all_reduce": 1817, "torch_dtype": 1818, "bfloat16": 1819, "noqa": 1820, "sim102": 1821, "has_device_capability": 1822, "80": 1823, "capability": 1824, "get_device_capability": 1825, "gpu_name": 1826, "get_device_name": 1827, "compute_str": 1828, "version_str": 1829, "as_version_str": 1830, "gpus": 1831, "your": 1832, "float16": 1833, "explicitly": 1834, "increasing": 1835, "stored": 1836, "device_allocator": 1837, "cumem": 1838, "ensure_kv_transfer_initialized": 1839, "enc_dec_model_runner": 1840, "pooling_model_runner": 1841, "flag": 1842, "half": 1843, "encoderdecodermodelinput": 1844, "encoder_input_tokens": 1845, "encoder_input_positions": 1846, "unused": 1847, "present": 1848, "compatibility": 1849, "_maybe_force_supported_attention_backend": 1850, "crash": 1851, "unsupported": 1852, "scenarios": 1853, "xformers": 1854, "option": 1855, "raise_backend_err": 1856, "invalid": 1857, "str_not_impl_enc_dec_backend": 1858, "maybe_env_var_forced_backend": 1859, "get_env_variable_attn_backend": 1860, "maybe_global_forced_backend": 1861, "get_global_forced_attn_backend": 1862, "is_forced_by_global": 1863, "is_forced_by_env_var": 1864, "enforced": 1865, "precedence": 1866, "_backend": 1867, "flash_attn": 1868, "_list_to_int32_tensor": 1869, "_list": 1870, "_list_to_long_tensor": 1871, "_empty_int32_tensor": 1872, "_empty_long_tensor": 1873, "assumed": 1874, "entirely": 1875, "encoder_input_tokens_tensor": 1876, "encoder_input_positions_tensor": 1877, "_prepare_encoder_model_input_tensors": 1878, "modified": 1879, "construct": 1880, "decoder_dummy_data": 1881, "is_encoder_data": 1882, "encoder_dummy_data": 1883, "conservative": 1884, "fine": 1885, "prompt_token_ids": 1886, "expected": 1887, "got": 1888, "cross_block_table": 1889, "augment": 1890, "populated": 1891, "sets": 1892, "num_encoder_tokens": 1893, "encoder_seq_lens": 1894, "encoder_seq_lens_tensor": 1895, "cross_slot_mapping": 1896, "cross_block_tables": 1897, "constructs": 1898, "model_inputs": 1899, "updated": 1900, "groups": 1901, "oriented": 1902, "lens": 1903, "embeddings": 1904, "pad_slot_id": 1905, "block_number": 1906, "block_offset": 1907, "convert": 1908, "cross_slot_mapping_tensor": 1909, "max_len_of_block_table": 1910, "match": 1911, "offset": 1912, "encoder_seq_start_loc": 1913, "cumsum": 1914, "attributes": 1915, "sum": 1916, "selector": 1917, "lora_checkpoint": 1918, "lora_serving_config": 1919, "_get_lora_paths_strings": 1920, "lora_modules": 1921, "loramodulepath": 1922, "_get_nxdi_lora_config": 1923, "override_neuron_config": 1924, "target_modules": 1925, "lora_ckpt_paths": 1926, "exceeds": 1927, "loraservingconfig": 1928, "max_lora_rank": 1929, "loracheckpoint": 1930, "get_nxd_sampling_params": 1931, "neuron_config": 1932, "on_device_sampling_config": 1933, "max_topk": 1934, "global_topk": 1935, "prepare_sampling_params": 1936, "get_multi_modal_data_neuron": 1937, "input_images": 1938, "_get_model_architecture": 1939, "mllamaforconditionalgeneration": 1940, "pixel_values": 1941, "aspect_ratios": 1942, "num_chunks": 1943, "has_image": 1944, "squeeze": 1945, "bs": 1946, "empty_pixel_values": 1947, "560": 1948, "empty_aspect_ratios": 1949, "ones": 1950, "aspect_ratio_ids": 1951, "all_supported_aspect_ratios": 1952, "get_all_supported_aspect_ratios": 1953, "vision_config": 1954, "max_num_tiles": 1955, "unsqueeze": 1956, "hf": 1957, "num_tiles": 1958, "image": 1959, "_get_lora_adapter_ids": 1960, "adapter": 1961, "serving": 1962, "indicates": 1963, "nxdi": 1964, "strings": 1965, "integers": 1966, "convert_adapter_ids_to_indices": 1967, "lora_adapter_ids": 1968, "supplied": 1969, "ignoring": 1970, "mllama": 1971, "aspect_ratio_utils": 1972, "modules": 1973, "generation": 1974, "lora_serving": 1975, "entrypoints": 1976, "openai": 1977, "serving_models": 1978, "neuronx_distributed": 1979, "preemptionmode": 1980, "enum": 1981, "preemption": 1982, "modes": 1983, "resumed": 1984, "recomputation": 1985, "discard": 1986, "recompute": 1987, "schedulingbudget": 1988, "slots": 1989, "scheduling": 1990, "right": 1991, "budget": 1992, "aware": 1993, "meaning": 1994, "ahead": 1995, "won": 1996, "token_budget": 1997, "_request_ids_num_batched_tokens": 1998, "default_factory": 1999, "_request_ids_num_curr_seqs": 2000, "_num_cached_tokens": 2001, "_num_batched_tokens": 2002, "_num_curr_seqs": 2003, "can_schedule": 2004, "num_new_tokens": 2005, "num_new_seqs": 2006, "allow": 2007, "been": 2008, "num_batched_tokens": 2009, "num_curr_seqs": 2010, "remaining_token_budget": 2011, "add_num_batched_tokens": 2012, "req_id": 2013, "num_cached_tokens": 2014, "subtract_num_batched_tokens": 2015, "add_num_seqs": 2016, "subtract_num_seqs": 2017, "scheduledsequencegroup": 2018, "sequencegroup": 2019, "smaller": 2020, "decision": 2021, "scheduled_seq_groups": 2022, "genericsequence": 2023, "num_prefill_groups": 2024, "source": 2025, "dest": 2026, "ignored": 2027, "ignored_seq_groups": 2028, "lookahead": 2029, "queue": 2030, "running_queue_size": 2031, "never": 2032, "_sort_by_lora_ids": 2033, "is_empty": 2034, "key_fn": 2035, "sort": 2036, "come": 2037, "schedulerrunningoutputs": 2038, "selected": 2039, "decode_seq_groups": 2040, "prefill_seq_groups": 2041, "swapped_out": 2042, "optimization": 2043, "fast": 2044, "access": 2045, "lists": 2046, "decode_seq_groups_list": 2047, "prefill_seq_groups_list": 2048, "create_empty": 2049, "schedulerswappedinoutputs": 2050, "infeasible": 2051, "infeasible_seq_groups": 2052, "schedulerprefilloutputs": 2053, "waiting": 2054, "fresh": 2055, "recomputed": 2056, "partialprefillmetadata": 2057, "holds": 2058, "information": 2059, "about": 2060, "certain": 2061, "partially": 2062, "prefilled": 2063, "flight": 2064, "us": 2065, "minimize": 2066, "ttft": 2067, "starvation": 2068, "very": 2069, "too": 2070, "iterations": 2071, "limited": 2072, "jump": 2073, "front": 2074, "faster": 2075, "schedulable_prefills": 2076, "long_prefills": 2077, "schedulerconfig": 2078, "concurrent": 2079, "accept": 2080, "shorter": 2081, "concurrently": 2082, "first_seq": 2083, "get_num_new_tokens": 2084, "long_prefill_token_threshold": 2085, "max_long_partial_prefills": 2086, "max_num_partial_prefills": 2087, "maybe_increment_partial_prefills": 2088, "from_queues": 2089, "deque": 2090, "queues": 2091, "accounts": 2092, "peeks": 2093, "potentially": 2094, "waiting_long_prefills": 2095, "sg": 2096, "sequencestage": 2097, "bother": 2098, "looping": 2099, "max_partial_prefills": 2100, "fill": 2101, "break": 2102, "count": 2103, "aren": 2104, "anyway": 2105, "nb": 2106, "tracked": 2107, "separately": 2108, "account": 2109, "track": 2110, "actually": 2111, "loraconfig": 2112, "output_proc_callback": 2113, "policy": 2114, "extremely": 2115, "simple": 2116, "fair": 2117, "improved": 2118, "future": 2119, "version": 2120, "selfattn": 2121, "blockspacemanagerimpl": 2122, "blockspacemanager": 2123, "get_block_space_manager_class": 2124, "space": 2125, "block_manager": 2126, "enable_caching": 2127, "lets": 2128, "released": 2129, "evict": 2130, "_finished_requests_ids": 2131, "prev_time": 2132, "prev_prompt": 2133, "last_prompt_latency": 2134, "user_specified_preemption_mode": 2135, "preemption_mode": 2136, "test": 2137, "artificial": 2138, "enable_artificial_preemption": 2139, "enable_artificial_preempt": 2140, "artificial_preempt_cnt": 2141, "artificial_preemption_max_cnt": 2142, "num_cumulative_preemption": 2143, "_scheduler_running_outputs_cache": 2144, "_scheduled_seq_group_cache": 2145, "async": 2146, "lagged": 2147, "immediately": 2148, "second": 2149, "use_async_output_proc": 2150, "num_cache_iters": 2151, "cache_id": 2152, "seq_group_metadata_builder": 2153, "scheduler_running_outputs_builder": 2154, "scheduled_seq_group_builder": 2155, "postprocessor": 2156, "extra": 2157, "done": 2158, "reaches": 2159, "stopped": 2160, "added": 2161, "deallocation": 2162, "free_finished_seq_groups": 2163, "_async_stopped": 2164, "hand": 2165, "depending": 2166, "slightly": 2167, "integer": 2168, "division": 2169, "splits": 2170, "evenly": 2171, "among": 2172, "partial_prefill_budget_lookup_list": 2173, "next_cache_id": 2174, "lora_enabled": 2175, "num_decoding_tokens_per_seq": 2176, "_add_seq_group_to_running": 2177, "testing": 2178, "purposes": 2179, "_add_seq_group_to_swapped": 2180, "abort_seq_group": 2181, "iterable": 2182, "seq_id_to_seq_group": 2183, "sequencegroupbase": 2184, "aborts": 2185, "status": 2186, "finished_aborted": 2187, "nothing": 2188, "abort": 2189, "request_ids": 2190, "state_queue": 2191, "aborted_groups": 2192, "looks": 2193, "foo_parallel_sample_0": 2194, "foo": 2195, "resolve": 2196, "real_request_id": 2197, "appending": 2198, "aborted": 2199, "pending": 2200, "aborted_group": 2201, "get_seqs": 2202, "is_finished": 2203, "sequencestatus": 2204, "free_seq": 2205, "_free_seq_group_cross_attn_blocks": 2206, "effect": 2207, "free_cross": 2208, "has_unfinished_seqs": 2209, "get_prefix_cache_hit_rate": 2210, "reset_prefix_cache": 2211, "get_num_unfinished_seq_groups": 2212, "get_and_reset_finished_requests_ids": 2213, "flushes": 2214, "previously": 2215, "_schedule_running": 2216, "curr_loras": 2217, "enable_chunking": 2218, "partial_prefill_metadata": 2219, "place": 2220, "capacity": 2221, "ret": 2222, "_get_num_lookahead_slots": 2223, "copied": 2224, "running_queue": 2225, "irrelevant": 2226, "num_uncached_new_tokens": 2227, "_get_num_new_uncached_and_cached_tokens": 2228, "num_running_tokens": 2229, "popleft": 2230, "avoids": 2231, "reached": 2232, "overflow": 2233, "_can_append_slots": 2234, "num_running_seqs": 2235, "get_max_num_running_seqs": 2236, "victim": 2237, "cont_loop": 2238, "preempt": 2239, "lowest": 2240, "priority": 2241, "victim_seq_group": 2242, "preempting": 2243, "do_preempt": 2244, "becomes": 2245, "simply": 2246, "_free_finished_seq_group": 2247, "preempted_mode": 2248, "_preempt": 2249, "_append_slots": 2250, "scheduled_seq_group": 2251, "chase": 2252, "_schedule_swapped": 2253, "schedules": 2254, "fits": 2255, "max_lora": 2256, "swapped_queue": 2257, "leftover_swapped": 2258, "alloc_status": 2259, "can_swap_in": 2260, "allocstatus": 2261, "failing": 2262, "finished_ignored": 2263, "appendleft": 2264, "exceed": 2265, "num_new_tokens_uncached": 2266, "num_new_tokens_cached": 2267, "remove_seq_from_computed_blocks_tracker": 2268, "_swap_in": 2269, "extendleft": 2270, "_get_prompt_limit": 2271, "prompt_limit": 2272, "tuned": 2273, "long_lora_max_len": 2274, "_get_priority": 2275, "highest": 2276, "preference": 2277, "followed": 2278, "arrival": 2279, "arrival_time": 2280, "_schedule_priority_preemption": 2281, "sorts": 2282, "lower": 2283, "preemptions": 2284, "waiting_queue": 2285, "force_preemption_count": 2286, "inversion": 2287, "exists": 2288, "can_allocate": 2289, "ok": 2290, "vseq_group": 2291, "num_running_tokens_uncached": 2292, "put": 2293, "_schedule_prefills": 2294, "treats": 2295, "preempted_for_recompute": 2296, "starts": 2297, "beginning": 2298, "recently": 2299, "generated": 2300, "using_prompt_embeds": 2301, "leftover_waiting_sequences": 2302, "_passed_delay": 2303, "waiting_seqs": 2304, "num_prompt_tokens": 2305, "mix": 2306, "embeds": 2307, "uses_prompt_embeds": 2308, "continuous": 2309, "_allocate_and_set_running": 2310, "couldn": 2311, "_schedule_default": 2312, "queued": 2313, "designed": 2314, "throughput": 2315, "pressure": 2316, "beyond": 2317, "running_scheduled": 2318, "swapped_in": 2319, "prioritized": 2320, "chunking": 2321, "merge": 2322, "ignored_seq_groups_for_embeds": 2323, "indices_ignored": 2324, "schedule_seq_group": 2325, "_schedule_chunked_prefill": 2326, "sustain": 2327, "utilization": 2328, "improves": 2329, "blocked": 2330, "fcfs": 2331, "prioritizes": 2332, "prioritize": 2333, "listed": 2334, "transitioned": 2335, "_order_finishing_prefills_first": 2336, "due": 2337, "ordering": 2338, "assumption": 2339, "scheduled_prefill_seqs": 2340, "sequencegroups": 2341, "finishing": 2342, "get_num_uncomputed_tokens": 2343, "not_finishing": 2344, "_schedule": 2345, "trigger": 2346, "uniform": 2347, "artificial_preemption_prob": 2348, "can_append_slots": 2349, "_allow_async_output_proc": 2350, "async_output_proc": 2351, "no_single_seq": 2352, "changes": 2353, "scheduler_start_time": 2354, "common_computed_block_nums": 2355, "allow_async_output_proc": 2356, "structures": 2357, "maybe_set_first_scheduled_time": 2358, "physical": 2359, "numbers": 2360, "encoder_seq": 2361, "get_encoder_seq": 2362, "managed": 2363, "get_cross_block_table": 2364, "get_block_table": 2365, "access_all_blocks_in_seq": 2366, "get_common_computed_block_ids": 2367, "subsequent": 2368, "is_first_prefill": 2369, "num_computed_tokens": 2370, "ordered": 2371, "send_delta_data": 2372, "1st": 2373, "comm": 2374, "comms": 2375, "cost": 2376, "seq_data_delta": 2377, "get_delta_and_reset": 2378, "created": 2379, "invocation": 2380, "failure": 2381, "retry": 2382, "mark_blocks_as_computed": 2383, "scheduler_time": 2384, "estimate": 2385, "significant": 2386, "component": 2387, "e2e": 2388, "metrics": 2389, "results": 2390, "fork_seq": 2391, "parent_seq": 2392, "child_seq": 2393, "fork": 2394, "_remove_seq_from_computed_blocks_tracker": 2395, "tracker": 2396, 